import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-51',
  name: 'حامل جوال متعدد الاستخدمات',
  slug: 'multi-use-phone-holder',
  story: `أحيانًا، يديك تحتاج إلى استراحة 👐. هذا الحامل ليس مجرد قطعة بلاستيك، بل هو يد ثالثة لك. علّقه على رقبتك وأنت مستلقٍ، أو ثبّته على الطاولة. شاهد أفلامك، تابع وصفاتك، أو قم بمكالمات الفيديو بحرية تامة. إنه الراحة التي تستحقها. 😌`,
  description: `حرر يديك واستمتع بالمشاهدة! هذا الحامل المرن يمكنك تعليقه على رقبتك أو وضعه على الطاولة لمشاهدة مريحة. يدور 360 درجة ويناسب معظم الجوالات والأجهزة اللوحية.###FEATURES###- مرن ويتشكل بأي طريقة تريدها.
- رأس يدور 360 درجة.
- يناسب جوالات وتابلت من 4 إلى 9.5 إنش.
- يمكن تعليقه على الرقبة أو تثبيته على سطح.
- يخفف آلام الرقبة واليدين.###DETAILS###- الخامة: ألمنيوم + بلاستيك
- الوزن: 218 جرام
- خاصية الدوران: نعم، 360 درجة`,
  price: 59.99,
  images: [
    "https://i.ibb.co/FqWjwnjp/image-1.jpg",
    "https://i.ibb.co/Y4LBdSC8/image-2.jpg",
    "https://i.ibb.co/tpGstC4t/image-3.jpg",
    "https://i.ibb.co/9HhZzpRR/image-4.jpg",
    "https://i.ibb.co/xtgjSNWV/image-5.jpg",
    "https://i.ibb.co/BHwcRqC3/image-6.jpg"
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
