import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-51',
  name: 'حامل جوال متعدد الاستخدمات',
  slug: 'multi-use-phone-holder',
  description: `حرر يديك واستمتع بالمشاهدة! هذا الحامل المرن يمكنك تعليقه على رقبتك أو وضعه على الطاولة لمشاهدة مريحة. يدور 360 درجة ويناسب معظم الجوالات والأجهزة اللوحية.###FEATURES###- مرن ويتشكل بأي طريقة تريدها.
- رأس يدور 360 درجة.
- يناسب جوالات وتابلت من 4 إلى 9.5 إنش.
- يمكن تعليقه على الرقبة أو تثبيته على سطح.
- يخفف آلام الرقبة واليدين.###DETAILS###- الماركة: جينريك.
- الضمان: 14 يوم
- الخامة: ألمنيوم + بلاستيك
- الوزن: 218 جرام
- خاصية الدوران: نعم، 360 درجة`,
  price: 59.99,
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
