import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-84',
  name: 'طقم تحدي الراكت – لعبة بيكل بول',
  slug: 'pickleball-game-set',
  story: `لا حاجة لملعب تنس كبير. مع هذا الطقم، أي مساحة فارغة تتحول إلى ملعب للتحدي والمرح. اجمع أصدقائك أو عائلتك، وابدأوا مباراة حماسية. ليس مجرد طقم رياضي، بل هو دعوة مفتوحة لقضاء وقت ممتع ونشيط مع من تحب. 👨‍👩‍👧‍👦`,
  description: `مجموعة لعب متكاملة تحتوي على شبكة، مضارب، وكرات لممارسة ألعاب مثل التنس، تنس الريشة، والبيكل بول. سهلة التركيب ومناسبة لجميع أفراد العائلة.###FEATURES###- مجموعة متكاملة للرياضة والترفيه.
- مناسبة لعدة ألعاب: تنس، تنس ريشة، كرة طائرة مصغرة.
- شبكة متينة وسهلة التركيب.
- تأتي مع حقيبة حمل للتنقل.
- مناسبة للكبار والصغار.###DETAILS###- الماركة: جينيريك
- المواد: قماش أوكسفورد + أنابيب حديد
- ارتفاع الشبكة: 240 سم
- عرض الشبكة: 150 سم`,
  price: 299.99,
  images: [
    'https://i.ibb.co/JW98MhM8/image-1.jpg',
    'https://i.ibb.co/Jwgb4XCF/image-2.jpg',
    'https://i.ibb.co/VWx7MzFR/image-3.jpg',
    'https://i.ibb.co/d4QYcwQv/image-4.jpg',
    'https://i.ibb.co/VY8bgddG/image-5.jpg',
    'https://i.ibb.co/SwVQRCtt/image-6.jpg',
    'https://i.ibb.co/whkQ8gzz/image-7.jpg',
    'https://i.ibb.co/ksGM5XJY/image-8.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
