import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-41',
  name: 'محطة الراعي والمكشات 7 أمبير',
  slug: 'pastor-camping-station-7a',
  story: `في طلعة بر، بعيد عن صخب المدينة، كل ما تحتاجه هو الهدوء ومصدر طاقة تعتمد عليه 💡. "محطة الراعي" هي رفيقك الأمين، تشحن من الشمس وتوفر لك النور والطاقة لشحن جوالك وتشغيل لمباتك. خليك متصل بالطبيعة.. ومتصل بأحبابك. 📲`,
  description: `طاقة لا تنقطع في قلب الطبيعة! هذه المحطة الشمسية هي الحل الأمثل للرحلات والكشتات، حيث توفر لك مصدر طاقة مستمر لشحن أجهزتك وإنارة مكانك عبر 4 لمبات مرفقة.###FEATURES###- تعمل بالطاقة الشمسية مع بطارية 12 فولت/7 أمبير.
- تشحن بالكامل خلال 10-12 ساعة من الشمس.
- منفذ USB لشحن الجوالات والأجهزة الصغيرة.
- مخرج DC لتشغيل 4 لمبات LED.
- صغيرة الحجم وسهلة الحمل.###DETAILS###- البطارية: 12 فولت / 7 أمبير ساعة
- اللوح الشمسي: 18 فولت / 12 واط
- مخرج USB: 5 فولت / 2 أمبير`,
  price: 329.99,
  images: [
    "https://i.ibb.co/TMCNd4jK/image-1.jpg",
    "https://i.ibb.co/YTLmSZNy/image-2.jpg",
    "https://i.ibb.co/tM7Fpq0F/image-3.jpg",
    "https://i.ibb.co/mntJwfQ/image-4.jpg",
    "https://i.ibb.co/231d92SH/image-5.jpg",
    "https://i.ibb.co/bMZPSpdY/image-6.jpg"
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
