import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-13',
  name: 'حافظة مشروبات Moog max الذكية مع سبيكر',
  slug: 'moog-max-smart-bottle-speaker',
  description: `استمتع بمشروبك البارد أو الساخن مع إيقاع موسيقاك المفضلة! حافظة Moog Max ليست مجرد مطارة، بل هي رفيقك اليومي الذي يجمع بين الحفاظ على درجة حرارة مشروبك ومتعة الاستماع للموسيقى.###FEATURES###- تحافظ على الحرارة والبرودة لمدة تصل إلى 12 ساعة.
- مكبر صوت بلوتوث مدمج سهل الفك والتركيب.
- مصنوعة من الستانلس ستيل عالي الجودة.
- تصميم أنيق وعملي بسعة 500 مل.
- قاعدة مقاومة للانزلاق وغطاء محكم.###DETAILS###- السعة: 500 مل
- الخامة: فولاذ مقاوم للصدأ
- الأبعاد: 230 * 65 مللي متر
- مكبر الصوت: بلوتوث 0.5`,
  price: 99.99,
  category: 'home',
};

export default product;
