import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-28',
  name: 'جهاز السينما المتنقل الذكي',
  slug: 'smart-portable-cinema-projector',
  story: `في ليلة صيفية، تحولت حديقة المنزل الخلفية إلى سينما في الهواء الطلق 🌃. وجه الأصدقاء البروجكتر نحو جدار فارغ، وفي لحظات، أصبحوا يشاهدون فيلمهم المفضل تحت النجوم ✨. لم يكن مجرد جهاز، بل كان صانع لحظات سحرية، يحول أي مكان إلى تجربة سينمائية فريدة لا تُنسى.`,
  description: `حوّل أي مكان إلى سينما خاصة بك! هذا البروجكتر الذكي والمحمول يعرض صورة عالية الدقة تصل إلى 4K، مع تصميم دوار 180 درجة لعرض الصورة حتى على السقف.###FEATURES###- تصميم دوار 180 درجة.
- يدعم دقة 4K مع تصحيح تلقائي للانحراف.
- نظام تشغيل أندرويد 11.0 مدمج.
- مكبرات صوت ستيريو 5 واط.
- يدعم الاتصال اللاسلكي بالهواتف.###DETAILS###- نظام التشغيل: أندرويد 11.0
- الدقة الأصلية: 1280 × 720 بكسل (يدعم 4K)
- السطوع: 120 لومن ANSI
- الاتصال: واي فاي، بلوتوث 4.1, HDMI`,
  price: 399.99,
  images: [
    "https://i.ibb.co/fzjjhnqd/6b96b102-194f-4254-9075-a77c6f0ecede.png",
    "https://i.ibb.co/Mx3zw2Pc/343c48a2-b238-4947-a4f9-2e305d229952.jpg",
    "https://i.ibb.co/nNCfN1dr/432ec1d5-b36d-4883-8293-d5326a32c8ac.jpg",
    "https://i.ibb.co/Y7XNTsBQ/c5857018-ec82-477b-82e0-5a8c46504f6b.jpg",
    "https://i.ibb.co/JWhFMBLy/d5010dcb-4704-4ece-95b0-cf47ddb7d330.jpg",
    "https://i.ibb.co/9mprk0nN/edd1bc4e-5e0b-4c74-93d7-f1ec518e59f7.png"
  ],
  category: 'electronics',
};

export default product;
