import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-66',
  name: '2x1 ثلاجة و ترابيزة قابلة للطي',
  slug: '2-in-1-cooler-folding-table',
  description: `حافظة طعام وطاولة في منتج واحد! قابلة للطي، مقاومة للماء، بسعة 17 لتر. مثالية للتخييم، الصيد، والشواء.###FEATURES###- تستخدم كحافظة للطعام أو طاولة.
- مصنوعة من مواد مقاومة للماء.
- قابلة للطي وسهلة التخزين.
- سعة تخزين 17 لتر للمشروبات والطعام.
- خفيفة الوزن وسهلة الحمل.###DETAILS###- الأبعاد عند الفتح: 68×35×93.5 سم
- الأبعاد عند الطي: 44×35×30 سم
- السعة التخزينية: 17 لتر
- المادة: بلاستيك ABS مقاوم للماء`,
  price: 249.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
