import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-50',
  name: 'بنك طاقة لاسلكي 10000 مللي أمبير',
  slug: 'yosonda-10000mah-wireless-power-bank',
  story: `تخيل شاحنًا يلتصق بهاتفك كالمغناطيس 🧲 ويشحنه بدون أسلاك. هذا ليس خيالًا! بنك الطاقة YOSONDA هو الحل السحري الذي يحررك من فوضى الكابلات، مع كابلات مدمجة للطوارئ. إنه الحرية والأناقة والقوة في جهاز واحد. 🚀`,
  description: `يدعم شحن وايرلس للجوال وبه شفاط لعدم إنزلاق الهاتف. تصميم مميز بحيز لحفظ الكابل. جدًا خفيف و محمول. سريع الشحن للجوال. مناسب للطلعات و الرحلات.###DETAILS###- العلامة التجارية:- YOSONDA.
- الموديل:- YXD-A40.
- البطارية:- 10000 مللي أمبير.
- المخرج لاسلكي:- 10 واط.`,
  price: 135,
  images: [
    "https://i.ibb.co/y1qzgYW/image-1.jpg",
    "https://i.ibb.co/mC05vmjK/image-2.jpg",
    "https://i.ibb.co/tPWLs2jy/image-3.jpg",
    "https://i.ibb.co/MkQCsXcw/image-4.jpg",
    "https://i.ibb.co/cKtDkFjZ/image-5.png"
  ],
  category: 'electronics',
};

export default product;
