import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-30',
  name: 'كافر جوال وباوربنك لحماية أيفون 13 pro max',
  slug: 'iphone-13-pro-max-power-bank-case',
  story: `لكل هاتف أسطوري، درع يستحقه 🛡️. هذا الكفر لجهاز آيفون 13 برو ماكس ليس مجرد حماية، بل هو شريان حياة إضافي. صُمم ليحتضن هاتفك بأناقة، ويمنحه القوة لمواجهة يوم طويل دون خوف من نفاد البطارية أو خطر السقوط. إنه وعد بالاستمرارية والأمان لهاتفك الثمين. ✨`,
  description: `بطارية مدمجة بسعة 6800mAh. تصميم نحيف وأنيق وخفيف الوزن. يشحن الجهاز لاسلكيًا بلمسة واحدة. يحمي الجوال من الصدمات والخدوش. شاشة LED لعرض مستوى الشحن.###DETAILS###- السعة: 6800mAh
- متوافق مع: iPhone 13 Pro Max (6.7 انش)
- الخامة: ABS + TPU
- نوع البطارية: ليثيوم بوليمر`,
  price: 125,
  images: [
    "https://i.ibb.co/dsBTnLV8/image-1.jpg",
    "https://i.ibb.co/93sG80Yn/image-5.jpg",
    "https://i.ibb.co/C53Q8f5M/image-4.jpg",
    "https://i.ibb.co/WvKyhYkt/image-2.jpg"
  ],
  category: 'electronics',
};

export default product;
