import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-93',
  name: 'مرطب هواء على شكل سفينة تيتانيك',
  slug: 'titanic-air-humidifier',
  story: `تيتانيك لم تغرق هذه المرة، بل أبحرت إلى منزلك لترطبه! 🚢 هذا المرطب ليس مجرد جهاز، بل هو قطعة فنية تروي قصة بطريقة جديدة. دع سفينة أحلامك تبحر في غرفة معيشتك، ناشرة رذاذًا منعشًا وعطورًا زكية.`,
  description: `مرطب هواء بتصميم فريد على شكل سفينة تيتانيك، مع إضاءة LED وإمكانية إضافة زيوت عطرية. يعمل بصمت ويتم التحكم فيه عن بعد.###FEATURES###- يرطب الجو وينعش المكان ببخار ناعم وبارد.
- إضاءة LED مريحة تضيف جو استرخاء.
- يمكن إضافة زيوت عطرية لتعطير المكان.
- سعة خزان 250 مل تكفي لـ 10 ساعات.
- تحكم عن بعد.
- يعمل بتقنية الموجات فوق الصوتية الصامتة.###DETAILS###- الماركة: جينريك
- السعة: 250 مل
- مدة التشغيل: 10 ساعات تقريبًا
- مصدر الطاقة: كهرباء`,
  price: 199.99,
  images: [
    'https://i.ibb.co/XxYWMz6P/image-1.jpg',
    'https://i.ibb.co/hqL4mXn/image-2.jpg',
    'https://i.ibb.co/gbGsv1pt/image-3.jpg',
    'https://i.ibb.co/zVw8b0Gv/image-4.jpg',
    'https://i.ibb.co/gbym3dM0/image-5.jpg',
    'https://i.ibb.co/gbLZ84S5/image-6.jpg',
    'https://i.ibb.co/qYq4cCMd/image-7.jpg',
    'https://i.ibb.co/YBX14hfF/image-8.jpg',
    'https://i.ibb.co/YFtnL2q9/image-9.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
