import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-110',
  name: 'عرض غسالة محمولة و مسحوق منظف',
  slug: 'portable-washer-and-detergent-bundle',
  story: `السفر لا يعني التخلي عن النظافة! 🧳 هذه الغسالة المحمولة وأوراق المنظف الذكية هي سر ملابسك النظيفة والأنيقة في أي مكان. اغسل ملابسك البيضاء مع الملونة بدون خوف. ليس مجرد عرض، بل هو حل الغسيل للمسافر الذكي.`,
  description: `عرض متكامل للغسيل السريع والفعال. غسالة ملابس وأحذية محمولة قابلة للطي, مع مسحوق منظف على شكل أوراق للحفاظ على الألوان.###FEATURES###- غسالة محمولة قابلة للطي, مثالية للسفر.
- تعقيم بالضوء الأزرق.
- موفرة للماء والكهرباء.
- أوراق منظفة تمنع بهتان الألوان وتسمح بغسل الأبيض مع الملون.
- تنظيف قوي يزيل البقع.###DETAILS###- الغسالة: سعة 2 كجم, مؤقت 5/10 دقائق
- المنظف: 20 ورقة بالعلبة
- الغسالة: قابلة للطي وخفيفة الوزن`,
  price: 110.00,
  images: [
    'https://i.ibb.co/239ph7CJ/image-1.jpg',
    'https://i.ibb.co/NgT47Z7D/image-2.jpg',
    'https://i.ibb.co/NnWr15m6/image-3.jpg',
    'https://i.ibb.co/99n8GG6j/image-4.jpg',
    'https://i.ibb.co/bMs7c7S5/image-5.jpg',
    'https://i.ibb.co/bMLpPPLs/image-6.jpg',
    'https://i.ibb.co/C5mKkg4N/image-7.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
