import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-108',
  name: 'غسالة ملابس و أحذية Denx',
  slug: 'denx-clothes-and-shoe-washer',
  story: `هل سئمت من فرك أحذيتك الرياضية المتسخة؟ 👟 هذه الغسالة الصغيرة هي المنقذ. ضع حذائك، اضغط على زر، وشاهده يعود جديدًا ولامعًا. ليست مجرد غسالة، بل هي مركز تجميل لأحذيتك وملابسك الصغيرة.`,
  description: `تزيل الأوساخ والأتربة والبقع العالقة في أعماق الحذاء بشكل فعال. تساعد على قتل الجراثيم والبكتيريا التي تتراكم داخل الحذاء. تخلصك من عناء تنظيف الأحذية يدويًا, مما يوفر لك الكثير من الوقت والجهد. يمكن استخدامها لتنظيف معظم أنواع الأحذية. تمنع انتقال الأوساخ والأتربة من الأحذية إلى سجاد أو أرضيات منزلك. سهلة الاستخدام وتأتي مع تعليمات واضحة. تقلل من استخدام المنتجات الكيميائية. تطيل عمر أحذيتك. تقدر كمان تستخدمها لغسل الملابس البسيطة.###FEATURES###- تنظيف عميق للأحذية والملابس.
- تقتل الجراثيم والبكتيريا.
- توفر الوقت والجهد مقارنة بالغسيل اليدوي.
- مناسبة لمعظم أنواع الأحذية.
- يمكن استخدامها كغسالة ملابس صغيرة.
- فرشاة نايلون تعتني بالنعال.###DETAILS###- الماركة: denx
- السعة: 2 كيلوغرام
- الطاقة: 260 واط
- الفولت: 220-240 فولت
- مستوى مقاومة الماء: IPX4
- الخامة: ABS بلاستيك + ستانلس ستيل`,
  price: 220.00,
  images: [
    'https://i.ibb.co/5ghMMTD4/image-1.jpg',
    'https://i.ibb.co/qLhsMppg/image-2.jpg',
    'https://i.ibb.co/VcHvL593/image-3.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
