import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-89',
  name: 'مضرب بيسبول LED',
  slug: 'led-baseball-bat-flashlight',
  story: `في ليلة مظلمة، قد تحتاج إلى أكثر من مجرد ضوء. هذا الكشاف على شكل مضرب بيسبول هو درعك المضيء. يضيء لك الطريق، ويعطيك شعورًا بالأمان. ليس مجرد كشاف، بل هو حارسك الشخصي في الظلام. 🦇`,
  description: `كشاف متعدد الوظائف على شكل مضرب بيسبول، يوفر إضاءة قوية بعدة أوضاع، قابل للطي، مقاوم للماء، ويشحن بمنفذ Type-C.###FEATURES###- يعمل كلمبة جلسة أو تريك موجه أو سراج هادئ.
- إضاءة قوية.
- يشحن بسرعة عبر سلك تايب C.
- قابل للتطويل والتقصير.
- مقاوم للماء.
- بطارية تدوم طويلاً.###DETAILS###- الموديل: DLC-32899
- الضمان: سنتين
- القوة: 6 واط
- نوع الشحن: تايب C
- نوع البطارية: بطارية قابلة لإعادة الشحن`,
  price: 119.99,
  images: [
    'https://i.ibb.co/gMZCqx9r/image-1.jpg',
    'https://i.ibb.co/3mt9MjZ3/image-2.jpg',
    'https://i.ibb.co/x87sSqBX/image-3.jpg',
    'https://i.ibb.co/8nrWBHfn/image-4.jpg',
    'https://i.ibb.co/1Y6bQBYT/image-5.jpg',
    'https://i.ibb.co/bMG8RLZ2/image-6.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
