import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-7',
  name: 'ست عواميد إنارة بالطاقة الشمسية',
  slug: 'six-solar-light-poles',
  story: `في ليلة صيفية هادئة، تحولت حديقة المنزل البسيطة إلى مشهد من الخيال 🪄. ستة أعمدة إنارة استيقظت مع غروب الشمس، راسمة مسارًا من الضوء الدافئ بين الأزهار 🌸. لم تكن مجرد أعمدة، بل كانت جواهر صغيرة تعمل بصمت، تستمد طاقتها من الشمس لتهديها للحديقة ليلًا، مضيفة لمسة من السحر والأمان دون الحاجة لأي أسلاك أو تعقيدات.`,
  description: `أضف لمسة من السحر والأمان لحديقتك أو ممراتك مع أعمدة الإنارة الشمسية. لا تحتاج إلى كهرباء أو تمديدات، فقط دعها تستمد قوتها من الشمس لتنير ليلك بضوء دافئ وجذاب.###FEATURES###- تشتغل بالطاقة الشمسية، لا تحتاج كهرباء.
- تشحن نهارًا وتضيء تلقائيًا في الليل.
- مقاومة للمطر والغبار (تصنيف IP65).
- تحتوي على 60 لمبة LED قوية.
- عمر افتراضي طويل يصل إلى 50 ألف ساعة.###DETAILS###- البطارية: 3.7V 2000mAh
- وقت الشحن: 5-6 ساعات
- وقت التشغيل: 6 إلى 12 ساعة
- المواد: ABS + PC`,
  price: 199.99,
  images: [
    "https://i.ibb.co/x8SBh2FH/image-1.jpg",
    "https://i.ibb.co/SqLGB49/image-2.jpg"
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
