import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-68',
  name: 'هامر دريل Greatec',
  slug: 'greatec-hammer-drill',
  story: `لكل جدار عنيد، هناك هيلتي أقوى. هذا الجهاز ليس مجرد دريل، بل هو قوة الطبيعة في يدك 🌪️. يحفر، يكسر، ويثقب أصعب المواد بسهولة. إنه الأداة التي تحول المشاريع الصعبة إلى إنجازات سهلة وممتعة.`,
  description: `جهاز هيلتي قوي من Greatec بقوة 3000 واط، يدعم 3 وظائف (حفر، حفر مطرقي، تكسير) ويأتي مع حقيبة ومجموعة ملحقات.###FEATURES###- محرك قوي 3000 واط يدعم 3 وظائف.
- أسطوانة كبيرة لضربات قوية.
- مقبض دوّار 360 درجة لتحكم أفضل.
- نظام تثبيت SDS-PLUS.
- سرعة تصل إلى 1200 دورة بالدقيقة.###DETAILS###- الماركة: Greatec
- القدرة: 3000 واط
- السرعة: 0-1200 دورة في الدقيقة
- قوة الطرق: 2.2 جول
- نوع التثبيت: أوتوماتيك / 4 شِيار`,
  price: 450.00,
  images: [
    'https://i.ibb.co/8DSBhvNB/image-1.jpg',
    'https://i.ibb.co/Q7hdDLtn/image-2.jpg',
    'https://i.ibb.co/G38gHFQh/image-3.jpg',
    'https://i.ibb.co/tTDGWqLr/image-4.jpg',
    'https://i.ibb.co/4Z9rCSk3/image-5.jpg',
    'https://i.ibb.co/NnpZkb67/image-6.jpg',
    'https://i.ibb.co/MxVQ5CWM/image-7.jpg'
  ],
  category: 'home',
  warranty: 'عام',
};

export default product;
