import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-119',
  name: 'شريط الإضاءة الذكي',
  slug: 'smart-led-strip-light',
  description: `أضف أجواء احتفالية لمنزلك مع شريط الإضاءة الذكي بتأثير الألعاب النارية. يمكن مزامنته مع الموسيقى والتحكم به عبر تطبيق الجوال أو الريموت كنترول. سهل التركيب ويعمل عبر USB.###FEATURES###- تأثير إضاءة يشبه الألعاب النارية.
- مزامنة مع الموسيقى لتجربة تفاعلية.
- تحكم عبر التطبيق أو الريموت كنترول.
- تشغيل عبر USB لتوفير الطاقة.
- تثبيت سريع بلاصق قوي.###DETAILS###- التحكم: تطبيق بلوتوث أو ريموت 24 مفتاح
- عدد المصابيح: 94 LED
- الطاقة: 5 واط
- الجهد: 12 فولت`,
  price: 65.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
