import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-104',
  name: 'خاتم تسبيح إلكتروني',
  slug: 'electronic-tasbeeh-ring',
  story: `في زحمة الحياة، من السهل أن ننسى الذكر. هذا الخاتم هو رفيقك الروحي 📿. يذكرك بأوقات الصلاة، ويساعدك على حساب تسبيحاتك بهدوء وأناقة. ليس مجرد خاتم، بل هو جسر يربطك بصفائك الداخلي في أي وقت ومكان.`,
  description: `خاتم تسبيح ذكي يتصل بالهاتف عبر البلوتوث لتتبع عدد التسبيحات وتذكيرك بأوقات الصلاة.###FEATURES###- يعمل مع تطبيق خاص.
- بلوتوث مدمج للتذكير بـ 5 أوقات للصلاة.
- زر مدمج لتتبع عدد التسبيحات.
- شاشة OLED لعرض الوقت والتسبيحات.
- بطارية تدوم 3 أيام.
- شحن سهل عبر USB.###DETAILS###- الماركة: جينيريك
- المقاس: 17
- البطارية: تدوم 3 أيام
- الشاشة: OLED 0.47 بوصة`,
  price: 119.99,
  images: [
    'https://i.ibb.co/Rk3pYHZy/image-1.jpg',
    'https://i.ibb.co/Tx3RYNDZ/image-2.jpg',
    'https://i.ibb.co/8gPV6Ymb/image-3.jpg',
    'https://i.ibb.co/60W7H001/image-4.jpg',
    'https://i.ibb.co/hRW5Nf5W/image-5.jpg',
    'https://i.ibb.co/DgzdDZRm/image-6.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
