import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-33',
  name: 'جهاز الطاقة الشمسية + شريط الإضاءة',
  slug: 'solar-power-kit-with-light-strip',
  story: `في أعماق البر، حيث لا صوت إلا للطبيعة 🌲، أراد المغامرون أن يضيئوا ليلتهم. لم يكن لديهم كهرباء، لكن كان لديهم الشمس. هذا الجهاز ليس مجرد بطارية، بل هو قطعة من الشمس يمكن حملها ☀️. مع شريط الإضاءة الهدية، تحولت خيمتهم إلى واحة من النور، وأصبحت ليلتهم أكثر دفئًا وأمانًا.`,
  description: `جهاز طاقة شمسية مع بطارية 12 فولت/7 أمبير. يشحن بالطاقة الشمسية خلال 10-12 ساعة. منفذ USB لشحن الجوالات. مخرج DC لتشغيل 4 لمبات LED مرفقة. هدية: شريط إضاءة 10 متر للتخييم.###DETAILS###- البطارية (الجهاز): 12 فولت / 7 أمبير ساعة
- اللوح الشمسي: 18 فولت / 12 واط
- مخرج USB: 5 فولت / 2 أمبير`,
  price: 350,
  images: [
    "https://i.ibb.co/LXwQns9f/image-1.jpg",
    "https://i.ibb.co/k2QSKrLZ/image-2.jpg",
    "https://i.ibb.co/79k748Y/image-3.jpg"
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
