import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-148',
  name: 'صانعة اللقيمات',
  slug: 'dough-ball-maker',
  story: `اللقيمات اللذيذة والذهبية هي نجمة كل جمعة عائلية. هذه الآلة هي سرك لتحضيرها بشكل مثالي وسريع. بثلاث فتحات، تصنع لك أكثر من 100 حبة متناسقة. ليست مجرد آلة، بل هي صانعة السعادة في مطبخك. 😋`,
  description: `آلة صنع اللقيمات من اكسترا, لاسلكية وقابلة للشحن. تصنع أكثر من 100 لقيمة في كل مرة بفضل تصميمها ذو الثلاث فتحات. تأتي مع شاشة رقمية لحساب عدد اللقيمات.###FEATURES###- تصنع أكثر من 100 لقيمة.
- لاسلكية وقابلة للشحن (تعمل 3 ساعات).
- 3 فتحات لتشكيل سريع.
- وعاء قابل للفك لسهولة التنظيف.
- شاشة رقمية لعد اللقيمات.###DETAILS###- الماركة: اكسترا
- السعة: 700 مل
- الطاقة: 100 واط`,
  price: 175.00,
  images: [
    'https://i.ibb.co/Z0rrXrW/image-1.jpg',
    'https://i.ibb.co/NX193jr/image-2.jpg',
    'https://i.ibb.co/ccd6p6Xg/image-3.jpg',
    'https://i.ibb.co/xKH5sLrP/image-4.jpg',
    'https://i.ibb.co/rRSqFWqn/image-5.jpg',
    'https://i.ibb.co/ymqfc855/image-6.jpg',
    'https://i.ibb.co/DPY56DMx/image-7.jpg',
    'https://i.ibb.co/8n54symZ/image-8.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
