import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-36',
  name: 'محول الشاشة العادية للأندرويد + مجموعة ألعاب',
  slug: 'android-tv-box-gaming-bundle',
  story: `كان التلفزيون القديم في غرفة الجلوس يجمع الغبار 📺، حتى وصل هذا المحول السحري. بلمسة زر، تحولت الشاشة الباهتة إلى بوابة لعالم أندرويد الذكي، مكتبة أفلام لا تنتهي 🍿، وكنز من آلاف الألعاب الكلاسيكية 👾. لم يعد التلفزيون مجرد جهاز قديم، بل أصبح مركز الترفيه الأول للعائلة بأكملها.`,
  description: `يدعم دقة 8K Ultra HD. يجي معه ذراعين عشان تلعب براحتك. نظام أندرويد، تقدر تحمّل تطبيقات وتشغل أفلام. يدعم اتصال 5G. يشغل آلاف الألعاب الكلاسيكية.###DETAILS###- النظام: أندرويد
- الاتصال: 5G, HDMI, لاسلكي
- يدعم: التلفزيونات، اللابتوبات، البروجكترات`,
  price: 165,
  images: [
    "https://i.ibb.co/7tzzxN9R/image-1.jpg",
    "https://i.ibb.co/N2yW9YFt/image-2.jpg",
    "https://i.ibb.co/SDqnLBh4/image-3.jpg",
    "https://i.ibb.co/vxzsKVGf/image-4.jpg",
    "https://i.ibb.co/kZFTHdx/image-5.jpg"
  ],
  category: 'electronics',
};

export default product;
