import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-27',
  name: 'جهاز ألعاب بدقة 4K مع دراعات تحكم',
  slug: '4k-gaming-console-with-controllers',
  description: `استرجع ذكريات الطفولة مع جهاز الألعاب هذا! آلاف الألعاب الكلاسيكية بانتظارك على شاشتك الكبيرة بدقة 4K. يأتي مع وحدتي تحكم لاسلكية لتجربة لعب مريحة وممتعة.###FEATURES###- أكثر من 18,500 لعبة مدمجة.
- يدعم 9 أنواع من محاكيات الألعاب.
- يدعم دقة عرض 4K عبر مخرج HDMI.
- وحدتين تحكم لاسلكية 2.4 جيجا.
- إمكانية حفظ تقدم اللعبة.###DETAILS###- عدد الألعاب: 18,500+
- الاتصال: لاسلكي 2.4 جيجا
- التخزين: بطاقة 64 جيجابايت
- المحاكيات المدعومة: 9 أنواع`,
  price: 249.99,
  category: 'electronics',
};

export default product;
