import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-23',
  name: 'كيبورد و ماوس كومبو للالعاب',
  slug: 'gaming-keyboard-mouse-combo',
  description: `أضف لمسة من الاحترافية والألوان إلى مكتبك! هذا الطقم المكون من كيبورد وماوس بإضاءة خلفية ملونة يمنحك تجربة لعب وكتابة مريحة وممتعة.###FEATURES###- إضاءة LED خلفية بألوان قوس قزح.
- تصميم مريح يقلل الإجهاد.
- عجلة ماوس ثلاثية الأبعاد ومضادة للانزلاق.
- يدعم أنظمة تشغيل ويندوز.
- مصنوع من مواد عالية الجودة.###DETAILS###- الكيبورد: 104 مفتاح، طول الكابل 1.5 متر
- الماوس: إضاءة خلفية، طول الكابل 1.5 متر
- الجهد: 5 فولت/200mA`,
  price: 129.99,
  category: 'electronics',
};

export default product;
