import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-79',
  name: 'مجموعة أدوات بيلاتيس بار',
  slug: 'pilates-bar-kit',
  story: `حوّل غرفة معيشتك إلى استوديو بيلاتيس خاص بك! 🧘‍♀️ هذا الطقم هو كل ما تحتاجه لتمرين شامل يقوي جسمك ويزيد من مرونتك. ليس مجرد أدوات، بل هو تذكرتك لجسد رياضي وصحة أفضل، في راحة منزلك.`,
  description: `طقم متكامل لتمارين البيلاتس في المنزل، يساعد على تقوية العضلات وتحسين التوازن والمرونة. خفيف الوزن وسهل التخزين.###FEATURES###- طقم متكامل لتمارين البيلاتس وتقوية الجسم.
- مصنوع من مواد متينة ABS + TPE.
- مقاومة متعددة بفضل 6 أربطة مرنة.
- تصميم خفيف وسهل الحمل.
- مناسب للجنسين وللاستخدام المنزلي.###DETAILS###- الماركة: جينيريك
- الحجم: 32×18.5×9 سم
- الوزن: 1.35 كجم
- المادة: ABS + TPE`,
  price: 159.99,
  images: [
    'https://i.ibb.co/v4xVP7JX/image-1.jpg',
    'https://i.ibb.co/C59pgz0d/image-2.jpg',
    'https://i.ibb.co/CsT1Sz0T/image-3.jpg',
    'https://i.ibb.co/PzDFTXYY/image-4.jpg'
  ],
  category: 'health',
  warranty: '14 يوم',
};

export default product;
