import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-51',
  name: 'حامل جوال متعدد الاستخدمات',
  slug: 'multi-use-phone-holder',
  story: `أحيانًا، يديك تحتاج إلى استراحة 👐. هذا الحامل ليس مجرد قطعة بلاستيك، بل هو يد ثالثة لك. علّقه على رقبتك وأنت مستلقٍ، أو ثبّته على الطاولة. شاهد أفلامك، تابع وصفاتك، أو قم بمكالمات الفيديو بحرية تامة. إنه الراحة التي تستحقها. 😌`,
  description: `خامته قوية وتتحمل. رأسه يلف 360 درجة. تقدر تعلقه على رقبتك أو تحطه على الطاولة. يناسب جوالات وتابلت من 4 إلى 9.5 إنش. مرن ويتشكل بأي طريقة تبغاها.###DETAILS###- الخامة: ألمنيوم + بلاستيك
- الوزن: 218 جرام
- خاصية الدوران: نعم، 360 درجة`,
  price: 100,
  images: [
    "https://i.ibb.co/FqWjwnjp/image-1.jpg",
    "https://i.ibb.co/Y4LBdSC8/image-2.jpg",
    "https://i.ibb.co/tpGstC4t/image-3.jpg",
    "https://i.ibb.co/9HhZzpRR/image-4.jpg",
    "https://i.ibb.co/xtgjSNWV/image-5.jpg",
    "https://i.ibb.co/BHwcRqC3/image-6.jpg"
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
