import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-112',
  name: 'الدولاب البلاستيك المشهور 3 دور',
  slug: '3-tier-plastic-storage-cabinet',
  story: 'الفوضى عدو الهدوء. هذا الدولاب هو الحل السريع والعملي لترتيب أي زاوية في منزلك. بتركيبه السهل وأبوابه المغناطيسية، يحول أي فوضى إلى مساحة منظمة وأنيقة. ليس مجرد دولاب، بل هو صانع النظام.',
  description: `تركيب سهل وسريع بدون أدوات، تخلصه بلمح البصر. حجم مناسب لأي زاوية ويوفر لك مساحة إضافية. مصنوع بجودة عالية ويحمي أغراضك من الغبار.###FEATURES###- أبواب مغناطيسية تفتح من جهتين لسهولة الوصول.
- تصميم عملي يناسب كل مكان في البيت، من المطبخ للمكتب.
- يحافظ على أغراضك نظيفة بفضل الإغلاق المحكم.
- سعة تخزين كبيرة تساعدك على ترتيب أغراضك.###DETAILS###- المواد: بلاستيك ضد الكسر.
- الأبعاد: 54X39X36 سم.
- الضمان: 14 يوم`,
  price: 165,
  images: [
    'https://i.ibb.co/Kc76t5L1/image-1.jpg',
    'https://i.ibb.co/LzjBb0r6/image-2.jpg',
    'https://i.ibb.co/rK5f5qNn/image-3.jpg',
    'https://i.ibb.co/VW7Xb9KB/image-4.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;