import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-7',
  name: 'ست عواميد إنارة بالطاقة الشمسية',
  slug: 'six-solar-light-poles',
  description: `أضف لمسة من السحر والأمان لحديقتك أو ممراتك مع أعمدة الإنارة الشمسية. لا تحتاج إلى كهرباء أو تمديدات، فقط دعها تستمد قوتها من الشمس لتنير ليلك بضوء دافئ وجذاب.###FEATURES###- تشتغل بالطاقة الشمسية، لا تحتاج كهرباء.
- تشحن نهارًا وتضيء تلقائيًا في الليل.
- مقاومة للمطر والغبار (تصنيف IP65).
- تحتوي على 60 لمبة LED قوية.
- عمر افتراضي طويل يصل إلى 50 ألف ساعة.###DETAILS###- الماركة: جينيريك
- الضمان: 14 يوم
- البطارية: 3.7V 2000mAh
- وقت الشحن: 5-6 ساعات
- وقت التشغيل: 6 إلى 12 ساعة
- المواد: ABS + PC`,
  price: 199.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
