import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-78',
  name: 'سبورة رسم للاطفال 10 بوصة',
  slug: '10-inch-kids-drawing-tablet',
  story: `أطلق العنان لخيال طفلك بلا حدود... وبلا فوضى! 🎨 هذه السبورة هي لوحته السحرية التي يرسم عليها، ثم يمحو كل شيء بضغطة زر ليبدأ من جديد. ليست مجرد لعبة، بل هي أداة إبداع نظيفة وممتعة تشجع على التعلم والابتكار.`,
  description: `سبورة رسم إلكترونية بشاشة LCD ملونة حجم 10 بوصة، مثالية لتعليم الأطفال الرسم والكتابة دون فوضى الورق والأقلام.###FEATURES###- زر مسح سريع يمسح المحتوى بضغطة واحدة.
- قابلة لإعادة الاستخدام أكثر من 100 ألف مرة.
- شاشة LCD ملونة 10 إنش، بدون إشعاع وآمنة للعين.
- تصميم خفيف وسهل الحمل.
- هدية مثالية للأطفال.###DETAILS###- الأبعاد: 6.3 × 0.39 × 9.45 إنش.
- شاشة LCD بحجم 10 إنش.
- الوزن: 5 أونصات.`,
  price: 69.99,
  images: [
    'https://i.ibb.co/9m71qTC0/image-1.jpg',
    'https://i.ibb.co/LD8RPRDx/image-2.jpg',
    'https://i.ibb.co/HWv4PLY/image-3.jpg',
    'https://i.ibb.co/DHvFHKg6/image-4.jpg',
    'https://i.ibb.co/mrFbmm0p/image-5.jpg',
    'https://i.ibb.co/4w51yNGb/image-6.jpg',
    'https://i.ibb.co/cS3D1tDQ/image-7.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
