import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-1',
  name: 'راعى الكشتات فانوس متعدد الاستخدامات مع بور بنك من DLC',
  slug: 'dlc-multi-use-lantern-power-bank',
  story: `في قلب الصحراء، تحت سماء مرصعة بالنجوم 🌌، جلس الأصدقاء حول نار خافتة. كان الظلام يحيط بهم، لكن "راعي الكشتات" كان هناك ليحول ليلتهم إلى مغامرة مضيئة. لم يكن مجرد فانوس، بل كان مصدر طاقة لأجهزتهم 🔋، ورفيقًا مغناطيسيًا يلتصق بسيارتهم، ونورًا يرشدهم في كل خطوة. هذا ليس مجرد منتج، بل هو قلب كل رحلة برية لا تُنسى.`,
  description: `إضاءة LED قوية تنور لك المكان بوضوح. شحن USB سريع وما ينقطع بسهولة. تصميم مغناطيسي يثبت على أي سطح معدني. قابل للتعديل بزوايا تناسب احتياجك. مقاوم للمطر والغبار والظروف القاسية. بطارية قوية تدوم معك لفترة طويلة. خفيف الوزن وسهل تحمله بأي مكان.`,
  rawDescription: `راعى الكشتات فانوس متعدد الاستخدامات مع بور بنك من DLC ضمان عاميين
سعر للبيع:
220
ر.س



المميزات: 
إضاءة LED قوية تنور لك المكان بوضوح.
 شحن USB سريع وما ينقطع بسهولة.
 تصميم مغناطيسي يثبت على أي سطح معدني.
 قابل للتعديل بزوايا تناسب احتياجك.
 مقاوم للمطر والغبار والظروف القاسية.
 بطارية قوية تدوم معك لفترة طويلة.
 خفيف الوزن وسهل تحمله بأي مكان.
 مناسب للبيت والرحلات والطوارئ.
 سهل الفك والتركيب والاستخدام اليومي.
 مصنوع من خامات قوية تعيش معك أكثر.
تفاصيل سريعة:
الماركة: DLC
 الموديل: DLC-32898
الضمان: عامين
وكيل الضمان: dlc
 القدرة: 6 – 10 واط
 نوع المنتج: مصباح قابل للشحن
 مصدر الطاقة: USB
 الخاصية: مقاوم للطقس
 الإضاءة: LED قوية
 التعديل: زوايا متعددة
محتويات المنتج:
1 × مصباح DLC-32898 قابل للشحن
 1 × كابل شحن USB
 1 × قاعدة مغناطيسية للتثبيت
 1 × دليل استخدام
كيفية الاستخدام:
اشبك المصباح بالكهرباء أو باوربانك عبر USB.
 ثبت المصباح على سطح معدني أو استخدمه باليد.
 اختَر الزاوية اللي تناسبك.
 شغّل زر التشغيل لتشغيل أو إيقاف الإضاءة.
 بعد الاستخدام نظفه وخزنه بمكان جاف.
تفاصيل سريعة:
الماركة: DLC
 الموديل: DLC-32898
الضمان: عامين
وكيل الضمان: dlc
 القدرة: 6 – 10 واط
 نوع المنتج: مصباح قابل للشحن
 مصدر الطاقة: USB
 الخاصية: مقاوم للطقس
 الإضاءة: LED قوية
 التعديل: زوايا متعددة`,
  price: 220,
  images: [
    "https://i.ibb.co/CD3Dp1F/image-1.jpg",
    "https://i.ibb.co/HfDj1bdF/image-2.jpg",
    "https://i.ibb.co/5gjfDBnC/image-3.jpg",
    "https://i.ibb.co/BVxL8Skb/image-4.jpg",
    "https://i.ibb.co/JwDjmSmj/image-5.jpg",
    "https://i.ibb.co/Mx10bt9T/image-6.jpg",
    "https://i.ibb.co/Fq38mxjy/image-7.jpg",
    "https://i.ibb.co/nNPb8r0J/image-8.jpg",
    "https://i.ibb.co/hxBhk8nd/image-9.jpg"
  ],
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
