import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-90',
  name: 'قطعتين بلف مضيئ للدراجة النارية',
  slug: '2pcs-led-skull-tire-valve-caps',
  description: `أضف لمسة عصرية لسيارتك أو دراجتك مع هذه الأغطية المضيئة للصمامات على شكل جمجمة. تعمل باستشعار الحركة وتزيد من الأمان والإضاءة.###FEATURES###- إضاءة قوية على شكل جمجمة.
- تعمل عن طريق استشعار الحركة.
- تضيف شكلًا عصريًا وجديدًا.
- تزيد الإضاءة الخارجية للتقليل من الحوادث.
- مصنوعة من مواد عالية الجودة.###DETAILS###- الماركة: جينيريك
- الشكل: جمجمة
- الأبعاد: 2.28 × 5.8 × 2.3 سم
- الخامة: ألومنيوم وبلاستيك`,
  price: 39.99,
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
