import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-4',
  name: 'جهاز ألعاب حديث R36S',
  slug: 'r36s-retro-gaming-console',
  story: `هل تتذكر تلك الأيام التي كنا نقضيها في محاولة تحطيم الأرقام القياسية في ألعاب الأركيد؟ 🕹️ جهاز R36S هو آلة زمن تعيدك إلى تلك اللحظات السحرية. يحمل في قلبه أكثر من 10,000 ذكرى، من ألعاب الطفولة التي شكلت جيلًا كاملًا. أمسكه بين يديك، ودع الحنين يأخذك في رحلة عبر الزمن، لعبة بعد لعبة، وابتسامة بعد ابتسامة. 😄`,
  description: `استرجع أجمل ذكريات الطفولة مع جهاز الألعاب المحمول R36S! آلاف الألعاب الكلاسيكية بين يديك في جهاز واحد أنيق وقوي.###FEATURES###- يحتوي على أكثر من 10,000 لعبة كلاسيكية.
- نظام Linux سريع وسهل التصفح.
- شاشة 3.5 إنش بدقة عرض ممتازة.
- معالج رباعي النواة قوي لأداء سلس.
- بطارية 3500mAh تدوم لساعات من اللعب.
- ذاكرة 128 جيجا لتخزين ألعابك المفضلة.###DETAILS###- نظام التشغيل: Linux
- المعالج: ARM Cortex-A35
- الرام: 1GB DDR3L
- السعة التخزينية: 128GB
- الشاشة: 3.5 إنش (640×480)
- البطارية: 3500mAh`,
  price: 299.99,
  images: [
    "https://i.ibb.co/SDpYCVPF/image-1.jpg",
    "https://i.ibb.co/HT3WQm1g/image-2.jpg",
    "https://i.ibb.co/PHV4zGL/image-3.jpg",
    "https://i.ibb.co/RkCKQx8M/image-4.jpg",
    "https://i.ibb.co/prn9QfBC/image-5.jpg"
  ],
  category: 'electronics',
  model3d: 'https://modelviewer.dev/shared-assets/models/gameboy.glb'
};

export default product;