import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-50',
  name: 'بنك طاقة لاسلكي 10000 مللي أمبير',
  slug: 'yosonda-10000mah-wireless-power-bank',
  story: `تخيل شاحنًا يلتصق بهاتفك كالمغناطيس 🧲 ويشحنه بدون أسلاك. هذا ليس خيالًا! بنك الطاقة YOSONDA هو الحل السحري الذي يحررك من فوضى الكابلات، مع كابلات مدمجة للطوارئ. إنه الحرية والأناقة والقوة في جهاز واحد. 🚀`,
  description: `اشحن كل أجهزتك بلمسة واحدة! بنك الطاقة من YOSONDA يدعم الشحن اللاسلكي السريع مع شفاطات لتثبيت هاتفك، بالإضافة إلى كابلات مدمجة لجميع أنواع الأجهزة.###FEATURES###- يدعم الشحن اللاسلكي بقدرة 10 واط.
- شفاط لتثبيت الهاتف أثناء الشحن اللاسلكي.
- كابلات مدمجة (Type-C, Micro USB, Lightning, USB).
- سعة 10000 مللي أمبير.
- خفيف ومحمول ومناسب للرحلات.###DETAILS###- العلامة التجارية: YOSONDA
- الموديل: YXD-A40
- البطارية: 10000 مللي أمبير
- المخرج اللاسلكي: 10 واط`,
  price: 119.99,
  images: [
    "https://i.ibb.co/y1qzgYW/image-1.jpg",
    "https://i.ibb.co/mC05vmjK/image-2.jpg",
    "https://i.ibb.co/tPWLs2jy/image-3.jpg",
    "https://i.ibb.co/MkQCsXcw/image-4.jpg",
    "https://i.ibb.co/cKtDkFjZ/image-5.png"
  ],
  category: 'electronics',
};

export default product;
