import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-5',
  name: 'بور بنك وكشاف بالطاقة الشمسية من دينكس',
  slug: 'denx-solar-power-bank-spotlight',
  story: `في رحلة تخييم بعيدة، حيث لا يوجد مصدر للطاقة، كان الأصدقاء يخشون حلول الظلام وانقطاع هواتفهم. لكن أحدهم أخرج "دينكس الشمسي". لم يكن مجرد باور بانك، بل كان شعلة أمل. استمد قوته من الشمس ليمنحهم الضوء والطاقة، وشحن هواتفهم لاسلكيًا. لقد أدركوا أن الطبيعة ليست عقبة، بل هي مصدر للطاقة لمن يمتلك الأداة الصحيحة.`,
  description: `لا تدع بطارية هاتفك تنفد مرة أخرى، حتى في قلب الطبيعة! بور بنك دينكس الشمسي هو الحل الشامل للطاقة أثناء التنقل.###FEATURES###- يشحن بالطاقة الشمسية ويناسب الطلعات والسفر.
- فيه شحن لاسلكي سريع ومريح.
- يدعم شحن أكثر من جهاز بنفس الوقت.
- مزود بألواح شمسية قابلة للطي.
- إضاءته قوية تنفع للطوارئ والرحلات.###DETAILS###- الموديل: DX421
- الماركة: دينيكس
- سعة البطارية: 20000 mAh
- مخرج لاسلكي: 5V/1A
- قدرة الطاقة الشمسية: 5V/0.3A`,
  price: 159.99,
  images: [
    "https://i.ibb.co/Sk1zFZm/image-1.jpg",
    "https://i.ibb.co/RksbMBz9/image-2.jpg",
    "https://i.ibb.co/1Jr7DGSc/image-3.jpg",
    "https://i.ibb.co/qYzFJRKf/image-4.jpg",
    "https://i.ibb.co/JwRV3X7Y/image-5.jpg"
  ],
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
