import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-135',
  name: 'قطاعة خضروات ومبشرة للمطبخ 3 في 1',
  slug: '3-in-1-vegetable-slicer-grater',
  story: `كل شيف يحتاج إلى أدوات احترافية. هذه القطاعة هي سرك لتحضير أطباق تبدو وكأنها خرجت من مطعم فاخر. 👨‍🍳 تقطع، تبشر، وتصفي في جهاز واحد. ليست مجرد قطاعة، بل هي مساعد الشيف في مطبخك.`,
  description: `أداة مطبخ متكاملة 3 في 1: تقطيع, تصفية, وتخزين. مصنوعة من الستانلس ستيل وتأتي مع 4 شفرات مختلفة. آمنة للاستخدام في غسالة الصحون.###FEATURES###- 3 في 1: تقطيع, تصفية, وتخزين.
- 4 شفرات جوليان متنوعة للتقطيع الاحترافي.
- مصنوعة من ستانلس ستيل قوي لا يصدأ.
- سهلة التنظيف وآمنة لغسالة الصحون.
- سعة وعاء عميقة (11 سم).###DETAILS###- العلامة التجارية: جيسلون
- المادة: ستانلس ستيل
- المقاس: 28 سم (11 إنش)`,
  price: 95.00,
  images: [
    'https://i.ibb.co/tMK5sqSY/image-1.jpg',
    'https://i.ibb.co/TBWZfpZs/image-2.jpg',
    'https://i.ibb.co/8gfHs2gz/image-3.jpg',
    'https://i.ibb.co/fVJGRY7q/image-4.jpg',
    'https://i.ibb.co/TqNcQdq6/image-5.jpg',
    'https://i.ibb.co/1frF8KGm/image-6.jpg',
    'https://i.ibb.co/twXyScpb/image-7.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
