import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-70',
  name: 'مصباح ليزر أبيض قابل للتكبير بقوة 100000 لومن',
  slug: '100000-lumen-zoomable-laser-flashlight',
  description: `كشاف ليزر قوي جدًا مصنوع من ألمنيوم الطيران، بمدى يصل إلى 800 متر، 5 أوضاع إضاءة، ويمكن استخدامه كباور بانك.###FEATURES###- مصنوع من ألمنيوم طيران قوي ومتين جدًا.
- رأسه مصمم لكسر الزجاج والحجر.
- نوره يوصل 800 متر.
- 5 أوضاع إضاءة.
- يمكن استخدامه كباور بانك لشحن الجوال.
- يشحن سريعًا بمنفذ Type-C.###DETAILS###- الماركة: جينيريك
- المادة: ألمنيوم طيران مقوّى
- نوع الشريحة: LED بقوة 30 واط
- نوع الشحن: Type-C شحن سريع
- نوع البطارية: يدعم 18650 و26650`,
  price: 189.99,
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
