import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-39',
  name: 'أصغر كاميرة أمان للعمل والمنزل',
  slug: 'mini-security-camera',
  story: `الأشياء الثمينة لا تقدر بثمن، وكذلك راحة بالك 💎. هذه الكاميرا الصغيرة هي عينك الثالثة التي لا تغفو. بحجمها الذي يكاد لا يرى، يمكنك وضعها في أي مكان لتراقب ما يهمك دون أن يشعر أحد. إنها الحارس الأمين الذي يعمل في الخفاء، ليمنحك الأمان في العلن. 👁️`,
  description: `تصور بجودة 1080p HD. فيها رؤية ليلية. زاوية تصوير عريضة 180°. فيها واي فاي، تقدر تتابع البث المباشر بالجوال. تدعم التسجيل عند الحركة.###DETAILS###- الدقة: 1080P / 720P
- زاوية التصوير: 180 درجة
- الاتصال: واي فاي 2.4GHz
- التخزين: تدعم كرت TF حتى 32GB`,
  price: 95,
  images: [
    "https://i.ibb.co/RpyNgf4c/image-1.jpg",
    "https://i.ibb.co/TM2D7zMN/image-2.jpg",
    "https://i.ibb.co/jB6wDKx/image-3.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
