import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-67',
  name: 'ستائر سيارة قابلة للسحب للحماية من الشمس',
  slug: 'retractable-car-sun-shades',
  description: `ستائر سيارة قابلة للسحب توفر الخصوصية وتحمي من أشعة الشمس، مما يقلل من حرارة السيارة ويحافظ على المقاعد.###FEATURES###- تحمي السيارة من أشعة الشمس الضارة.
- تحافظ على درجة حرارة السيارة.
- توفر المزيد من الخصوصية والأمان.
- تقلل درجة حرارة السيارة من 20 إلى 30 درجة مئوية.
- تناسب جميع أنواع السيارات وسهلة التركيب.###DETAILS###- الماركة: سمارت كيتشن
- الأبعاد: 120 × 72 سم للستارة الواحدة
- اللون: أسود`,
  price: 89.99,
  category: 'misc',
  warranty: 'عامين',
};

export default product;
