import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-18',
  name: 'عرض اليوم الوطني السعودي (حقيبة - ساعة - سماعة - باور بنك)',
  slug: 'saudi-national-day-bundle',
  story: `احتفالاً بروح الوطن 🇸🇦، جمعنا لك كل ما تحتاجه في بكج واحد. هذه ليست مجرد مجموعة من المنتجات، بل هي عدة المواطن العصري. حقيبة لتنقلاتك 🎒، ساعة لتتبع وقتك ونشاطك ⌚، سماعة لعالمك الخاص 🎧، وباور بانك لتبقى متصلاً دائمًا 🔋. إنه عرض يجسد التطور والحياة العصرية التي نعيشها اليوم.`,
  description: `عرض متكامل يجمع لك كل ما تحتاجه في يومك! حقيبة كتف أنيقة مع منفذ USB، باور بانك سريع الشحن، ساعة ذكية لمتابعة نشاطك، وسماعة Type-C بصوت نقي.###FEATURES###- حقيبة كتف أنيقة مع منفذ USB.
- باور بانك 30 واط بسعة 10000mAh.
- سماعة Type-C بصوت نقي وريموت تحكم.
- ساعة ذكية تقيس نبضات القلب والنشاط.
- جميع القطع خفيفة وسهلة الحمل.###DETAILS###- الباور بنك: دينيكس 30W, 10000mAh
- الساعة: Shivay M3 Smart Band
- الحقيبة: yunfan, منفذ USB
- السماعة: Type-C سلكية`,
  price: 249.99,
  images: [
    "https://i.ibb.co/pBg3Y6Zw/image-1.jpg",
    "https://i.ibb.co/Ngtp7r7z/image-2.jpg",
    "https://i.ibb.co/zVJdMHRQ/image-3.jpg",
    "https://i.ibb.co/8Dc4L8CM/image-4.jpg",
    "https://i.ibb.co/tpBbhLFs/image-5.jpg",
    "https://i.ibb.co/9Jqc9Wp/image-6.jpg"
  ],
  category: 'misc',
};

export default product;
