import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-44',
  name: 'محول الجوال إلى جهاز كمبيوتر',
  slug: 'mobile-to-pc-adapter-yesido',
  story: `جوالك أقوى مما تتخيل! مع محول Yesido، يتحول هاتفك من مجرد جهاز اتصال إلى محطة عمل متكاملة 🚀. اعرض مشاريعك على شاشة كبيرة، انقل صورك من الكاميرا مباشرة، وأنجز مهامك بسرعة وسهولة. إنه المفتاح الذي يطلق العنان للقوة الكاملة الكامنة في جوالك.`,
  description: `أطلق العنان لقوة جوالك! هذا المحول من Yesido يضيف 6 منافذ عملية لجهازك (Type-C)، بما في ذلك USB 3.0 وقارئ بطاقات SD/Micro SD، لتنقل ملفاتك وتتصل بأجهزتك بسهولة وسرعة.###FEATURES###- 6 منافذ متعددة في جهاز واحد.
- نقل بيانات سريع عبر USB 3.0.
- قارئ بطاقات SD و Micro SD مدمج.
- تصميم عملي ومحمول.
- متوافق مع أجهزة Type-C.###DETAILS###- العلامة التجارية: Yesido
- نوع الموصل: Type-C HUB
- عدد المنافذ: 6 منافذ
- موديل الجهاز: HB10`,
  price: 119.99,
  images: [
    "https://i.ibb.co/zhxb5tRj/image-1.jpg",
    "https://i.ibb.co/FbwBpfdb/image-2.jpg",
    "https://i.ibb.co/YF6FdC5p/image-3.jpg",
    "https://i.ibb.co/tTfN1mfj/image-4.jpg",
    "https://i.ibb.co/hxNLKdGY/image-5.jpg"
  ],
  category: 'electronics',
};

export default product;
