import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-38',
  name: 'حقيبة السفر وطلعات البر',
  slug: 'travel-and-outdoor-backpack',
  description: `رفيقتك المثالية في كل مغامرة! حقيبة ظهر بسعة كبيرة ومقاومة للماء، مع تصميم مريح للظهر وجيوب متعددة ومنظمة، بما في ذلك جيب خاص للابتوب وآخر للأحذية.###FEATURES###- سعة كبيرة تصل إلى 40 لتر.
- مقاومة للماء والخدوش.
- حافظة مبطنة للابتوب حتى 17 إنش.
- جيب خاص منفصل للأحذية بفتحات تهوية.
- تصميم مريح للظهر وحزام كتف مبطن.###DETAILS###- الماركة: Hp hope
- الخامة: بوليستر
- السعة: 36 إلى 59 لتر
- الأبعاد: 32 × 15 × 44 سم`,
  price: 199.99,
  category: 'misc',
};

export default product;
