import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-37',
  name: 'مترجم فوري شامل 5 في 1 بالذكاء الاصطناعي',
  slug: 'ai-5-in-1-translator',
  story: `سافر "يوسف" حول العالم ✈️، لكن حاجز اللغة كان دائمًا يمنعه من التواصل الحقيقي. مع هذا المترجم، تغير كل شيء. أصبح بإمكانه قراءة اللافتات 📜، التحدث مع السكان المحليين 🗣️، وفهم ثقافات جديدة بعمق. لم يعد الجهاز مجرد مترجم، بل أصبح جواز سفره إلى قلوب الناس وعقولهم في كل بلد يزوره.`,
  description: `يدعم ترجمة النصوص والصور والأصوات من وإلى أكثر من 134 لغة. يعمل عبر الإنترنت ودون اتصال. شاشة لمس 5.0 بوصة عالية الدقة. تصميم أنيق وسهل الحمل.###DETAILS###- حجم الشاشة: 5.0 بوصة
- الذاكرة: 8 جيجا بايت (يدعم بطاقة ذاكرة)
- البطارية: ليثيوم
- لغة الصوت: 134 لغة`,
  price: 215,
  images: [
    "https://i.ibb.co/4nc0g166/image-1.jpg",
    "https://i.ibb.co/xqDMMhRB/image-2.jpg",
    "https://i.ibb.co/XZv4yhSX/image-3.jpg",
    "https://i.ibb.co/23WgJRWw/image-4.jpg"
  ],
  category: 'electronics',
};

export default product;
