import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-88',
  name: 'لعبة الدراجة الثلاثية الراقصة',
  slug: 'dancing-tricycle-toy',
  story: `من قال أن الدراجات لا ترقص؟ 🕺 هذه اللعبة تتحدى كل القواعد. تدور، تتشقلب، وتضيء على أنغام الموسيقى. ليست مجرد لعبة، بل هي عرض بهلواني صغير ومصدر ضحك لا ينتهي للأطفال. 😂`,
  description: `لعبة دراجة ثلاثية كهربائية مسلية للأطفال، تدور 360 درجة بشكل بهلواني مع أضواء ملونة وموسيقى حماسية.###FEATURES###- تصميم كرتوني لطيف.
- تتحرك وتدور 360 درجة بشكل بهلواني.
- أنوار ملونة وموسيقى حماسية.
- مصنوعة من بلاستيك آمن ومتين.
- تعمل بـ 3 بطاريات AA.###DETAILS###- الماركة: جينريك
- الوزن: 308 جرام تقريبًا
- العمر المناسب: من 3 سنوات إلى 12 سنة
- الخامة: بلاستيك قوي وآمن
- البطاريات: 3 بطاريات AA (غير مرفقة)`,
  price: 69.99,
  images: [
    'https://i.ibb.co/pvdS8zLR/image-1.jpg',
    'https://i.ibb.co/Kx5KGRY1/image-2.jpg',
    'https://i.ibb.co/NgvfF7Z0/image-3.jpg',
    'https://i.ibb.co/9HKMWx7g/image-4.jpg',
    'https://i.ibb.co/Fbddc1vm/image-5.jpg',
    'https://i.ibb.co/MxT4XT4j/image-6.jpg',
    'https://i.ibb.co/x8zTrDD8/image-7.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
