import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-41',
  name: 'محطة الراعي والمكشات 7 أمبير',
  slug: 'pastor-camping-station-7a',
  story: `في طلعة بر، بعيد عن صخب المدينة، كل ما تحتاجه هو الهدوء ومصدر طاقة تعتمد عليه 💡. "محطة الراعي" هي رفيقك الأمين، تشحن من الشمس وتوفر لك النور والطاقة لشحن جوالك وتشغيل لمباتك. خليك متصل بالطبيعة.. ومتصل بأحبابك. 📲`,
  description: `يشحن بالطاقة الشمسية. بطارية قوية 12 فولت / 7 أمبير ساعة. فيه USB يشحن الجوال. مخرج DC يشغل لمبات أو أجهزة 12 فولت. يشحن كامل خلال 10 إلى 12 ساعة شمس.###DETAILS###- البطارية: 12 فولت / 7 أمبير ساعة
- اللوح الشمسي: 18 فولت / 12 واط
- مخرج USB: 5 فولت / 2 أمبير`,
  price: 320,
  images: [
    "https://i.ibb.co/TMCNd4jK/image-1.jpg",
    "https://i.ibb.co/YTLmSZNy/image-2.jpg",
    "https://i.ibb.co/tM7Fpq0F/image-3.jpg",
    "https://i.ibb.co/mntJwfQ/image-4.jpg",
    "https://i.ibb.co/231d92SH/image-5.jpg",
    "https://i.ibb.co/bMZPSpdY/image-6.jpg"
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
