import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-146',
  name: 'موقد غاز 4 عيون للمنزل والتخييم',
  slug: '4-burner-gas-stove',
  story: `سواء كنت في مطبخك أو في رحلة تخييم، هذا الموقد هو رفيقك الموثوق. بأربع شعلات ومؤقت دقيق، يمنحك السيطرة الكاملة على طبخك. ليس مجرد موقد، بل هو قلب مطبخك، أينما كان. 🔥`,
  description: `موقد غاز من DLC بأربع شعلات نحاسية ونظام إشعال ذكي. مثالي للمطابخ المنزلية والرحلات, مع تصميم صغير ومؤقت دقيق لضبط وقت الطهي.###FEATURES###- 4 شعلات نحاسية عالية الأداء.
- نظام إشعال ذكي.
- مؤقت دقيق لضبط وقت الطهي.
- تحكم في شدة اللهب.
- مصنوع من مواد قوية ومتينة.###DETAILS###- الماركة: DLC
- الموديل: DLC-49048
- عدد الشعلات: 4 شعلات نحاس
- الأبعاد: 9.5×50×50 سم`,
  price: 185.00,
  images: [
    'https://i.ibb.co/8DnhZCkP/image-1.jpg',
    'https://i.ibb.co/GQdG9z9q/image-2.jpg',
    'https://i.ibb.co/rRHHDXs1/image-3.jpg',
    'https://i.ibb.co/vCZrGzVp/image-4.jpg',
    'https://i.ibb.co/Z6sTzc4g/image-5.jpg',
    'https://i.ibb.co/JW76ttNq/image-6.jpg',
    'https://i.ibb.co/k21HL7n0/image-7.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
