import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-149',
  name: 'عرض كواية بخار لاسلكية وطاولة كي',
  slug: 'cordless-iron-and-ironing-board-bundle',
  story: `الملابس المكوية تعطي انطباعًا بالأناقة. هذا العرض هو كل ما تحتاجه لتحقيق ذلك. كواية لاسلكية تمنحك حرية الحركة، وطاولة قوية تجعل الكي سهلاً. ليس مجرد عرض، بل هو سر مظهرك الأنيق دائمًا. 👔✨`,
  description: `عرض متكامل للكي. كواية بخار لاسلكية قوية مع خاصية التنظيف الذاتي ومضادة للتنقيط, بالإضافة إلى طاولة كي قابلة للطي مع مسند حديد للمكواة.###FEATURES###- كواية بخار لاسلكية بحرارة متغيرة.
- طاولة كي قابلة للطي ومناسبة للمساحات الضيقة.
- الكواية بها خاصية تنظيف ذاتي ومضادة للتنقيط.
- الطاولة تتحمل الاستخدام اليومي وتوفر استقرارًا وأمانًا.###DETAILS###- الكواية: خزان 280 مل, بخار مستمر 20-25 دقيقة
- الطاولة: أبعاد 89 × 33 سم, قابلة للطي`,
  price: 140.00,
  images: [
    'https://i.ibb.co/6CBdsfS/image-1.png',
    'https://i.ibb.co/Q3T5StGM/image-2.jpg',
    'https://i.ibb.co/m5QWzp8X/image-3.jpg',
    'https://i.ibb.co/4nXmKTzM/image-4.jpg',
    'https://i.ibb.co/m5SRzTRc/image-5.jpg',
    'https://i.ibb.co/Kc0tLR7W/image-6.jpg',
    'https://i.ibb.co/qM54JFPJ/image-8.jpg',
    'https://i.ibb.co/7JYXrZ4X/image-9.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
