import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-127',
  name: 'دفاية و موقد 2 في 1',
  slug: '2-in-1-heater-stove',
  description: `جهاز تدفئة وموقد محمول 2 في 1، مثالي للتخييم والرحلات. يوفر تدفئة سريعة بقوة 2000 واط ويمكن استخدامه كموقد للطهي.###FEATURES###- وظيفتان: تدفئة وطهي.
- تصميم خفيف ومحمول.
- قوة 2000 واط لتدفئة سريعة.
- آمن وسهل الاستخدام.
- يعمل على دبات الغاز العادية.
- مصنوع من ستيل مقاوم للصدأ.###DETAILS###- المساحة القابلة للاستخدام: 5 متر مربع
- القوة: 2000 واط
- المادة: فولاذ مقاوم للصدأ 430`,
  price: 149.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
