import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-59',
  name: 'ماتور هواء لكفرات السيارة',
  slug: 'car-tire-air-compressor',
  story: 'على طريق سفر طويل، لاحظت أن إطار سيارتك بدأ يفقد الهواء. لا داعي للقلق. هذا الماتور الصغير هو محطة الوقود المتنقلة الخاصة بك. بضغطة زر، يعيد الحياة لإطاراتك ويتوقف تلقائيًا عند الضغط المثالي. إنه الأمان الذي تحمله معك في صندوق السيارة.',
  description: `يعرض ضغط الكفرات في الوقت الحقيقي. بطارية قابلة للشحن تدوم من 20 إلى 30 دقيقة. يمكن تشغيله بوصلة السيارة. خاصية ضبط الضغط المسبق توقف النفخ تلقائيًا. أسطوانة معدنية متينة. قوة عالية تزيد سرعة النفخ. مزود ببطارية 6000mAh. يحتوي على كشاف LED. يعمل كشاحن طوارئ للجوال.
###FEATURES###
- يعرض ضغط الكفرات في الوقت الحقيقي.
- بطارية قابلة للشحن تدوم من 20 إلى 30 دقيقة.
- يمكن تشغيله بوصلة السيارة.
- خاصية ضبط الضغط المسبق توقف النفخ تلقائيًا.
- أسطوانة معدنية متينة.
- قوة عالية تزيد سرعة النفخ.
- مزود ببطارية 6000mAh.
- يحتوي على كشاف LED.
- يعمل كشاحن طوارئ للجوال.
###DETAILS###
- القوة: 140 واط كحد أقصى
- البطارية: 2000mAh × 3
- الجهد: 12 فولت DC
- الضغط: يصل حتى 150PSI
- مصدر الطاقة: بطارية ليثيوم أو وصلة ولاعة السيارة`,
  price: 260,
  images: [
    'https://i.ibb.co/b8yZbws/image-1.jpg',
    'https://i.ibb.co/4gMqLyKY/image-2.jpg',
    'https://i.ibb.co/BWxr5Mf/image-3.jpg',
    'https://i.ibb.co/1fbGt4dF/image-4.jpg',
    'https://i.ibb.co/14ZDMkh/image-5.jpg'
  ],
  category: 'misc',
};

export default product;
