import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-130',
  name: 'مصباح قاتل البعوض بالأشعة فوق البنفسجية',
  slug: 'uv-mosquito-killer-lamp',
  story: `في ليالي الصيف، البعوض هو العدو الأول. هذا المصباح هو حارسك الليلي 🛡️. يجذب الحشرات بضوئه الأزرق الهادئ، ثم يقضي عليها بصمت. ليس مجرد مصباح، بل هو درعك الواقي من لدغات البعوض المزعجة.`,
  description: `صاعق حشرات كهربائي قوي بقوة 18 واط وجهد يصل إلى 3800 فولت. يستخدم الأشعة البنفسجية لجذب الحشرات ويغطي مساحة تصل إلى 200 متر مربع.###FEATURES###- صاعق بقوة تصل إلى 3800 فولت.
- مصباح 18 واط بالأشعة البنفسجية.
- يغطي مساحة كبيرة (حتى 200 متر مربع).
- بدون صوت مزعج أو رائحة.
- صينية قابلة للفك لسهولة التنظيف.###DETAILS###- الطاقة: 18 واط
- الجهد بالشبكة: 1000 إلى 1200 فولت
- منطقة التغطية: 2100 قدم مربعة`,
  price: 110.00,
  images: [
    'https://i.ibb.co/Dg4336Jh/image-1.jpg',
    'https://i.ibb.co/27Lg9k9Z/image-2.jpg',
    'https://i.ibb.co/sdCM37dZ/image-3.jpg',
    'https://i.ibb.co/Fkwmbc75/image-4.jpg',
    'https://i.ibb.co/jk2hw8Mk/image-5.jpg',
    'https://i.ibb.co/3yLGxTb2/image-6.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
