import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-95',
  name: 'المنشار المتنقل الكهربائي',
  slug: 'portable-electric-chainsaw',
  story: `في حديقتك أو في البر، تحتاج أحيانًا إلى قوة لترويض الطبيعة. هذا المنشار هو قوتك المحمولة. خفيف بما يكفي لتحمله بيد واحدة، وقوي بما يكفي لقطع الأغصان الكبيرة. ليس مجرد منشار، بل هو أداة تشكيل الطبيعة حسب رغبتك. 🌳✂️`,
  description: `منشار كهربائي لاسلكي خفيف الوزن لتقطيع الأخشاب بسهولة وكفاءة، يأتي مع بطاريتين وشاحن سريع.###FEATURES###- بلا أسلاك، يعمل بالبطارية.
- خفيف الوزن وسهل التحكم.
- شفرات حادة وعملية.
- بطارية تدوم لفترة طويلة (يأتي مع بطاريتين).
- مقبض مريح وغير قابل للانزلاق.###DETAILS###- القدرة: 18-21 فولت
- طول المنشار: 12 بوصة
- سرعة السلسلة: 12 متر/ثانية
- الوزن: 2.7 كجم
- نوع البطارية: ليثيوم أيون 18 فولت`,
  price: 399.99,
  images: [
    'https://i.ibb.co/DfF9v7Lb/image-1.jpg',
    'https://i.ibb.co/gMRJYFws/image-2.jpg',
    'https://i.ibb.co/276GdtHL/image-3.jpg',
    'https://i.ibb.co/FbtS4rtM/image-4.jpg',
    'https://i.ibb.co/ns5VPyHM/image-5.jpg',
    'https://i.ibb.co/spzZbjMZ/image-6.jpg',
    'https://i.ibb.co/Wv8JLpTT/image-7.jpg',
    'https://i.ibb.co/TxBjTfZt/image-8.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
