import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-58',
  name: 'دريل كفرات لاسلكي denx ببطارية 3000 مللي أمبير',
  slug: 'denx-wireless-tire-drill',
  story: `عندما تواجهك مشكلة في إطار سيارتك على طريق مقطوع، هذا الدريل هو المنقذ 💪. بقوته الجبارة وبطاريتيه التي لا تخذل، يحول مهمة فك البراغي الصعبة إلى مجرد دقائق. ليس مجرد دريل، بل هو صديقك وقت الشدة على الطريق. 🛠️`,
  description: `دريل لاسلكي قوي لفك وربط براغي الكفرات بسهولة. يأتي مع بطاريتين، شاحن، وملحقات متعددة في حقيبة حمل.###FEATURES###- يعمل ببطارية ليثيوم أيون بقدرة 21 فولت.
- يوفر قوة عزم ودوران عالية (600 نيوتن متر).
- يساعد في فك وربط البراغي بسهولة وسرعة.
- خفيف الوزن وسهل الاستخدام.
- يحتوي على بطاريتين لضمان فترة عمل طويلة.
- مصباح LED مدمج للعمل في الأماكن المظلمة.###DETAILS###- الماركة: دينيكس
- العزم الأقصى: 600 نيوتن متر
- البطارية: 21 فولت / 3000 مل أمبير (بطاريتان)
- سرعة الدوران: 0-3800 دورة في الدقيقة
- الإضاءة: مصباح LED مدمج`,
  price: 499.99,
  images: [
    'https://i.ibb.co/1JByfHmL/image-1.jpg',
    'https://i.ibb.co/Pv8xMD5h/image-2.jpg',
    'https://i.ibb.co/W4KPTSfk/image-3.jpg',
    'https://i.ibb.co/nN2KWv8S/image-4.jpg',
    'https://i.ibb.co/SwZNrgY3/image-5.jpg',
    'https://i.ibb.co/Ldkmd5g0/image-6.jpg',
    'https://i.ibb.co/qLv1dJKW/image-7.jpg',
    'https://i.ibb.co/rGYgrKvM/image-8.jpg',
    'https://i.ibb.co/wFwrj1YJ/image-9.jpg'
  ],
  category: 'electronics',
  warranty: 'عام',
};

export default product;
