import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-112',
  name: 'الدولاب البلاستيك المشهور 3 دور',
  slug: '3-tier-plastic-storage-cabinet',
  description: `حل تخزين عملي وأنيق لأي زاوية في منزلك. تركيب سهل وسريع بدون أدوات، مع أبواب مغناطيسية تفتح من جهتين لسهولة الوصول. يحمي أغراضك من الغبار ويوفر مساحة كبيرة.###FEATURES###- تركيب سهل وسريع بدون أدوات.
- حجم مناسب للزوايا والمساحات الصغيرة.
- يحمي الأغراض من الغبار.
- أبواب مغناطيسية تفتح من جهتين.
- تصميم عملي يناسب كل غرف المنزل.
- سعة تخزين كبيرة ومنظمة.###DETAILS###- المادة: بلاستيك ضد الكسر
- الأبعاد: 54x39x36 سم
- الماركة: جينيريك`,
  price: 135.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
