import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-9',
  name: 'كاميرا الفلوج الذكية ضد الماء',
  slug: 'waterproof-smart-vlogging-camera',
  description: `وثّق مغامراتك فوق وتحت الماء! كاميرا الفلوج الذكية هي رفيقك المثالي لتصوير كل لحظة مثيرة. بغلافها المقاوم للماء وجودتها العالية، يمكنك التقاط صور ومقاطع فيديو مذهلة.###FEATURES###- تأتي مع غلاف مقاوم للماء للتصوير تحت الماء.
- ممتازة لتصوير الفلوقات والسفر والمغامرات.
- عدسة واسعة 140 درجة لالتقاط مشهد كامل.
- تصوير بدقّة 4K لجودة احترافية.
- تصميم صغير وخفيف، يسهل حملها.###DETAILS###- الماركة: جينيريك
- الضمان: 14 يوم
- دقة الفيديو: 1080p / 4K
- مقاومة للماء: حتى 30 متر
- زاوية العدسة: 140 درجة
- حجم الشاشة: 2 إنش`,
  price: 129.99,
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
