import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-24',
  name: 'تابلت شبيه الايفون + كيبورد بلوتوث',
  slug: 'iphone-like-tablet-with-keyboard',
  description: `احصل على إنتاجية عالية وتصميم أنيق مع هذا التابلت الشبيه بالآيفون! يأتي مع كيبورد بلوتوث وذاكرة كبيرة ليساعدك على إنجاز مهامك بسرعة وسهولة.###FEATURES###- ذاكرة رام 6 جيجا و مساحة 256 جيجابايت.
- يدعم شريحة 5G.
- يأتي مع كيبورد بلوتوث يدعم اللغة العربية.
- شاشة 7 بوصة عالية الوضوح.
- بطارية 5000 مللي أمبير تدوم طويلاً.###DETAILS###- المساحة: 256GB
- الرام: 6 جيجا
- الشبكة: 5G
- الشاشة: 7 بوصة
- البطارية: 5000 مللي أمبير`,
  price: 549.99,
  category: 'electronics',
};

export default product;
