import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-135',
  name: 'قطاعة خضروات ومبشرة للمطبخ 3 في 1',
  slug: '3-in-1-vegetable-slicer-grater',
  description: `أداة مطبخ متكاملة 3 في 1: تقطيع, تصفية, وتخزين. مصنوعة من الستانلس ستيل وتأتي مع 4 شفرات مختلفة. آمنة للاستخدام في غسالة الصحون.###FEATURES###- 3 في 1: تقطيع, تصفية, وتخزين.
- 4 شفرات جوليان متنوعة للتقطيع الاحترافي.
- مصنوعة من ستانلس ستيل قوي لا يصدأ.
- سهلة التنظيف وآمنة لغسالة الصحون.
- سعة وعاء عميقة (11 سم).###DETAILS###- العلامة التجارية: جيسلون
- المادة: ستانلس ستيل
- المقاس: 28 سم (11 إنش)`,
  price: 95.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
