import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-75',
  name: 'مغسلة السيارات المحمولة',
  slug: 'portable-car-washer',
  story: `سيارتك تستحق أن تلمع دائمًا ✨. مع هذه المغسلة المحمولة، لم يعد تنظيف السيارة مهمة صعبة. املأ الخزان، وصلها بولاعة السيارة، واستمتع بغسيل سيارتك في أي مكان. ليست مجرد مغسلة، بل هي سبا متنقل لسيارتك. 🚿`,
  description: `مغسلة محمولة لتنظيف سيارتك بسهولة في أي مكان. تعمل على ولاعة السيارة وتأتي مع خزان 16 لتر وفرشاة وخرطوم طويل.###FEATURES###- صندوق لتخزين الأجزاء بسهولة.
- فرشاة للمساعدة في التخلص من الأتربة.
- تنظيف سريع للسيارة.
- متعددة الاستخدامات: تنظيف الأرضيات وسقي الحدائق.
- خرطوم مياه طويل لسهولة الاستخدام.###DETAILS###- العلامة التجارية: MRK Groups
- قوة المحرك: 40 واط
- سعة الخزان: 16 لترًا
- مصدر الطاقة: موصل ولاعة السجائر`,
  price: 132,
  images: [
    'https://i.ibb.co/LzzvV51Z/image-1.png',
    'https://i.ibb.co/Fkh1cHn1/image-2.png',
    'https://i.ibb.co/7dwBkfh8/image-3.png',
    'https://i.ibb.co/rfpND33W/image-4.png',
    'https://i.ibb.co/LzLtpDbM/image-5.png',
    'https://i.ibb.co/0y9mcFnm/image-6.jpg',
    'https://i.ibb.co/cS3M3QCG/image-7.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;