import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-9',
  name: 'كاميرا الفلوج الذكية ضد الماء',
  slug: 'waterproof-smart-vlogging-camera',
  story: `من قمة جبل شاهق 🏔️ إلى أعماق بحر هادئ 🌊، هذه الكاميرا هي عينك التي لا تعرف المستحيل. صُممت لتكون رفيق المغامرين، فهي لا تخشى الماء ولا المرتفعات. صغيرة بما يكفي لتكون في جيبك، وقوية بما يكفي لتوثيق أروع لحظات حياتك بدقة 4K. كل مغامرة تبدأ بالضغط على زر التسجيل. 🔴`,
  description: `تأتي مع غلاف مقاوم للماء للتصوير تحت الماء. ممتازة لتصوير الفلوقات والسفر. عدسة واسعة 140 درجة. تصوير بدقّة 4K. تصميم صغير وخفيف.###DETAILS###- دقة الفيديو: 1080p / 4K
- مقاومة للماء: حتى 30 متر
- زاوية العدسة: 140 درجة
- حجم الشاشة: 2 إنش`,
  price: 135,
  images: [
    "https://i.ibb.co/qLKgDz7t/image-1.jpg",
    "https://i.ibb.co/dskSsQWb/image-2.png",
    "https://i.ibb.co/LzKSk86f/image-3.png",
    "https://i.ibb.co/rKrHypNZ/image-4.jpg",
    "https://i.ibb.co/nsYzRm5H/image-5.jpg",
    "https://i.ibb.co/xSStv880/image-6.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
