import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-152',
  name: 'طاولة قابلة للتعديل',
  slug: 'adjustable-table',
  story: `سواء كنت تعمل من المنزل، أو تستمتع بوجبة أمام التلفزيون، هذه الطاولة هي صديقتك المرنة. تتكيف مع ارتفاعك ووضعيتك لتمنحك الراحة المثالية. ليست مجرد طاولة، بل هي شريكك الذي يتأقلم معك. 🤝`,
  description: `طاولة متعددة الاستخدامات للابتوب أو القراءة أو الأكل. يمكن تعديل ارتفاعها وميلان سطحها, وتأتي مع عجلات لسهولة الحركة وحواجز لمنع انزلاق الأشياء.###FEATURES###- تنفع للابتوب, القراءة, أو الأكل.
- ارتفاع قابل للتعديل (59-89 سم).
- سطح مائل مع حواجز لمنع الانزلاق.
- هيكل حديد متين مع عجلات.
- خفيفة وسهلة التخزين.###DETAILS###- المادة: خشب مع هيكل حديد
- الأبعاد: 60 × 40 × 59-89 سم`,
  price: 110.00,
  images: [
    'https://i.ibb.co/rKGw0Fmm/image-1.jpg',
    'https://i.ibb.co/99f6GxBk/image-2.jpg',
    'https://i.ibb.co/PvR1ns8M/image-3.jpg',
    'https://i.ibb.co/dstL08pW/image-4.jpg',
    'https://i.ibb.co/kgL7D8WC/image-5.jpg',
    'https://i.ibb.co/dsCxnN8W/image-6.jpg',
    'https://i.ibb.co/4RCNYsxM/image-7.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
