import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-59',
  name: 'ماطور هواء لكفرات السيارة بقوة 288 واط',
  slug: 'car-air-compressor-288w',
  description: `ماطور هواء قوي ومحمول لنفخ إطارات السيارة والكرات والدراجات بسرعة وكفاءة. يعمل على ولاعة السيارة.###FEATURES###- قوة 288 واط لأداء قوي وموثوق.
- ضغط قابل للتعديل يصل حتى 150 رطل لكل بوصة مربعة.
- حجم صغير وتصميم مدمج، سهل الحمل.
- ينفخ الإطارات بسرعة (55 لتر/دقيقة).
- يعمل بـ 2 بستم.###DETAILS###- الماركة: جينريك
- الجهد: 12 فولت
- أقصى ضغط: 150 رطل لكل بوصة مربعة
- القوة: 288 واط
- تدفق الهواء: 55 لتر/دقيقة
- الاسطوانة: 30 ملم`,
  price: 189.99,
  category: 'electronics',
  warranty: '6 شهور',
};

export default product;
