import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-34',
  name: 'خاتم ذكي معدني مع جهاز مراقبة الصحة',
  slug: 'smart-health-monitoring-ring',
  story: `في الماضي، كانت الصحة تقاس بالأرقام في عيادة الطبيب 👨‍⚕️. اليوم، أصبحت الصحة رفيقًا أنيقًا على إصبعك. هذا الخاتم ليس مجرد قطعة مجوهرات 💍، بل هو مستشارك الصحي الشخصي. يراقب نبضك أثناء النوم 😴، ويعد خطواتك أثناء المشي، ويمنحك رؤية شاملة للياقتك البدنية، كل ذلك بتصميم معدني يخطف الأنظار.`,
  description: `تصميم معدني أنيق وخفيف الوزن يجمع بين التكنولوجيا والموضة. يراقب صحتك على مدار الساعة ويمنحك بيانات دقيقة لتحسين نمط حياتك.
###FEATURES###
- تتبع أكثر من 100 وضع رياضي مختلف.
- مقاوم للماء بمعيار IP68، مما يجعله مثاليًا للسباحة.
- يراقب معدل نبض القلب، نسبة الأكسجين في الدم، جودة النوم، ومستوى الضغط.
- شحن مغناطيسي سريع ومريح.
- بطارية تدوم من 3 إلى 5 أيام من الاستخدام المتواصل.
###DETAILS###
- النظام: BT5.1
- مقاومة الماء: IP68
- وضعيات الرياضة: أكثر من 100 وضع
- بطارية: حوالي 18mAh تدوم 3–5 أيام`,
  price: 140,
  images: [
    "https://i.ibb.co/fVmjRMm2/image-1.jpg",
    "https://i.ibb.co/7txPNjTz/image-2.jpg",
    "https://i.ibb.co/VpqTNP2T/image-3.jpg",
    "https://i.ibb.co/B2Wgryt0/image-4.jpg"
  ],
  category: 'health',
};

export default product;
