import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-40',
  name: 'ميزان لتحليل جميع بيانات الجسم',
  slug: 'body-analysis-smart-scale',
  story: `رحلة اللياقة ليست مجرد رقم على الميزان. هذا الجهاز الذكي هو مرشدك في هذه الرحلة 🗺️. لا يخبرك بوزنك فقط، بل يكشف لك أسرار جسمك: نسبة الدهون، كتلة العضلات، ومستوى الترطيب. كل يوم، يمنحك خريطة واضحة لتفهم جسمك بشكل أفضل وتتخذ قرارات صحية أكثر ذكاءً. 🎯`,
  description: `يتّصل بالجوال بالبلوتوث. شاشة LCD واضحة. يقيس الوزن، الدهون، الماء، العضلات، والسعرات بدقة. يدعم تطبيق ذكي لمتابعة التقدم. يتحمّل وزن حتى 180 كيلو.###DETAILS###- الاتصال: بلوتوث
- سعة الوزن: حتى 180 كجم
- البطارية: 2 × بطارية AAA
- المواد: زجاج مقوّى`,
  price: 105,
  images: [
    "https://i.ibb.co/whKwHyzv/image-1.jpg",
    "https://i.ibb.co/NgGfBHvm/image-2.jpg"
  ],
  category: 'health',
  warranty: 'عام',
};

export default product;
