import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-20',
  name: 'ساعة يد ذكية بشاشة كاملة',
  slug: 'full-screen-smart-watch',
  description: `ابق على اتصال وتابع صحتك بأناقة! هذه الساعة الذكية بشاشتها الكاملة تتيح لك استقبال المكالمات والإشعارات، وقياس نبضات القلب وضغط الدم.###FEATURES###- متابعة قياسات طبية (ضربات القلب، ضغط الدم).
- ربط بالهاتف واستقبال المكالمات والإشعارات.
- شاشة كاملة تعمل باللمس 1.54 بوصة.
- بطارية 195 مللي أمبير.
- شحن لاسلكي.###DETAILS###- البلوتوث: 3.0 و 4.0
- البطارية: 195 مللي أمبير
- الشاشة: 1.54 HD IPS
- الشحن: لاسلكي`,
  price: 159.99,
  category: 'health',
};

export default product;
