import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-73',
  name: 'جهاز الفقاعات للاطفال',
  slug: 'bubble-machine-for-kids',
  story: `في حفلة عيد الميلاد، كان الأطفال يركضون ويصرخون. ثم خرج هذا الجهاز، وفي ثوانٍ، امتلأ الجو بآلاف الفقاعات المتلألئة ✨. تحول الصراخ إلى ضحكات، والجري إلى مطاردة للفقاعات. ليس مجرد جهاز، بل هو صانع السعادة الفوري. 😄`,
  description: `مدفع فقاعات كهربائي يطلق عددًا كبيرًا من الفقاعات بسرعة، لإضافة جو من المرح للحفلات واللعب في الهواء الطلق.###FEATURES###- يطلق عددًا كبيرًا من الفقاعات بسرعة.
- يعمل ببطارية قابلة للشحن.
- تصميم خفيف وسهل الحمل.
- مناسب للحفلات والحدائق.
- مصنوع من بلاستيك آمن.###DETAILS###- الخامة: بلاستيك ABS آمن ومتين
- التشغيل: بطارية قابلة للشحن
- الاستخدام: للأطفال والكبار`,
  price: 79.99,
  images: [
    'https://i.ibb.co/jZ5MyvHX/image-1.jpg',
    'https://i.ibb.co/DPXBn6Cp/image-2.jpg',
    'https://i.ibb.co/0jvHg9fB/image-3.jpg',
    'https://i.ibb.co/PvWdLd5q/image-4.jpg',
    'https://i.ibb.co/dSpqFxY/image-5.jpg',
    'https://i.ibb.co/G3BvDcz0/image-6.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
