import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-2',
  name: 'كشاف دينكس الأكبر حجما',
  slug: 'denx-large-solar-spotlight',
  description: `ودّع فواتير الكهرباء المرتفعة وأنر مساحاتك الخارجية بقوة الشمس! كشاف دينكس هو الحل الأمثل لإضاءة الحدائق، الممرات، والمزارع بكفاءة واعتمادية.###FEATURES###- إضاءة قوية بفضل لمبات LED 5730 الموفرة.
- يشتغل بالطاقة الشمسية بدون كهرباء أو أسلاك.
- بطارية 25000mAh تدوم حتى 16 ساعة.
- يدعم التحكم بالريموت عن بعد بكل سهولة.
- فيه حساس رادار يشتغل أوتوماتيكي مع الحركة.
- مقاوم للمطر والغبار بمعيار حماية IP67.
- يتحمل أصعب الأجواء مثل المطر والعواصف الرملية.
- إضاءة ذكية تشتغل تلقائي مع الغروب وتطفي مع الشروق.###DETAILS###- الماركة: دينيكس
- الضمان: عامين 
- نوع اللمبات: LED 5730
- سعة البطارية: 25000mAh ليثيوم
- معيار الحماية: IP67 ضد الماء والغبار`,
  price: 249.99,
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
