import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-134',
  name: 'مؤشر مستوى الغاز الذكى',
  slug: 'smart-gas-level-indicator',
  story: `لا تدع أنبوبة الغاز تنتهي في منتصف طبختك! 🔥 هذا المؤشر الصغير هو منقذك. يلصق على الأنبوبة ويخبرك بمستوى الغاز المتبقي بلمحة. ليس مجرد مؤشر، بل هو راحة بالك في المطبخ.`,
  description: `مؤشر مغناطيسي يوضح لك كمية الغاز المتبقية في الأسطوانة. يعمل عن طريق قياس الحرارة وهو قابل لإعادة الاستخدام. مثالي للمطابخ والرحلات.###FEATURES###- يبين كمية الغاز المتبقية بوضوح.
- يثبت على الأسطوانة بمغناطيس قوي.
- يقيس الحرارة لتحديد مستوى الغاز.
- قابل لإعادة الاستخدام.
- يعمل مع غاز البوتان والبروبان.###DETAILS###- الأبعاد: 19.7 × 10 سم
- نطاق الحرارة: -10°C إلى 120°C
- طريقة التثبيت: مغناطيس`,
  price: 29.00,
  images: [
    'https://i.ibb.co/RGyqtvNW/image-1.jpg',
    'https://i.ibb.co/tM3J8JGQ/image-2.jpg',
    'https://i.ibb.co/jp54Czz/image-3.jpg',
    'https://i.ibb.co/SwCyJ53k/image-4.jpg',
    'https://i.ibb.co/MyT2Jnk5/image-5.jpg',
    'https://i.ibb.co/hFtqzB9F/image-6.jpg',
    'https://i.ibb.co/KxR16nch/image-7.jpg',
    'https://i.ibb.co/0pxkK5Gp/image-8.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
