import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-153',
  name: 'طاولة سرير قابلة للطى',
  slug: 'folding-bed-table',
  description: `طاولة عملية وقابلة للطي للاستخدام على السرير أو الكنبة. سطحها قابل للتعديل بخمس زوايا مختلفة مع جزء ثابت للماوس. مصنوعة من خشب متين وأرجل ألومنيوم.###FEATURES###- تستخدم كمكتب لابتوب أو طاولة عشاء.
- سطح قابل للتعديل بـ 5 زوايا.
- جزء ثابت للماوس.
- أرجل قابلة للطي لسهولة التخزين.
- خفيفة الوزن ومحموله.###DETAILS###- المقاس: 55 × 32 × 25 سم
- الوزن: 2.36 كجم
- المادة: خشب مُصنّع + أنابيب ألومنيوم`,
  price: 95.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
