import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-33',
  name: 'جهاز الطاقة الشمسية + شريط الإضاءة',
  slug: 'solar-power-kit-with-light-strip',
  description: `طقم متكامل للطاقة والإضاءة في البر والرحلات! جهاز طاقة شمسية صغير الحجم مع بطارية قوية، بالإضافة إلى شريط إضاءة 10 أمتار كهدية. كل ما تحتاجه لإنارة وشحن أجهزتك بعيدًا عن الكهرباء.###FEATURES###- جهاز طاقة شمسية مع بطارية 12 فولت/7 أمبير.
- يشحن بالطاقة الشمسية خلال 10-12 ساعة.
- منفذ USB لشحن الجوالات.
- مخرج DC لتشغيل 4 لمبات LED مرفقة.
- هدية: شريط إضاءة 10 متر للتخييم.###DETAILS###- الماركة: جينريك
- الضمان: 14 يوم
- البطارية: 12 فولت / 7 أمبير ساعة
- اللوح الشمسي: 18 فولت / 12 واط
- مخرج USB: 5 فولت / 2 أمبير`,
  price: 349.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
