import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-75',
  name: 'مغسلة السيارات المحمولة',
  slug: 'portable-car-washer',
  description: `مغسلة محمولة لتنظيف سيارتك بسهولة في أي مكان. تعمل على ولاعة السيارة وتأتي مع خزان 16 لتر وفرشاة وخرطوم طويل.###FEATURES###- صندوق لتخزين الأجزاء بسهولة.
- فرشاة للمساعدة في التخلص من الأتربة.
- تنظيف سريع للسيارة.
- متعددة الاستخدامات: تنظيف الأرضيات وسقي الحدائق.
- خرطوم مياه طويل لسهولة الاستخدام.###DETAILS###- العلامة التجارية: MRK Groups
- قوة المحرك: 40 واط
- سعة الخزان: 16 لترًا
- مصدر الطاقة: موصل ولاعة السجائر`,
  price: 199.99,
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
