import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-43',
  name: 'budi power bank 20000',
  slug: 'budi-power-bank-20000',
  description: `طاقة إضافية في جيبك! باور بانك Budi بسعة 20,000 مللي أمبير وشحن سريع هو الحل الموثوق للحفاظ على أجهزتك مشحونة طوال اليوم. صغير، أنيق، وقوي.###FEATURES###- سعة بطارية كبيرة 20,000mAh.
- يدعم الشحن السريع.
- منفذين USB لشحن جهازين في نفس الوقت.
- تصميم صغير وسهل الحمل.
- متوافق مع أغلب الجوالات والأجهزة.###DETAILS###- الماركة: budi
- السعة: 20,000 مللي أمبير
- عدد المنافذ: 2 منفذ USB
- يدعم الشحن السريع`,
  price: 129.99,
  category: 'electronics',
  warranty: 'عامين',
  story: 'في زحمة الحياة اليومية، يصبح هاتفك هو نافذتك على العالم. باور بانك Budi هو الضمان بأن هذه النافذة لن تغلق أبدًا. بسعته الكبيرة التي تكفي لشحن هاتفك عدة مرات، وتصميمه الذي يتسع في أي جيب، هو رفيقك الموثوق الذي يمنحك راحة البال طوال اليوم.',
  faq: [
    {
      question: 'كم مرة يمكنه شحن هاتفي؟',
      answer: 'بسعة 20,000 مللي أمبير، يمكنه شحن معظم الهواتف الذكية الحديثة من 3 إلى 5 مرات تقريبًا، مما يجعله مثاليًا للاستخدام لعدة أيام دون إعادة شحن.'
    },
    {
      question: 'هل يمكنني شحن لابتوب به؟',
      answer: 'هذا الباور بانك مخصص بشكل أساسي لشحن الهواتف والأجهزة الصغيرة مثل السماعات والساعات الذكية. قد لا يكون قادرًا على شحن أجهزة اللابتوب التي تتطلب طاقة أعلى.'
    },
    {
      question: 'هل يأتي معه كابل شحن؟',
      answer: 'نعم، يأتي مع الباور بانك كابل لشحنه، ويمكنك استخدام نفس الكابل لشحن أجهزتك إذا كانت متوافقة.'
    }
  ]
};

export default product;
