import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-67',
  name: 'ستائر سيارة قابلة للسحب للحماية من الشمس',
  slug: 'retractable-car-sun-shades',
  story: `في صيف السعودية الحارق، تتحول السيارة إلى فرن 🔥. هذه الستائر هي درعك الواقي. بلمسة بسيطة، تحجب أشعة الشمس، تحافظ على برودة سيارتك، وتمنحك الخصوصية. ليست مجرد ستائر، بل هي مكيفك الشخصي الصامت. 😎`,
  description: `ستائر سيارة قابلة للسحب توفر الخصوصية وتحمي من أشعة الشمس، مما يقلل من حرارة السيارة ويحافظ على المقاعد.###FEATURES###- تحمي السيارة من أشعة الشمس الضارة.
- تحافظ على درجة حرارة السيارة.
- توفر المزيد من الخصوصية والأمان.
- تقلل درجة حرارة السيارة من 20 إلى 30 درجة مئوية.
- تناسب جميع أنواع السيارات وسهلة التركيب.###DETAILS###- الماركة: سمارت كيتشن
- الأبعاد: 120 × 72 سم للستارة الواحدة
- اللون: أسود`,
  price: 89.99,
  images: [
    'https://i.ibb.co/MDDVWSYb/image-1.jpg',
    'https://i.ibb.co/p6Ywsd7T/image-2.jpg',
    'https://i.ibb.co/CpxBNnsL/image-3.jpg',
    'https://i.ibb.co/XxDvrPQs/image-4.jpg',
    'https://i.ibb.co/zkHbYV1/image-5.jpg'
  ],
  category: 'misc',
  warranty: 'عامين',
};

export default product;
