import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-123',
  name: 'فرامة كهربائية 2 لتر DLC',
  slug: 'dlc-2l-electric-chopper',
  story: `تحضير الطعام أصبح أسرع وأسهل! 🔪 هذه الفرامة هي يدك اليمنى في المطبخ. تفرم الخضار واللحوم في ثوانٍ، لتمنحك وقتًا أطول للاستمتاع بوجبتك. ليست مجرد فرامة، بل هي شيف مساعد في مطبخك.`,
  description: `مفرمة كهربائية قوية من DLC بسعة وعاء 500 مل وشفرات رباعية من الستانلس ستيل. مثالية لفرم الخضار واللحوم بسرعة وكفاءة, مع خيارين للسرعة.###FEATURES###- تقطع وتفرم الخضار واللحوم في ثوانٍ.
- سرعتان (عالية/منخفضة).
- وعاء بلاستيك 500 مل.
- 4 شفرات ستانلس ستيل حادة.
- قوة 400-500 واط.
- سهلة الفك والتركيب والتنظيف.###DETAILS###- الماركة: DLC
- الموديل: 39059 DLC
- القدرة: 400-500 واط
- سعة الوعاء: 500 مل`,
  price: 105.00,
  images: [
    'https://i.ibb.co/Z1bR60vD/image-1.jpg',
    'https://i.ibb.co/rR9jnTYK/image-2.jpg',
    'https://i.ibb.co/0pjX646p/image-3.jpg',
    'https://i.ibb.co/QFRyKMz9/image-4.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
