import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-17',
  name: 'سماعة أيربودز i12 TWS',
  slug: 'i12-tws-airpods',
  description: `تجربة صوتية ممتازة بسعر لا يصدق! سماعات i12 TWS تقدم لك صوت ستيريو نقي وتصميمًا مريحًا يثبت في الأذن. اتصل بأجهزتك بسهولة عبر بلوتوث 5.0 واستمتع بحرية الحركة.###FEATURES###- صوت ستيريو نقي وواضح.
- تصميم مريح وخفيف الوزن.
- تدعم البلوتوث 5.0 لاتصال سريع وثابت.
- تتوافق مع الآيفون والأندرويد.
- علبة الشحن توفر شحن إضافي.###DETAILS###- الموديل: i12 TWS
- الضمان: 14 يوم
- إصدار البلوتوث: 5.0
- مدة التشغيل: 2 إلى 3 ساعات
- زمن الشحن: ساعة ونص تقريبًا`,
  price: 69.99,
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
