import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-35',
  name: 'شريحة لتقوية شبكة الجوال',
  slug: 'mobile-signal-booster-sticker',
  story: `في الطابق السفلي من المبنى، حيث كانت الإشارة تختفي دائمًا 📵، كان "علي" يفقد اتصاله بالعالم. حتى اكتشف هذه الشريحة الصغيرة. بلصقها على هاتفه، حدث ما يشبه السحر ✨. عادت الشبكة قوية ومستقرة. لم تكن مجرد شريحة، بل كانت جسرًا يعيده إلى العالم الرقمي، حتى في أعمق النقاط الميتة.`,
  description: `تحسن استقبال الشبكة في الأماكن المغلقة. تقلل التشويش أثناء المكالمات. تعمل مع جميع الجوالات الذكية. تصميم خفيف وصغير يسهل لصقه. مناسبة للسيارات والمصاعد والمباني.###DETAILS###- المادة: PCB عالية الجودة
- الوزن: 10 جرام
- متوافقة مع: جميع الأجهزة الذكية`,
  price: 55,
  images: [
    "https://i.ibb.co/nGwBDnx/image-1.jpg",
    "https://i.ibb.co/C530MZty/image-2.jpg",
    "https://i.ibb.co/R4ZzfcfH/image-3.jpg",
    "https://i.ibb.co/fGS1DQBr/image-4.jpg",
    "https://i.ibb.co/GvSS875D/image-5.jpg",
    "https://i.ibb.co/q3s28j10/image-6.jpg",
    "https://i.ibb.co/xS3DmMfH/image-7.jpg"
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
