import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-27',
  name: 'جهاز ألعاب بدقة 4K مع دراعات تحكم',
  slug: '4k-gaming-console-with-controllers',
  story: `في غرفة المعيشة، اجتمع الأب مع ابنه 👨‍👦. لم تكن مجرد ليلة عادية، بل كانت ليلة سفر عبر الزمن. بفضل هذا الجهاز، عاد الأب إلى ألعابه المفضلة في طفولته، وشارك ابنه نفس الحماس والضحكات. لم يكن الجهاز مجرد وسيلة للترفيه، بل أصبح جسرًا بين جيلين، يربطهما بشغف مشترك وذكريات جديدة. ❤️`,
  description: `استرجع ذكريات الطفولة مع جهاز الألعاب هذا! آلاف الألعاب الكلاسيكية بانتظارك على شاشتك الكبيرة بدقة 4K. يأتي مع وحدتي تحكم لاسلكية لتجربة لعب مريحة وممتعة.###FEATURES###- أكثر من 18,500 لعبة مدمجة.
- يدعم 9 أنواع من محاكيات الألعاب.
- يدعم دقة عرض 4K عبر مخرج HDMI.
- وحدتين تحكم لاسلكية 2.4 جيجا.
- إمكانية حفظ تقدم اللعبة.###DETAILS###- عدد الألعاب: 18,500+
- الاتصال: لاسلكي 2.4 جيجا
- التخزين: بطاقة 64 جيجابايت
- المحاكيات المدعومة: 9 أنواع`,
  price: 249.99,
  images: [
    "https://i.ibb.co/gL383yf6/image-1.jpg",
    "https://i.ibb.co/4RW8y634/image-2.jpg",
    "https://i.ibb.co/rKjBsQwx/image-3.jpg",
    "https://i.ibb.co/gF7h3vWy/image-4.jpg"
  ],
  category: 'electronics',
};

export default product;
