import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-87',
  name: 'جهاز تعقب بلوتوث',
  slug: 'bluetooth-tracker-device',
  story: `كم مرة أضعت مفاتيحك أو محفظتك؟ 😩 هذا الجهاز الصغير هو ذاكرتك الإضافية. علّقه على أغراضك الثمينة، وإذا فقدتها، سيساعدك هاتفك في العثور عليها. ليس مجرد جهاز تتبع، بل هو حارس أغراضك الشخصي. 🔑`,
  description: `جهاز تعقب صغير يعمل مع تطبيق Find My في أجهزة آبل للعثور على أغراضك المفقودة بسهولة. مقاوم للماء وبطارية تدوم طويلاً.###FEATURES###- يعمل مع تطبيق Find My في الآيفون.
- يصدر صوتًا للمساعدة في العثور عليه.
- ينبهك إذا ابتعدت عن غرضك.
- وضع Lost Mode للمساعدة في العثور عليه.
- مقاوم للماء والغبار (IPX7).
- بطارية تدوم 10-12 شهر.###DETAILS###- الماركة: جينريك
- المقاس: 38x38x7 ملم
- الوزن: 10 جرام
- البطارية: CR2032
- مقاوم للماء: IPX7`,
  price: 79.99,
  images: [
    'https://i.ibb.co/4gmrCcyt/image-1.jpg',
    'https://i.ibb.co/NnZfkKLP/image-2.jpg',
    'https://i.ibb.co/b99Mqdb/image-3.jpg',
    'https://i.ibb.co/TDq0KGPm/image-4.jpg',
    'https://i.ibb.co/1YHN8Pn5/image-5.jpg',
    'https://i.ibb.co/KxjW1kRG/image-6.jpg',
    'https://i.ibb.co/pvrKtFVK/image-7.jpg',
    'https://i.ibb.co/ymMWJpqn/image-8.jpg'
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
