import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-49',
  name: 'ساعة رياضية ذكية',
  slug: 'smart-sports-watch',
  description: `شريكك في رحلتك الصحية! ساعة رياضية ذكية تقيس نبضات قلبك، خطواتك، السعرات الحرارية، وجودة نومك. توصل لك إشعارات جوالك وتبقى مشحونة لأكثر من 15 يومًا في وضع الاستعداد.###FEATURES###- تقيس نبضات القلب والخطوات والسعرات.
- تراقب جودة النوم.
- تستقبل إشعارات المكالمات والرسائل.
- بطارية تدوم لأكثر من 15 يومًا (استعداد).
- مقاومة لرذاذ الماء.###DETAILS###- الموديل: Shivay M3 Smart Band
- الضمان: 14 يوم
- الاتصال: بلوتوث 4.0
- سعة البطارية: 40mAh
- مقاومة للماء: مناسبة للرذاذ`,
  price: 89.99,
  category: 'health',
  warranty: '14 يوم',
};

export default product;
