import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-34',
  name: 'خاتم ذكي معدني مع جهاز مراقبة الصحة',
  slug: 'smart-health-monitoring-ring',
  description: `تابع صحتك ولياقتك بأناقة لا مثيل لها! هذا الخاتم الذكي بتصميمه المعدني الأنيق يراقب نبضات قلبك، ونسبة الأكسجين في الدم، وجودة نومك، ويتتبع أكثر من 100 وضع رياضي.###FEATURES###- يتتبع أكثر من 100 وضع رياضي.
- مقاوم للماء بمعيار IP68 (مناسب للسباحة).
- يراقب نبضات القلب، الأكسجين، النوم، والضغط.
- شحن مغناطيسي سريع يدوم 3-5 أيام.
- تصميم معدني أنيق وخفيف.###DETAILS###- النظام: BT5.1
- مقاومة الماء: IP68
- وضعيات الرياضة: أكثر من 100 وضع
- بطارية: حوالي 18mAh تدوم 3–5 أيام
- الخامة: ستانلس ستيل`,
  price: 299.99,
  category: 'health',
};

export default product;
