import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-23',
  name: 'كيبورد و ماوس كومبو للالعاب',
  slug: 'gaming-keyboard-mouse-combo',
  story: `عندما يحل الظلام، يستيقظ عالم الألعاب. هذا الطقم ليس مجرد أدوات، بل هو سلاحك في المعارك الرقمية. كل ضغطة مفتاح هي خطوة نحو النصر، وكل حركة للماوس هي طلقة دقيقة. مع إضاءة قوس قزح التي تنبض بالحياة، يتحول مكتبك إلى ساحة معركة، وأنت قائدها.`,
  description: `أضف لمسة من الاحترافية والألوان إلى مكتبك! هذا الطقم المكون من كيبورد وماوس بإضاءة خلفية ملونة يمنحك تجربة لعب وكتابة مريحة وممتعة.###FEATURES###- إضاءة LED خلفية بألوان قوس قزح.
- تصميم مريح يقلل الإجهاد.
- عجلة ماوس ثلاثية الأبعاد ومضادة للانزلاق.
- يدعم أنظمة تشغيل ويندوز.
- مصنوع من مواد عالية الجودة.###DETAILS###- الكيبورد: 104 مفتاح، طول الكابل 1.5 متر
- الماوس: إضاءة خلفية، طول الكابل 1.5 متر
- الجهد: 5 فولت/200mA`,
  price: 129.99,
  images: [
    "https://i.ibb.co/KpyNG705/image-1.png",
    "https://i.ibb.co/Jjs3sTpw/image-2.png",
    "https://i.ibb.co/NnfzBMQy/image-3.jpg"
  ],
  category: 'electronics',
};

export default product;
