import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-106',
  name: 'مقص كهربائي متعدد الاستخدامات',
  slug: 'multi-use-electric-scissors',
  story: `تقليم أشجار حديقتك كان دائمًا مهمة شاقة. هذا المقص الكهربائي يغير كل شيء. بقوته وسهولة استخدامه، يحول مهمة التقليم إلى متعة. شاهد حديقتك تزدهر بلمسة زر. ليس مجرد مقص، بل هو عصا البستاني السحرية. 🌿✨`,
  description: `مقص تقليم كهربائي لاسلكي من دينيكس، بقوة 500 واط وبطاريتين. مثالي لقص أغصان الأشجار بسهولة وسرعة.###FEATURES###- مقبض مضاد للانزلاق وآمن.
- محرك قوي يقص الأشجار بسرعة.
- كهربائي وخفيف، يعمل بالبطارية.
- يأتي مع بطاريتين وشاحن.
- قطر قطع يصل إلى 30 ملم.###DETAILS###- الماركة: دينيكس
- الطاقة: 500 واط
- الجهد: 16.8 فولت
- البطارية: 2000mAh (بطاريتان)
- مدة العمل: من 3 إلى 6 ساعات`,
  price: 178,
  images: [
    'https://i.ibb.co/938fWYdF/image-1.jpg',
    'https://i.ibb.co/Zp5bFZ1r/image-2.jpg',
    'https://i.ibb.co/Jjm1WyQw/image-3.jpg',
    'https://i.ibb.co/VpxHGx2C/image-4.jpg',
    'https://i.ibb.co/4ZxyBnmK/image-5.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
