import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-55',
  name: 'جراب متين ضدد المياة بضمان عامين',
  slug: 'durable-waterproof-pouch',
  story: `مغامرتك التالية قد تكون في الماء! 🌊 لا تدع الخوف على هاتفك يمنعك من توثيق اللحظة. هذا الجراب ليس مجرد حماية، بل هو شهادة تأمين لهاتفك. يطفو على الماء، ويحميه حتى 30 مترًا تحت السطح، ويسمح لك بالتصوير. الآن يمكنك الغوص وأنت مطمئن. 🐠`,
  description: `تطفو فوق الموية وما تخلي الجوال يغرق. مقاومة للماء لعمق يوصل 30 متر. تقدر تستخدم الشاشة حتى وهي داخل الكفر. محكمة الإغلاق وتمنع دخول الموية والغبار.###DETAILS###- الماركة: MOOGMAX
- معيار الحماية: IP68
- أقصى عمق للماء: 30 متر
- الخامة: PVC ناعم وقوي`,
  price: 75,
  images: [
    "https://i.ibb.co/KxGgzL1X/image-1.jpg",
    "https://i.ibb.co/V1pNVDV/image-2.jpg",
    "https://i.ibb.co/fzh9H3kZ/image-3.jpg",
    "https://i.ibb.co/F4Kv3Vj4/image-4.jpg"
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
