import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-98',
  name: 'اله رش الطلاء Paint Zoom',
  slug: 'paint-zoom-paint-sprayer',
  story: `تجديد منزلك لم يعد مهمة صعبة. مع Paint Zoom، يمكنك أن تصبح فنانًا في يوم واحد. يرش الطلاء بالتساوي وبدون فوضى، ليحول جدرانك القديمة إلى لوحات فنية جديدة. ليس مجرد جهاز، بل هو أداتك لتحويل منزلك بسرعة وسهولة. 🎨`,
  description: `جهاز رش طلاء كهربائي خفيف ومحمول، يغطي الجدران والأثاث بسهولة وبدون تنقيط. مثالي للأعمال المنزلية.###FEATURES###- يغطي الجدار من أول مرة.
- خفيف ومحمول.
- محرك قوي بدون ضاغط هواء.
- رأس بثلاث اتجاهات للوصول للأماكن الصعبة.
- بدون تنقيط وسهل التنظيف.###DETAILS###- الماركة: FYG ENTERPRISE
- مصدر الطاقة: كهربائي بالسلك
- القوة: 625 واط
- الاستخدام: داخلي وخارجي`,
  price: 199.99,
  images: [
    'https://i.ibb.co/v96vF2j/image-1.jpg',
    'https://i.ibb.co/84Y0cBxK/image-2.jpg',
    'https://i.ibb.co/QFSrbLdV/image-3.jpg',
    'https://i.ibb.co/SD8KWk19/image-4.jpg',
    'https://i.ibb.co/RkPb2qT2/image-5.jpg',
    'https://i.ibb.co/v60J1ktr/image-6.jpg',
    'https://i.ibb.co/C32WMwbN/image-7.jpg',
    'https://i.ibb.co/KjF4wGzq/image-8.jpg'
  ],
  category: 'home',
  warranty: 'عام',
};

export default product;
