import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-22',
  name: 'ساعة سمارت ULTRA',
  slug: 'ultra-smart-watch',
  story: `صُممت ساعة ULTRA للمغامرين 🧗، للرياضيين 🏃‍♀️، وللأشخاص الذين لا يتوقفون عن الحركة. إنها ليست مجرد ساعة جميلة، بل هي درع صلب يتحمل أصعب الظروف، ومدرب شخصي يرافقك في كل خطوة، وطبيب صغير على معصمك يراقب صحتك. إنها القوة والأناقة مجتمعة لتلهمك للوصول إلى أبعد الحدود. 🚀`,
  description: `أناقة وقوة على معصمك! ساعة ULTRA الذكية بتصميمها العصري وشاشتها عالية الدقة تمنحك كل ما تحتاجه لمتابعة لياقتك وصحتك.###FEATURES###- شاشة عالية الدقة وكاملة.
- أزرار من الجهتين مثل ساعة آبل.
- استقبال جميع الإشعارات والمكالمات.
- قياس نبضات القلب، أكسجين الدم، وضغط الدم.
- مقاومة للماء ومصممة بمواد متينة.###DETAILS###- الشاشة: 1.96 inch HD screen
- البلوتوث: BT 3.5 / 5.0
- البطارية: 320 مللي أمبير
- الشحن: لاسلكي`,
  price: 189.99,
  images: [
    "https://i.ibb.co/3mvjDSmQ/image-1.jpg",
    "https://i.ibb.co/3ykxrScK/image-2.jpg",
    "https://i.ibb.co/RkdqBYs2/image-3.jpg",
    "https://i.ibb.co/21Vf0N1t/image-4.jpg",
    "https://i.ibb.co/hxMhnB6d/image-5.jpg",
    "https://i.ibb.co/whVRFnkH/image-6.jpg",
    "https://i.ibb.co/QFRT5pbg/image-7.jpg"
  ],
  category: 'health',
};

export default product;
