import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-43',
  name: 'budi power bank 20000',
  slug: 'budi-power-bank-20000',
  story: `في زحمة الحياة اليومية، تحتاج إلى رفيق موثوق. باور بانك Budi هو ذاك الرفيق. صغير بما يكفي ليكون في جيبك، وقوي بما يكفي ليعيد الحياة لهاتفك مرتين أو ثلاث. إنه جرعة الطاقة المركزة التي تضمن لك أن تبقى على اتصال دائمًا. 🔋✔️`,
  description: `سعة بطارية كبيرة 20000mAh. يدعم الشحن السريع. فيه منفذين USB لشحن جهازين في نفس الوقت. تصميم صغير وسهل الحمل. متوافق مع أغلب الجوالات والأجهزة.###DETAILS###- الماركة: budi
- السعة: 20,000 مللي أمبير
- عدد المنافذ: 2 منفذ USB`,
  price: 120,
  images: [
    "https://i.ibb.co/5g08vFX7/image-1.jpg",
    "https://i.ibb.co/Q73VN2KZ/image-2.jpg",
    "https://i.ibb.co/4wfLpF39/image-3.jpg",
    "https://i.ibb.co/Q7pNfTJS/image-4.jpg",
    "https://i.ibb.co/fVKsSrSF/image-5.jpg"
  ],
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
