import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-81',
  name: 'مكنسة كهربائية محمولة ومنفاخ',
  slug: 'portable-vacuum-cleaner-and-blower',
  story: `سيارتك هي بيتك الثاني، ويجب أن تكون نظيفة دائمًا. هذه المكنسة الصغيرة هي يد العون التي تحتاجها. تشفط الغبار من أصعب الزوايا، وتنفخ الهواء لتنظيف الفتحات. ليست مجرد مكنسة، بل هي خادمتك الشخصية للحفاظ على أناقة سيارتك. 🚗✨`,
  description: `مكنسة ومنفاخ 2 في 1 للسيارة، بقوة شفط 120 واط لتنظيف فعال، وتعمل على ولاعة السيارة مباشرة.###FEATURES###- 2 في 1: مكنسة وضاغط هواء.
- قوة شفط 120 واط.
- فلتر معدني قابل للغسل.
- إضاءة LED للمساعدة في التنظيف.
- تعمل على كهرباء السيارة (ولاعة).
- سلك طويل 4 متر.###DETAILS###- الماركة: جينيريك
- الموديل: LY-8018
- القوة: 120 واط
- نوع التنظيف: جاف
- طول السلك: 4 أمتار`,
  price: 119.99,
  images: [
    'https://i.ibb.co/8yMpB98/image-1.jpg',
    'https://i.ibb.co/4n8Db2L8/image-2.jpg',
    'https://i.ibb.co/84ckRGg7/image-3.jpg',
    'https://i.ibb.co/8Lpvsjrd/image-4.jpg',
    'https://i.ibb.co/HpKr0Qtk/image-5.jpg',
    'https://i.ibb.co/9kmBZ9cD/image-6.jpg',
    'https://i.ibb.co/DPXVC4CH/image-7.jpg'
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
