import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-24',
  name: 'تابلت شبيه الايفون + كيبورد بلوتوث',
  slug: 'iphone-like-tablet-with-keyboard',
  description: `احصل على إنتاجية عالية وتصميم أنيق مع هذا التابلت الشبيه بالآيفون! يأتي مع كيبورد بلوتوث وذاكرة كبيرة ليساعدك على إنجاز مهامك بسرعة وسهولة.###FEATURES###- ذاكرة رام 6 جيجا و مساحة 256 جيجابايت.
- يدعم شريحة 5G.
- يأتي مع كيبورد بلوتوث يدعم اللغة العربية.
- شاشة 7 بوصة عالية الوضوح.
- بطارية 5000 مللي أمبير تدوم طويلاً.###DETAILS###- المساحة: 256GB
- الرام: 6 جيجا
- الشبكة: 5G
- الشاشة: 7 بوصة
- البطارية: 5000 مللي أمبير`,
  price: 549.99,
  category: 'electronics',
  story: 'لماذا تختار بين أناقة الهاتف وقوة الكمبيوتر؟ هذا التابلت يجمع لك أفضل ما في العالمين. بتصميمه الأنيق الذي يذكرنا بأرقى الهواتف، وقوته التي تضاهي الكمبيوتر المحمول بفضل الكيبورد المرفق، هو الأداة المثالية لمن يريد أن ينجز مهامه بأناقة، أينما كان.',
  faq: [
    {
      question: 'هل الكيبورد يدعم اللغة العربية؟',
      answer: 'نعم، الكيبورد المرفق يدعم اللغة العربية بشكل كامل، مما يسهل عليك الكتابة وإنجاز أعمالك.'
    },
    {
      question: 'هل يمكنني استخدام التابلت لإجراء مكالمات؟',
      answer: 'نعم، التابلت يدعم تركيب شريحة اتصال وشبكات الجيل الخامس 5G، مما يتيح لك إجراء المكالمات واستخدام الإنترنت عبر بيانات الهاتف.'
    },
    {
      question: 'ما هي الملحقات التي تأتي مع الجهاز؟',
      answer: 'يأتي الجهاز مع حزمة متكاملة تشمل كيبورد بلوتوث، سماعة بلوتوث، جراب، شاحن، قلم لمس، والعديد من الهدايا الأخرى.'
    }
  ]
};

export default product;
