import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-8',
  name: 'باور بنك 10000 ملى امبير من دينكس',
  slug: 'denx-10000mah-power-bank',
  description: `القوة والسرعة في جيبك! باور بنك دينكس بقوة 30 واط هو شريان الحياة لأجهزتك. بحجمه الصغير وقدرته على الشحن السريع، لن تقلق أبدًا بشأن نفاد البطارية.###FEATURES###- قوة شحن 30 واط لشحن فائق السرعة.
- سعة 10000 mAh تكفيك لشحن جوالك أكثر من مرة.
- حجم صغير ومناسب للجيب أو الشنطة.
- منافذ متعددة لشحن أكثر من جهاز.
- حماية من الحرارة الزائدة والتماس الكهربائي.###DETAILS###- الماركة: دينيكس
- الضمان: عامين
- الموديل: DX432
- القدرة: 30W
- السعة: 10000 mAh
- الخامة: ABS + PC`,
  price: 89.99,
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
