import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-88',
  name: 'لعبة الدراجة الثلاثية الراقصة',
  slug: 'dancing-tricycle-toy',
  description: `لعبة دراجة ثلاثية كهربائية مسلية للأطفال، تدور 360 درجة بشكل بهلواني مع أضواء ملونة وموسيقى حماسية.###FEATURES###- تصميم كرتوني لطيف.
- تتحرك وتدور 360 درجة بشكل بهلواني.
- أنوار ملونة وموسيقى حماسية.
- مصنوعة من بلاستيك آمن ومتين.
- تعمل بـ 3 بطاريات AA.###DETAILS###- الماركة: جينريك
- الوزن: 308 جرام تقريبًا
- العمر المناسب: من 3 سنوات إلى 12 سنة
- الخامة: بلاستيك قوي وآمن
- البطاريات: 3 بطاريات AA (غير مرفقة)`,
  price: 69.99,
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
