import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-59',
  name: 'ماطور هواء لكفرات السيارة بقوة 288 واط',
  slug: 'car-air-compressor-288w',
  story: `في منتصف الطريق، وفجأة تجد إطار سيارتك فارغًا من الهواء! 😱 لا داعي للهلع. هذا الماطور الصغير والقوي هو حلك السريع. يوصل بولاعة السيارة ويعيد الحياة لإطاراتك في دقائق. ليس مجرد منفاخ، بل هو راحة البال في صندوق سيارتك. 🚗`,
  description: `ماطور هواء قوي ومحمول لنفخ إطارات السيارة والكرات والدراجات بسرعة وكفاءة. يعمل على ولاعة السيارة.###FEATURES###- قوة 288 واط لأداء قوي وموثوق.
- ضغط قابل للتعديل يصل حتى 150 رطل لكل بوصة مربعة.
- حجم صغير وتصميم مدمج، سهل الحمل.
- ينفخ الإطارات بسرعة (55 لتر/دقيقة).
- يعمل بـ 2 بستم.###DETAILS###- الماركة: جينريك
- الجهد: 12 فولت
- أقصى ضغط: 150 رطل لكل بوصة مربعة
- القوة: 288 واط
- تدفق الهواء: 55 لتر/دقيقة
- الاسطوانة: 30 ملم`,
  price: 189.99,
  images: [
    'https://i.ibb.co/TDKvMRdh/image-1.jpg',
    'https://i.ibb.co/PsFxH8JQ/image-2.png',
    'https://i.ibb.co/k6vSrq9b/image-3.png',
    'https://i.ibb.co/wrMv5Spb/image-4.jpg',
    'https://i.ibb.co/ynvQ2JyT/image-5.jpg'
  ],
  category: 'electronics',
  warranty: '6 شهور',
};

export default product;
