import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-82',
  name: 'ماكينة القفز الذكية للتنحيف',
  slug: 'smart-jumping-rope-machine',
  story: `من كان يظن أن القفز على الحبل يمكن أن يكون بهذه المتعة؟ 😍 هذا الجهاز يحول التمرين إلى تحدٍ جماعي. شغل الموسيقى، اضبط السرعة، ودع الجميع يشارك في المرح. ليست مجرد آلة رياضية، بل هي صانعة اللياقة والضحكات.`,
  description: `جهاز قفز حبل ذكي يعمل بالريموت كنترول، مع 10 إعدادات سرعة وشاشة LCD. طريقة ممتعة لممارسة التمارين في المنزل.###FEATURES###- تحكم عن بعد بالريموت.
- 10 إعدادات سرعة قابلة للتعديل.
- شحن يكفي لأكثر من 60 يومًا.
- شاشة LCD كبيرة لعرض التقدم.
- دوران ثابت 360 درجة بدون صوت.
- مناسب لجميع الأعمار.###DETAILS###- الماركة: جينيريك
- المادة: بلاستيك PP متين
- الحجم: 13 × 13 × 8 سم
- الطاقة: بطارية قابلة للشحن`,
  price: 179.99,
  images: [
    'https://i.ibb.co/chC6vT86/image-1.png',
    'https://i.ibb.co/1YDbxZNR/image-2.png',
    'https://i.ibb.co/fGXQRwrq/image-3.png',
    'https://i.ibb.co/hJrcMwXs/image-4.png',
    'https://i.ibb.co/gM4nvbGz/image-5.png',
    'https://i.ibb.co/5XBLN2Kf/image-6.png',
    'https://i.ibb.co/7x5wysvJ/image-7.jpg'
  ],
  category: 'health',
  warranty: '14 يوم',
};

export default product;
