import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-24',
  name: 'تابلت شبيه الايفون + كيبورد بلوتوث',
  slug: 'iphone-like-tablet-with-keyboard',
  story: `لماذا تختار بين أناقة التصميم وقوة الأداء؟ هذا التابلت يجمع لك أفضل ما في العالمين. بتصميمه المستوحى من الأناقة، وقوته التي تكمن في ذاكرته الضخمة واتصاله السريع، يمكنك أن تكون مبدعًا ومنتجًا في نفس الوقت. إنه ليس تقليدًا، بل هو إعادة تعريف لما يمكن أن يكون عليه الجهاز اللوحي.`,
  description: `احصل على إنتاجية عالية وتصميم أنيق مع هذا التابلت الشبيه بالآيفون! يأتي مع كيبورد بلوتوث وذاكرة كبيرة ليساعدك على إنجاز مهامك بسرعة وسهولة.###FEATURES###- ذاكرة رام 6 جيجا و مساحة 256 جيجابايت.
- يدعم شريحة 5G.
- يأتي مع كيبورد بلوتوث يدعم اللغة العربية.
- شاشة 7 بوصة عالية الوضوح.
- بطارية 5000 مللي أمبير تدوم طويلاً.###DETAILS###- المساحة: 256GB
- الرام: 6 جيجا
- الشبكة: 5G
- الشاشة: 7 بوصة
- البطارية: 5000 مللي أمبير`,
  price: 549.99,
  images: [
    "https://i.ibb.co/gL2xJsdf/image-1.jpg",
    "https://i.ibb.co/4nQyzv86/image-2.jpg",
    "https://i.ibb.co/GvsknNP4/image-3.jpg"
  ],
  category: 'electronics',
};

export default product;
