import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-150',
  name: 'عربة تخزين منزلقة من اربعة أدوار',
  slug: '4-tier-sliding-storage-cart',
  story: `كل مساحة ضائعة في منزلك هي فرصة للتنظيم. هذه العربة الذكية تنسل في أضيق الأماكن، بين الثلاجة والجدار أو بجانب الغسالة، لتحول الفوضى إلى ترتيب. ليست مجرد عربة، بل هي مكتشفة المساحات المفقودة. 🧐`,
  description: `عربة تخزين متحركة بأربع أدوار, تصميم نحيف يناسب الزوايا والمساحات الضيقة في المطبخ أو الحمام. مصنوعة من بلاستيك قوي ومقاومة للماء.###FEATURES###- توفر تخزين مرتب في المساحات الضيقة.
- أربع أدوار واسعة.
- عجلات لسهولة الحركة.
- مناسبة للمطبخ, الحمام, أو غرفة الأطفال.
- مقاومة للماء وسهلة التنظيف.###DETAILS###- الخامة: بلاستيك قوي
- الأبعاد: 103 × 54 × 13 سم
- عدد الأدوار: 4`,
  price: 90.00,
  images: [
    'https://i.ibb.co/JWWgjBYm/image-1.jpg',
    'https://i.ibb.co/DDB5zc76/image-2.jpg',
    'https://i.ibb.co/JWdpjTP8/image-3.jpg',
    'https://i.ibb.co/W43VsMsH/image-4.jpg',
    'https://i.ibb.co/Mx7bY5k9/image-5.jpg',
    'https://i.ibb.co/p6cGZfmh/image-6.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
