import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-119',
  name: 'شريط الإضاءة الذكي',
  slug: 'smart-led-strip-light',
  story: `حوّل غرفتك إلى احتفال دائم! 🎆 هذا الشريط الضوئي ليس مجرد إنارة، بل هو عرض ألعاب نارية خاص بك. يتراقص مع الموسيقى ويغير ألوانه ليناسب مزاجك. ليس مجرد شريط إضاءة، بل هو قلب الحفلة في منزلك.`,
  description: `أضف أجواء احتفالية لمنزلك مع شريط الإضاءة الذكي بتأثير الألعاب النارية. يمكن مزامنته مع الموسيقى والتحكم به عبر تطبيق الجوال أو الريموت كنترول. سهل التركيب ويعمل عبر USB.###FEATURES###- تأثير إضاءة يشبه الألعاب النارية.
- مزامنة مع الموسيقى لتجربة تفاعلية.
- تحكم عبر التطبيق أو الريموت كنترول.
- تشغيل عبر USB لتوفير الطاقة.
- تثبيت سريع بلاصق قوي.###DETAILS###- التحكم: تطبيق بلوتوث أو ريموت 24 مفتاح
- عدد المصابيح: 94 LED
- الطاقة: 5 واط
- الجهد: 12 فولت`,
  price: 65.00,
  images: [
    'https://i.ibb.co/Ps4MfC58/image-1.jpg',
    'https://i.ibb.co/Qjpc2KFM/image-2.jpg',
    'https://i.ibb.co/ZpsbHJmK/image-3.jpg',
    'https://i.ibb.co/ksxnFhvC/image-4.jpg',
    'https://i.ibb.co/fGMS7jhq/image-5.jpg',
    'https://i.ibb.co/d026NvJP/image-6.jpg',
    'https://i.ibb.co/F48ZJHN7/image-7.jpg',
    'https://i.ibb.co/qFnjjk31/image-8.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
