import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-122',
  name: 'كوب خلط ذكي اوتوماتيكي',
  slug: 'automatic-self-stirring-mug',
  description: `كوب ذكي يخلط مشروباتك تلقائيًا بضغطة زر. مثالي للبروتين, القهوة, وغيرها من المشروبات. تصميم محمول يعمل بالبطاريات لسهولة الاستخدام في أي مكان.###FEATURES###- تقنية التحريك التلقائي.
- تصميم محمول ومناسب للسفر.
- تشغيل سهل بضغطة زر واحدة.
- مصنوع من بلاستيك وفولاذ مقاوم للصدأ.
- خفيف الوزن وسهل التنظيف.###DETAILS###- السعة: 400 مل
- الطاقة: 750 واط
- المادة: بلاستيك وفولاذ مقاوم للصدأ
- يعمل بالبطاريات`,
  price: 50.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
