import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-62',
  name: 'بكج القيادة المرحة (لعبة عجلة القيادة + سيارة كهربائية)',
  slug: 'fun-driving-bundle',
  story: 'أطلق العنان لخيال طفلك! هذا البكج ليس مجرد لعبتين، بل هو مغامرة متكاملة. يتعلم القيادة على العجلة التفاعلية، ثم يطبق ما تعلمه في سيارته الكهربائية الخاصة. إنها الطريقة المثلى للجمع بين المرح والتعلم، وصناعة ذكريات طفولة لا تُنسى.',
  description: `يعطي الأطفال تجربة قيادة ممتعة وحقيقية. العجلة التفاعلية تعلم الطفل التنسيق الحركي والبصري. فيها مؤثرات صوتية وضوئية. السيارة الكهربائية تمشي بسرعة قابلة للتعديل. عجلات قوية مقاومة للانفجار. محرك 380 واط.###DETAILS###- العجلة: بلاستيك ABS، تعمل بالبطاريات أو USB.
- السيارة: بلاستيك ABS، بطارية 4.5AH قابلة للشحن، محرك 380 واط.
- العمر المناسب: من 2 إلى 10 سنوات.`,
  price: 290,
  images: [
    'https://i.ibb.co/4gsHpjfb/image-1.jpg',
    'https://i.ibb.co/YTqB43gS/image-2.jpg',
    'https://i.ibb.co/vCz7Zyc8/image-3.jpg',
    'https://i.ibb.co/zHZVqCxj/image-4.png'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;