import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-122',
  name: 'كوب خلط ذكي اوتوماتيكي',
  slug: 'automatic-self-stirring-mug',
  story: `لماذا تحرك ملعقتك وأنت تملك كوبًا يقوم بذلك عنك؟ 😉 هذا الكوب الذكي هو الحل الأمثل للكسالى والمبدعين. بضغطة زر، يخلط قهوتك أو بروتينك بشكل مثالي. ليس مجرد كوب، بل هو مساعدك الشخصي في تحضير المشروبات.`,
  description: `كوب ذكي يخلط مشروباتك تلقائيًا بضغطة زر. مثالي للبروتين, القهوة, وغيرها من المشروبات. تصميم محمول يعمل بالبطاريات لسهولة الاستخدام في أي مكان.###FEATURES###- تقنية التحريك التلقائي.
- تصميم محمول ومناسب للسفر.
- تشغيل سهل بضغطة زر واحدة.
- مصنوع من بلاستيك وفولاذ مقاوم للصدأ.
- خفيف الوزن وسهل التنظيف.###DETAILS###- السعة: 400 مل
- الطاقة: 750 واط
- المادة: بلاستيك وفولاذ مقاوم للصدأ
- يعمل بالبطاريات`,
  price: 50.00,
  images: [
    'https://i.ibb.co/7dKJr08d/image-1.jpg',
    'https://i.ibb.co/fYmRXKPb/image-2.jpg',
    'https://i.ibb.co/27YFqqwD/image-3.jpg',
    'https://i.ibb.co/hxJ8zMKj/image-4.jpg',
    'https://i.ibb.co/d0sLSTNw/image-5.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
