import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-5',
  name: 'بور بنك وكشاف بالطاقة الشمسية من دينكس',
  slug: 'denx-solar-power-bank-spotlight',
  description: `لا تدع بطارية هاتفك تنفد مرة أخرى، حتى في قلب الطبيعة! بور بنك دينكس الشمسي هو الحل الشامل للطاقة أثناء التنقل.###FEATURES###- يشحن بالطاقة الشمسية ويناسب الطلعات والسفر.
- فيه شحن لاسلكي سريع ومريح.
- يدعم شحن أكثر من جهاز بنفس الوقت.
- مزود بألواح شمسية قابلة للطي.
- إضاءته قوية تنفع للطوارئ والرحلات.###DETAILS###- الموديل: DX421
- الماركة: دينيكس
- الضمان: عامين
- سعة البطارية: 20000 mAh
- مخرج لاسلكي: 5V/1A
- قدرة الطاقة الشمسية: 5V/0.3A`,
  price: 159.99,
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
