import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-153',
  name: 'طاولة سرير قابلة للطى',
  slug: 'folding-bed-table',
  story: 'الراحة والإنتاجية يمكن أن يجتمعا. هذه الطاولة تحول سريرك أو أريكتك إلى مكتب عمل مريح. بتصميمها القابل للطي وزواياها القابلة للتعديل، تمنحك الحرية للعمل أو القراءة أو تناول الطعام وأنت في قمة الراحة.',
  description: `طاولة لابتوب قابلة للطي والتعديل، تصميمها مثالي للعمل أو القراءة أو تناول الطعام وأنت على السرير أو الأريكة.
###FEATURES###
- يمكن استخدامها كمكتب لابتوب، طاولة طعام، أو للقراءة.
- سطح المكتب يحتوي على جزء قابل للتعديل بـ 5 زوايا مختلفة.
- جزء ثابت مخصص للماوس أو الكوب.
- مصنوعة من خشب متين مقاوم للرطوبة.
- أرجل ألومنيوم قوية ومقاومة للصدأ.
- وسادات مطاطية تمنع الانزلاق والخدوش.
###DETAILS###
- المقاس: 55 × 32 × 25 سم
- الوزن: 2.36 كجم تقريبًا
- المادة: خشب مُصنّع + أنابيب ألومنيوم
- الضمان: 14 يوم`,
  price: 120,
  images: [
    'https://i.ibb.co/9k6vYyCy/image-1.jpg',
    'https://i.ibb.co/1GSYyb78/image-2.jpg',
    'https://i.ibb.co/kVB37Z2q/image-3.jpg',
    'https://i.ibb.co/wrSz3zvT/image-4.jpg',
    'https://i.ibb.co/WvbcFdBG/image-5.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
