import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-53',
  name: 'أبجورة فندقية ذكية',
  slug: 'smart-hotel-style-lamp',
  description: `أضف لمسة من الذكاء والأناقة لمكتبك! هذه الأبجورة الفندقية توفر إضاءة مريحة للعين، شاشة LED لعرض الوقت، شاحن لاسلكي سريع لهاتفك، وحامل مدمج، كل ذلك في تصميم واحد أنيق.###FEATURES###- إضاءة LED بثلاثة ألوان و سطوع متغير.
- شاشة LED تعرض الساعة والمنبه.
- شحن لاسلكي سريع 15 واط.
- حامل جوال مدمج.
- ذراع مرن يتحرك 180 درجة.###DETAILS###- الماركة: جينيريك.
- الضمان: 14 يوم.
- نوع التحكم: لمس
- الشحن اللاسلكي: 15 واط
- مادة التصنيع: ألومنيوم وبلاستيك ABS`,
  price: 189.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
