import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-59',
  name: 'ماتور هواء لكفرات السيارة',
  slug: 'car-tire-air-compressor',
  story: 'على طريق سفر طويل، لاحظت أن إطار سيارتك بدأ يفقد الهواء. لا داعي للقلق. هذا الماتور الصغير هو محطة الوقود المتنقلة الخاصة بك. بضغطة زر، يعيد الحياة لإطاراتك ويتوقف تلقائيًا عند الضغط المثالي. إنه الأمان الذي تحمله معك في صندوق السيارة.',
  description: `جهاز نفخ إطارات رقمي ومحمول، الحل المثالي للطوارئ على الطريق. قوي، سريع، ومتعدد الاستخدامات.
###FEATURES###
- يعرض ضغط الإطارات في الوقت الحقيقي على شاشة رقمية.
- بطارية قابلة للشحن تدوم من 20 إلى 30 دقيقة، ويمكن تشغيله مباشرة من ولاعة السيارة.
- خاصية ضبط الضغط المسبق توقف النفخ تلقائيًا عند الوصول للضغط المطلوب.
- أسطوانة معدنية متينة وقوة عالية لسرعة نفخ فائقة.
- مزود ببطارية ضخمة 6000mAh تعمل كشاحن طوارئ للجوال.
- يحتوي على كشاف LED مدمج للطوارئ الليلية.
###DETAILS###
- القوة: 140 واط كحد أقصى
- البطارية: 2000mAh × 3
- الجهد: 12 فولت DC
- الضغط: يصل حتى 150PSI
- مصدر الطاقة: بطارية ليثيوم أو وصلة ولاعة السيارة`,
  price: 260,
  images: [
    'https://i.ibb.co/b8yZbws/image-1.jpg',
    'https://i.ibb.co/4gMqLyKY/image-2.jpg',
    'https://i.ibb.co/BWxr5Mf/image-3.jpg',
    'https://i.ibb.co/1fbGt4dF/image-4.jpg',
    'https://i.ibb.co/14ZDMkh/image-5.jpg'
  ],
  category: 'misc',
};

export default product;
