import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-13',
  name: 'حافظة مشروبات Moog max الذكية مع سبيكر',
  slug: 'moog-max-smart-bottle-speaker',
  story: `في نزهة على الشاطئ، اجتمع الأصدقاء وكل منهم يحمل شيئًا: أحدهم حافظة الماء، والآخر مكبر صوت. لكن "خالد" كان يحمل شيئًا واحدًا فقط: حافظة Moog Max. بلمسة زر، انطلقت الموسيقى من حافظته 🎶 بينما كان يحتسي مشروبه البارد 🥤. لقد جمع بين الانتعاش والمرح في جهاز واحد، ليصبح نجم الجلسة بلا منازع.`,
  description: `استمتع بمشروبك البارد أو الساخن مع إيقاع موسيقاك المفضلة! حافظة Moog Max ليست مجرد مطارة، بل هي رفيقك اليومي الذي يجمع بين الحفاظ على درجة حرارة مشروبك ومتعة الاستماع للموسيقى.###FEATURES###- تحافظ على الحرارة والبرودة لمدة تصل إلى 12 ساعة.
- مكبر صوت بلوتوث مدمج سهل الفك والتركيب.
- مصنوعة من الستانلس ستيل عالي الجودة.
- تصميم أنيق وعملي بسعة 500 مل.
- قاعدة مقاومة للانزلاق وغطاء محكم.###DETAILS###- السعة: 500 مل
- الخامة: فولاذ مقاوم للصدأ
- الأبعاد: 230 * 65 مللي متر`,
  price: 99.99,
  images: [
    "https://i.ibb.co/FqJCfyV1/image-1.jpg",
    "https://i.ibb.co/j9kd2mV4/image-2.jpg",
    "https://i.ibb.co/NgkXdP8Z/image-3.jpg",
    "https://i.ibb.co/QFHdxNcg/image-4.jpg",
    "https://i.ibb.co/TxLPPLH3/image-5.jpg"
  ],
  category: 'home',
};

export default product;
