import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-95',
  name: 'المنشار المتنقل الكهربائي',
  slug: 'portable-electric-chainsaw',
  description: `منشار كهربائي لاسلكي خفيف الوزن لتقطيع الأخشاب بسهولة وكفاءة، يأتي مع بطاريتين وشاحن سريع.###FEATURES###- بلا أسلاك، يعمل بالبطارية.
- خفيف الوزن وسهل التحكم.
- شفرات حادة وعملية.
- بطارية تدوم لفترة طويلة (يأتي مع بطاريتين).
- مقبض مريح وغير قابل للانزلاق.###DETAILS###- القدرة: 18-21 فولت
- طول المنشار: 12 بوصة
- سرعة السلسلة: 12 متر/ثانية
- الوزن: 2.7 كجم
- نوع البطارية: ليثيوم أيون 18 فولت`,
  price: 399.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
