import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-80',
  name: 'طقم شنيور دريل 120 قطعة',
  slug: '120-piece-drill-kit',
  story: `كل رجل يحتاج إلى صندوق كنوز خاص به. هذا الطقم هو صندوق الكنوز لكل حرفي منزلي. مع 120 قطعة، لا يوجد مسمار لا يمكن فكه أو رف لا يمكن تركيبه. ليس مجرد دريل، بل هو ورشة عمل كاملة في حقيبة واحدة. 🧰`,
  description: `طقم شنيور دريل لاسلكي متكامل يحتوي على 120 قطعة من الأدوات والملحقات. مثالي لأعمال الصيانة المنزلية، الديكور، وتركيب الأثاث.###FEATURES###- يعمل بدون أسلاك لسهولة الحركة.
- مصباح LED مدمج.
- سرعتان لاختيار السرعة المناسبة.
- بطارية قابلة للشحن بسعة 1300 مللي.
- يأتي مع 120 قطعة من الأدوات.###DETAILS###- الجهد الكهربائي: 12 فولت
- سعة البطارية: 1300 ميلي أمبير
- السرعة: 0-1450 دورة في الدقيقة
- أقصى قطر للمقبض: 10 مم`,
  price: 215,
  images: [
    'https://i.ibb.co/ks5dcjMz/image-1.jpg',
    'https://i.ibb.co/XxTdjK8f/image-2.jpg',
    'https://i.ibb.co/84zgtpvv/image-3.jpg',
    'https://i.ibb.co/sJvbTnc6/image-4.jpg',
    'https://i.ibb.co/ch3NB8ty/image-5.jpg',
    'https://i.ibb.co/wrsw647y/image-6.jpg',
    'https://i.ibb.co/rRjLWc6P/image-7.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
