import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-72',
  name: 'مسدس جل للاطفال',
  slug: 'gel-blaster-gun-for-kids',
  story: `الحرب خدعة... ومرح! 🎉 هذا المسدس يحول أي حديقة أو منزل إلى ساحة معركة آمنة وممتعة. كرات الجل المائية تجعل اللعبة مثيرة بدون فوضى أو أذى. ليس مجرد لعبة، بل هو صانع الضحكات والذكريات المليئة بالأكشن.`,
  description: `لعبة مسدس جل آمنة وممتعة للأطفال، تطلق كرات الجل لمسافة تزيد عن 80 قدمًا. تأتي مع نظارة حماية و1000 كرة جل.###FEATURES###- يطلق كرات جل لمسافة تتعدى 80 قدم.
- آمن للأطفال والكرات تتحلل ولا تترك أثرًا.
- يعمل لأكثر من ساعتين متواصلة.
- بطارية قابلة للشحن تشحن بالكامل خلال 30 دقيقة.
- مناسب للعب داخل وخارج المنزل.###DETAILS###- الماركة: جينريك
- الأبعاد: 75 × 4 × 32 سم
- الخامة: بلاستيك
- الفئة العمرية: 6 سنوات وما فوق
- البطارية: قابلة للشحن`,
  price: 115,
  images: [
    'https://i.ibb.co/9J0PmVH/image-1.jpg',
    'https://i.ibb.co/rf0tZRSn/image-2.jpg',
    'https://i.ibb.co/wZ9nNW71/image-3.jpg',
    'https://i.ibb.co/qM7mDQ29/image-4.jpg',
    'https://i.ibb.co/bRQPBZgh/image-5.jpg',
    'https://i.ibb.co/7xmntnwd/image-6.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;