import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-120',
  name: 'ستارة النجم والهلال بريموت كنترول',
  slug: 'star-and-moon-curtain-light',
  story: `في ليالي رمضان أو في غرفة طفلك، هذه الستارة تحول أي جدار إلى سماء مرصعة بالنجوم 🌙✨. بأوضاعها الثمانية، تخلق أجواءً ساحرة وهادئة. ليست مجرد ستارة، بل هي قطعة من السماء في منزلك.`,
  description: `ستارة إضاءة ساحرة على شكل هلال ونجوم, مثالية لإضافة لمسة رمضانية أو تزيين غرف الأطفال. تأتي مع 8 أوضاع إضاءة مختلفة وريموت كنترول للتحكم عن بعد.###FEATURES###- 8 أوضاع إضاءة مختلفة.
- تثبيت سهل بدون أدوات.
- إضاءة LED موفرة للطاقة.
- تعمل عن طريق USB.
- ريموت كنترول للتحكم عن بعد.###DETAILS###- عدد المصابيح: 138 لمبة LED
- الشكل: هلال ونجمة
- اللون: أبيض كريستالي
- التحكم: ريموت
- التشغيل: USB`,
  price: 45.00,
  images: [
    'https://i.ibb.co/dJ02MJbn/image-1.jpg',
    'https://i.ibb.co/PZfy3Vxc/image-2.jpg',
    'https://i.ibb.co/7JjWNwSK/image-3.jpg',
    'https://i.ibb.co/8LrWTzZ0/image-4.png',
    'https://i.ibb.co/BHwzBtr3/image-5.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
