import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-155',
  name: 'مجموعة صنع العصائر من دينكس',
  slug: 'denx-juice-maker-set',
  story: `كل صباح هو فرصة لبداية صحية. هذه المجموعة هي أداتك لصنع عصائر السموذي المنعشة والمليئة بالفيتامينات. اخلط، اطحن، واعصر طريقك إلى حياة أكثر صحة. ليست مجرد مجموعة، بل هي جرعتك اليومية من النشاط. 🥝🍓🍌`,
  description: `مجموعة متكاملة من دينكس لصنع العصائر والسموذي. تعمل كخلاط وعصارة وطاحونة بقوة 400 واط. تأتي مع شفرات ستانلس ستيل وأكواب متعددة.###FEATURES###- قوة 400 واط لعصر سريع.
- شفرات ستانلس ستيل حادة.
- 3 في 1: خلاط, عصارة, طاحونة.
- حماية من الحرارة الزائدة.
- سهلة الفك والتركيب والتنظيف.###DETAILS###- الماركة: دينيكس
- القدرة: 400 واط
- الجهد: 220-240 فولت
- الخامة: ABS + PC + ستانلس ستيل`,
  price: 170.00,
  images: [
    'https://i.ibb.co/F4WLg02B/image-1.jpg',
    'https://i.ibb.co/6JDHr42C/image-2.jpg',
    'https://i.ibb.co/Q38Zd4Hx/image-3.jpg',
    'https://i.ibb.co/Tdk22GK/image-4.jpg',
    'https://i.ibb.co/HDwS5W0X/image-5.jpg',
    'https://i.ibb.co/N2BcStTW/image-6.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
