import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-154',
  name: 'مفرمة اللحوم المتينة 3 لتر',
  slug: 'durable-3l-meat-grinder',
  description: `سرعتين لاختيار المناسب لك تمنحك تحكم دقيق في عملية فرم اللحوم حسب الحاجة. استمتع بفرم اللحوم في المنزل بسهولة. الشفرات مصنوعة من الفولاذ المقاوم للصدأ.###FEATURES###- أجزاءها قابلة للإزالة لتنظيف سريع وسهل بعد كل استخدام.
- مصنوعة من الفولاذ المقاوم للصدأ لتدوم طويلا.
- قوة المحرك 300 واط لطحن اللحوم بفعالية.
- تصميمها أنيق وعصري وتُضفي لمسة جمالية على مطبخك.###DETAILS###- السعة: 3 لتر.
- القوة: 300 واط.
- عدد الشفرات: 4 شفرات.
- الخامة: ستانلس ستيل
- الضمان: 6 شهور`,
  price: 110,
  images: [
    'https://i.ibb.co/Rk05M1dn/image-2.jpg'
  ],
  category: 'home',
  warranty: '6 شهور',
};

export default product;
