import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-55',
  name: 'جراب متين ضدد المياة بضمان عامين',
  slug: 'durable-waterproof-pouch',
  description: `لا تخف على جوالك في الماء بعد الآن! هذا الجراب المتين يطفو على سطح الماء ويحميه حتى عمق 30 مترًا، مع إمكانية استخدام الشاشة والتصوير بوضوح تام.###FEATURES###- يطفو فوق الماء ويمنع الجوال من الغرق.
- مقاوم للماء حتى عمق 30 مترًا (IP68).
- يمكن استخدام الشاشة والتصوير من خلاله.
- محكم الإغلاق وتمنع دخول الموية والغبار.
- يناسب أغلب أنواع الجوالات بدون مشاكل.###DETAILS###- معيار الحماية: IP68
- أقصى عمق للماء: 30 متر
- الخامة: PVC ناعم وقوي
- الوزن: 100 جرام`,
  price: 49.99,
  category: 'misc',
  warranty: '14 يوم',
  story: 'هاتفك هو نافذتك على العالم، وهذه النافذة لا يجب أن تغلق بسبب قطرة ماء. هذا الجراب ليس مجرد غطاء بلاستيكي، بل هو غواصة شخصية لهاتفك. يمنحه القدرة على التنفس تحت الماء، ويطفو لينقذه إذا سقط. هو درع الأمان الذي يتيح لك توثيق مغامراتك المائية دون خوف.',
  faq: [
    {
      question: 'هل يؤثر الجراب على جودة الصور تحت الماء؟',
      answer: 'الجراب مصنوع من مادة PVC شفافة وعالية الجودة مصممة لتقليل التأثير على جودة الصور، مما يسمح لك بالتقاط صور ومقاطع فيديو واضحة تحت الماء.'
    },
    {
      question: 'هل يمكنني استخدام شاشة اللمس وهو داخل الجراب؟',
      answer: 'نعم، يمكنك استخدام شاشة اللمس بشكل طبيعي لمعظم الوظائف. ومع ذلك، قد يتأثر التعرف على بصمة الإصبع تحت الشاشة.'
    },
    {
      question: 'ماذا يعني أنه يطفو فوق الماء؟',
      answer: 'تصميم الجراب يحتوي على حواف مملوءة بالهواء، مما يجعله يطفو على سطح الماء إذا سقط منك، وهذا يمنع هاتفك من الغرق والضياع.'
    }
  ]
};

export default product;
