import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-74',
  name: 'منفاخ متعدد الرؤوس',
  slug: 'multi-head-air-blower',
  story: `الغبار هو العدو الخفي لأجهزتنا الإلكترونية. هذا المنفاخ هو سلاحك السري ضده. بقوته الهوائية، يصل إلى أضيق الأماكن في الكيبورد والكمبيوتر، ويطرد الغبار بلا رحمة. ليس مجرد منفاخ، بل هو حارس نظافة أجهزتك. 💻`,
  description: `منفاخ هواء محمول وقوي لتنظيف الغبار من الأجهزة الإلكترونية والسيارة، مع 4 مستويات للسرعة ورؤوس متعددة.###FEATURES###- نظام هواء ثلاثي المراحل للتبريد والتنظيف.
- يمكن تحويله إلى مجفف شعر محمول.
- 4 مستويات للسرعة.
- تدفق هواء قوي يصل إلى 22 م/ث.
- خفيف ومحمول.
- بطارية قابلة للشحن 1100 مللي أمبير.###DETAILS###- الماركة: جينيريك
- المادة: ABS
- السرعة: 80000 دورة في الدقيقة
- البطارية: 1100 مللي أمبير (مشمولة)`,
  price: 129.99,
  images: [
    'https://i.ibb.co/PGyGsY7k/image-1.jpg',
    'https://i.ibb.co/wNHVPy6T/image-2.jpg',
    'https://i.ibb.co/W4StzZ26/image-3.jpg',
    'https://i.ibb.co/kgjtqLqj/image-4.jpg',
    'https://i.ibb.co/4nj68fmJ/image-5.jpg',
    'https://i.ibb.co/TMwfZrnt/image-6.jpg',
    'https://i.ibb.co/DHrhKLgw/image-7.jpg',
    'https://i.ibb.co/4xm8C2Z/image-8.jpg',
    'https://i.ibb.co/d08swSXR/image-9.jpg',
    'https://i.ibb.co/BKqcB9kF/image-10.jpg',
    'https://i.ibb.co/PZD7VxCy/image-11.jpg'
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
