import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-92',
  name: 'خيمة مرحاض وتغيير الملابس للسفر',
  slug: 'pop-up-privacy-tent',
  description: `خيمة منبثقة محمولة تستخدم كمرحاض، غرفة تغيير ملابس، أو غرفة استحمام أثناء التخييم والرحلات. سهلة التركيب والتخزين.###FEATURES###- غرفة قياس منبثقة مريحة.
- سهلة التركيب وإعادة التعبئة في أقل من 10 ثوانٍ.
- مصنوعة من بوليستر مقاوم للماء وفولاذ مرن.
- مناسبة للشاطئ والتخييم.###DETAILS###- الأبعاد: 100 طول × 100 عرض × 190 ارتفاع سم
- مقاومة للماء.
- القدرة الاستيعابية: 1
- الخامة: بوليستر`,
  price: 149.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
