import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-129',
  name: 'قطاعة خضروات يدوية',
  slug: 'manual-vegetable-slicer',
  story: `حوّل طبق السلطة العادي إلى عمل فني! 🥗 هذه القطاعة ليست مجرد أداة، بل هي فرشاة فنان. بفضل شفراتها المتعددة، يمكنك أن تقطع الخضار بأشكال حلزونية جميلة ومبتكرة. اجعل أطباقك تبدو شهية كما هي لذيذة.`,
  description: `أداة مطبخ متعددة الاستخدامات لتقطيع الخضار بأشكال حلزونية مختلفة. تأتي مع 7 شفرات متنوعة وحاوية للتخزين. آمنة وسهلة التنظيف.###FEATURES###- تقطع الخضار بأشكال حلزونية.
- 7 شفرات لأشكال تقطيع مختلفة.
- قاعدة شفط للتثبيت.
- آمنة للغسل في غسالة الصحون.
- خالية من BPA.###DETAILS###- الماركة: جينريك
- المادة: بلاستيك + ستانلس ستيل
- الوزن: 1.5 كجم`,
  price: 85.00,
  images: [
    'https://i.ibb.co/hF69DzNb/image-1.jpg',
    'https://i.ibb.co/rjXDF2s/image-2.jpg',
    'https://i.ibb.co/1tVVXpCM/image-3.jpg',
    'https://i.ibb.co/kPmK3jD/image-4.jpg',
    'https://i.ibb.co/84tQ15nR/image-5.jpg',
    'https://i.ibb.co/sJFzYrTF/image-6.jpg',
    'https://i.ibb.co/9MNfkVQ/image-7.jpg',
    'https://i.ibb.co/Gv4ScWpM/image-8.jpg',
    'https://i.ibb.co/Hp1jhYkK/image-9.jpg',
    'https://i.ibb.co/dsby17Tk/image-10.jpg',
    'https://i.ibb.co/rfG5GRc2/image-11.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
