import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-93',
  name: 'مرطب هواء على شكل سفينة تيتانيك',
  slug: 'titanic-air-humidifier',
  description: `مرطب هواء بتصميم فريد على شكل سفينة تيتانيك، مع إضاءة LED وإمكانية إضافة زيوت عطرية. يعمل بصمت ويتم التحكم فيه عن بعد.###FEATURES###- يرطب الجو وينعش المكان ببخار ناعم وبارد.
- إضاءة LED مريحة تضيف جو استرخاء.
- يمكن إضافة زيوت عطرية لتعطير المكان.
- سعة خزان 250 مل تكفي لـ 10 ساعات.
- تحكم عن بعد.
- يعمل بتقنية الموجات فوق الصوتية الصامتة.###DETAILS###- الماركة: جينريك
- السعة: 250 مل
- مدة التشغيل: 10 ساعات تقريبًا
- مصدر الطاقة: كهرباء`,
  price: 199.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
