import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-66',
  name: '2x1 ثلاجة وطاولة قابلة للطي',
  slug: '2-in-1-cooler-folding-table',
  story: `في رحلة الشاطئ، دائمًا ما نحمل ثلاجة وطاولة منفصلة. هذا المنتج غير المعادلة! 🔄 الآن، ثلاجة مشروباتنا الباردة تتحول بلمسة واحدة إلى طاولة تجمعنا للأكل والضحك. ليست مجرد ثلاجة، بل هي قلب الجلسة. 🏖️`,
  description: `حافظة طعام وطاولة في منتج واحد! قابلة للطي، مقاومة للماء، بسعة 17 لتر. مثالية للتخييم، الصيد، والشواء.###FEATURES###- تستخدم كحافظة للطعام أو طاولة.
- مصنوعة من مواد مقاومة للماء.
- قابلة للطي وسهلة التخزين.
- سعة تخزين 17 لتر للمشروبات والطعام.
- خفيفة الوزن وسهلة الحمل.###DETAILS###- الأبعاد عند الفتح: 68×35×93.5 سم
- الأبعاد عند الطي: 44×35×30 سم
- السعة التخزينية: 17 لتر
- المادة: بلاستيك ABS مقاوم للماء`,
  price: 240,
  images: [
    'https://i.ibb.co/8g3TS9dM/image-1.jpg',
    'https://i.ibb.co/bjP1TZZ5/image-2.jpg',
    'https://i.ibb.co/PvCwVHyZ/image-3.jpg',
    'https://i.ibb.co/0RRjn4mH/image-4.jpg',
    'https://i.ibb.co/5xJBf7rp/image-5.jpg',
    'https://i.ibb.co/TDJmbz9v/image-6.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;