import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-97',
  name: 'سيارة كهربائية للأطفال بمحرك 380 واط أحمر',
  slug: 'red-electric-car-for-kids',
  story: `كل طفل يستحق سيارته الأولى! 🚗 هذه السيارة الحمراء الأنيقة ليست مجرد لعبة، بل هي مغامرة تنتظر أن تبدأ. بتصميمها الآمن ودورانها الكامل، تمنح طفلك إحساسًا بالحرية والاستكشاف في بيئة آمنة. إنها أكثر من سيارة، إنها صانعة ذكريات الطفولة السعيدة.`,
  description: `سيارة كهربائية آمنة وممتعة للأطفال تدور 360 درجة، مع عجلات مقاومة للانفجار ومحرك قوي لقيادة سلسة.###FEATURES###- عجلات مقاومة للانفجار لا تحتاج نفخ.
- تدور 360 درجة بحرية.
- إطارات لجميع التضاريس مع ممتص صدمات.
- محرك قوي 380 واط.
- سرعة قابلة للتعديل من 3 إلى 8 كم/ساعة.###DETAILS###- الماركة: جينيريك
- المادة: بلاستيك ABS صديق للبيئة
- البطارية: 4.5AH قابلة للشحن
- المحرك: 380 واط
- العمر المناسب: من 2 إلى 10 سنوات`,
  price: 240,
  images: [ 'https://i.ibb.co/C3RQPrsG/image-1.jpg', 'https://i.ibb.co/21Wvtfnj/image-2.jpg' ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;