import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-25',
  name: 'Note 15 مزود ب كيبورد',
  slug: 'note-15-with-keyboard',
  story: `في عالم يتطلب السرعة والقوة، يأتي Note 15 ليكون وحش الأداء الذي لا يخذل 🐉. بذاكرته الجبارة ومعالجه القوي، صُمم هذا الجهاز ليس فقط لتشغيل التطبيقات، بل للتحليق من خلالها. إنه أداة المحترفين، رفيق المبدعين، والسلاح السري لكل من يريد أن يكون دائمًا متقدمًا بخطوة. 🚀`,
  description: `أداء خارق وسرعة فائقة في جهاز واحد! تابلت Note 15 مع الكيبورد المتطور يقدم لك تجربة كتابة وعمل سلسة، بفضل معالجه القوي وذاكرته الضخمة.###FEATURES###- شاشة 8 بوصة عالية الدقة.
- معالج رباعي النواة.
- ذاكرة 16 جيجا رام و 512 جيجا بايت تخزين.
- يدعم 5G، واي فاي، وبلوتوث.
- بطارية 5000 مللي أمبير.###DETAILS###- الشاشة: 8 بوصة
- الذاكرة: 16GB RAM + 512GB ROM
- الكاميرا: 13.0MP أمامية + 13.0MP خلفية
- نظام التشغيل: أندرويد`,
  price: 749.99,
  images: [
    "https://i.ibb.co/gbxwW7q7/image-1.jpg",
    "https://i.ibb.co/WWwdS3P9/image-2.jpg",
    "https://i.ibb.co/jkx1yF7k/image-3.jpg"
  ],
  category: 'electronics',
};

export default product;
