import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-125',
  name: 'كرسي استرخاء بمكبر صوت',
  slug: 'inflatable-lounge-chair-with-speaker',
  story: `استرخاء مع موسيقى! 🎧🛋️ هذا الكرسي القابل للنفخ ليس مجرد مكان للجلوس، بل هو تجربة متكاملة. استرخِ، اغمض عينيك، ودع الموسيقى تنبعث من كرسيك. ليس مجرد كرسي، بل هو حفلتك الموسيقية الخاصة.`,
  description: `كرسي قابل للنفخ يوفر تجربة جلوس مريحة مع مكبر صوت مدمج للاستماع للموسيقى. سهل النفخ والتفريغ, ومثالي للاستخدام الداخلي والخارجي.###FEATURES###- كرسي قابل للنفخ مع مسند للقدمين.
- مكبر صوت مدمج.
- سهل النفخ والتفريغ والتخزين.
- مصنوع من مادة PVC متينة.
- يتحمل وزن حتى 150 كجم.###DETAILS###- الماركة: جينيريك
- الأبعاد: 28.4 × 25.5 × 12.6 سم
- قابل للنفخ: نعم
- الوزن الأقصى: 150 كجم`,
  price: 199.00,
  images: [
    'https://i.ibb.co/8DSxtmmL/image-1.jpg',
    'https://i.ibb.co/Hpn06P7v/image-2.jpg',
    'https://i.ibb.co/W4pDtcSs/image-3.jpg',
    'https://i.ibb.co/CKD1V1JM/image-4.jpg',
    'https://i.ibb.co/JRSrrzgt/image-5.jpg',
    'https://i.ibb.co/cXD5Y7rz/image-6.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
