import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-16',
  name: 'سماعة أيربودز من Noxon',
  slug: 'noxon-airpods',
  story: `في مقهى صاخب ☕، جلست "نورة" تحاول إجراء مكالمة مهمة. كان الضجيج يملأ المكان، لكن مع سماعات Noxon، اختفى كل شيء. عزلت السماعات الضوضاء المحيطة بها 🎧، وسمعت صوت المتصل بوضوح وكأنها في غرفة هادئة. لم تكن مجرد سماعات، بل كانت فقاعتها الخاصة من الهدوء والتركيز في عالم مليء بالضوضاء.`,
  description: `تدعم عزل الضوضاء لسماع واضح. تتصل تلقائي بالجوال. تدعم التحكم باللمس بدون أزرار. تتوافق مع كل الأنظمة (أندرويد/آيفون). صوت نقي وواضح في المكالمات.###DETAILS###- الماركة: نوكسون
- وقت التشغيل: 2.5 ساعة مكالمات متواصلة
- مدى الاتصال: 10 أمتار
- إعادة الشحن من العلبة: 2–3 مرات`,
  price: 100,
  images: [
    "https://i.ibb.co/NdGWH6wp/image-1.jpg",
    "https://i.ibb.co/rfq35v7Q/image-2.jpg",
    "https://i.ibb.co/Q7Wd9bN3/image-3.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
