import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-142',
  name: 'قطاعة بطاطس يدوية',
  slug: 'manual-potato-cutter',
  story: `لماذا تشتري البطاطس المقلية المجمدة وأنت يمكنك صنعها طازجة في المنزل؟ 🍟 هذه القطاعة هي سر البطاطس المقلية المثالية. بضغطة واحدة، تحصل على أصابع بطاطس متساوية وجاهزة للقلي. ليست مجرد قطاعة، بل هي تذكرتك لمذاق البطاطس الحقيقي.`,
  description: `قطاعة بطاطس يدوية من الستانلس ستيل لتقطيع البطاطس والخضروات بسهولة. تأتي مع شفرتين لحجمين مختلفين وآمنة للاستخدام في غسالة الصحون.###FEATURES###- شفرات حادة تقطع البطاطس والخضار بسهولة.
- مقبض طويل ومريح.
- تعمل يدويًا بدون كهرباء.
- مصنوعة من ستانلس ستيل متين.
- تأتي مع شفرتين لحجمين مختلفين.###DETAILS###- الماركة: smart kitchen
- المادة: ستانلس ستيل
- تعليمات العناية: آمنة في غسالة الصحون`,
  price: 99.00,
  images: [
    'https://i.ibb.co/DDHTw2CN/image-1.jpg',
    'https://i.ibb.co/nqsYh3Xr/image-2.jpg',
    'https://i.ibb.co/chx7dgZv/image-3.jpg',
    'https://i.ibb.co/35YMhRK3/image-4.jpg',
    'https://i.ibb.co/x81xsK3z/image-5.jpg',
    'https://i.ibb.co/LD4BjCn1/image-6.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
