import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-15',
  name: 'بور بنك بكشاف بالطاقة الشمسية 5 أوضاع إضاءة',
  slug: 'solar-power-bank-with-spotlight',
  story: `في حالات الطوارئ، عندما تنقطع الكهرباء ويحل الظلام 칠, يصبح هذا الجهاز بطلاً حقيقيًا 🦸. هو ليس مجرد كشاف، بل هو محطة طاقة مصغرة تستمد قوتها من أشعة الشمس، قادرة على إنارة غرفة كاملة وشحن هاتفك في نفس الوقت. إنه الشعور بالأمان عندما تكون في أمس الحاجة إليه، ضوء في نهاية النفق. ✨`,
  description: `إضاءة قوية جداً بسطوع 6000 لومن. تشتغل بالطاقة الشمسية بدون كهرباء. مقاومة للماء، مناسبة للاستخدام الخارجي. بطارية قابلة للشحن مدمجة. شحن USB للطوارئ والأجهزة الصغيرة.###DETAILS###- المادة: ABS
- مقاوم للماء: نعم
- زاوية الإضاءة: 140°
- شدة السطوع: 6000 لومن
- عمر المصباح: 50,000 ساعة`,
  price: 100,
  images: [
    "https://i.ibb.co/9kHb8Tsn/image-1.jpg",
    "https://i.ibb.co/qY5Np1nN/image-2.jpg",
    "https://i.ibb.co/dJ0Xq3Mp/image-3.jpg",
    "https://i.ibb.co/WTY5Wm3/image-4.jpg",
    "https://i.ibb.co/MDyB41C1/image-5.jpg",
    "https://i.ibb.co/cX24Bg8w/image-6.jpg",
    "https://i.ibb.co/ZRcXVYQf/image-7.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
