import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-113',
  name: 'عرض الخلاط الألماني ومحمصة الخبز',
  slug: 'german-blender-and-toaster-bundle',
  story: `ابدأ يومك بفطور الأبطال! 🍞🍹 خلاط ألماني قوي يصنع لك أروع العصائر، ومحمصة أنيقة تجهز لك خبزًا ذهبيًا ومقرمشًا. ليس مجرد عرض، بل هو وصفتك السرية ليوم مليء بالنشاط والطاقة.`,
  description: `حل متكامل للمطبخ العصري. خلاط ألماني قوي 4500 واط يطحن الثلج واللحوم, مع محمصة خبز كهربائية من Denx بـ 6 مستويات تحميص وضمان عامين.###FEATURES###- خلاط Silver Crest بقوة 4500 واط و 15 سرعة.
- مطحنة 600 مل قوية ضد الكسر.
- محمصة خبز Denx بقوة 750 واط و 6 مستويات تحميص.
- شفرات ستانلس ستيل قوية في الخلاط.
- تصميمات عملية وخامات متينة.###DETAILS###- الخلاط: Silver Crest, 4500W, 15 سرعة
- المحمصة: DENX, DX4401, 750W, 6 مستويات
- الضمان: 14 يوم للخلاط / عامين للمحمصة`,
  price: 155.00,
  images: [
    'https://i.ibb.co/N2Lr3kV1/image-1.jpg',
    'https://i.ibb.co/QF4qjXWQ/image-2.jpg',
    'https://i.ibb.co/mVgXKdM2/image-3.jpg',
    'https://i.ibb.co/d4jzLtcm/image-4.png',
    'https://i.ibb.co/q3171B2Y/image-2.jpg',
    'https://i.ibb.co/m5HB6YhC/image-3.jpg',
    'https://i.ibb.co/Lz9j2P0j/image-1.jpg'
  ],
  category: 'home',
  warranty: 'متعدد',
};

export default product;
