import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-116',
  name: 'محمصة خبز كهربائية',
  slug: 'electric-bread-toaster',
  description: `محمصة خبز من Denx لتحضير فطور سريع ولذيذ. تتميز بـ 6 مستويات تحميص, وغرفتين من الستانلس ستيل, مع خاصية الإيقاف التلقائي وصينية فتات سهلة التنظيف.###FEATURES###- 6 مستويات تحميص قابلة للتعديل.
- غرفتين من الستانلس ستيل.
- إخراج تلقائي للخبز بعد التحميص.
- توزيع حرارة متساوي.
- صينية فتات قابلة للإزالة لسهولة التنظيف.###DETAILS###- الماركة: DENX
- الموديل: DX4401
- القوة: 700-750 واط
- عدد الشرائح: 2
- الخامة: ستانلس ستيل + بلاستيك مقاوم للحرارة`,
  price: 95.00,
  category: 'home',
  warranty: 'عامين',
};

export default product;
