import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-117',
  name: 'منظم خزين الملابس 3 اقسام',
  slug: '3-section-laundry-sorter',
  story: 'يوم الغسيل لم يعد كابوسًا. هذا المنظم هو مساعدك الشخصي لفرز الملابس. بثلاثة أقسام وعجلات سهلة الحركة، يحول مهمة الغسيل من فوضى إلى نظام. إنه الخطوة الأولى نحو غسيل أسهل وأسرع.',
  description: `تفصل الملابس الفاتحة عن الغامقة بكل سهولة. تسهل عليك الغسيل وتختصر الوقت والجهد. تغنيك عن حمل الأكياس الثقيلة على الكتف. بعجلات قوية تتحرك بكل الاتجاهات.###FEATURES###- فيها غطاء يخفي الملابس ويمنع الروائح تطلع.
- خامة قماش أوكسفورد متينة وتتحمل الاستخدام اليومي.
- من الداخل مطلية بطبقة بلاستيك مقاومة للرطوبة.
- سهلة التركيب، ما تحتاج وقت أو أدوات معقدة.###DETAILS###- الخامة: قماش أوكسفورد + أنابيب بلاستيك متينة
- الأبعاد: 61 × 35 × 65 سم
- الوزن: 1.8 كجم تقريبًا
- الضمان: 14 يوم`,
  price: 145,
  images: [
    'https://i.ibb.co/TM5LDhWr/image-1.jpg',
    'https://i.ibb.co/m174wRb/image-2.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;