import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-136',
  name: 'خرطوم قابل للتمدد ٣٠ متر',
  slug: 'expandable-hose-30m',
  description: `خرطوم ماء خفيف الوزن يتمدد حتى 30 مترًا تحت ضغط الماء وينكمش تلقائيًا بعد الاستخدام لسهولة التخزين. تصميم ذكي يمنع الالتواءات والتشابك.###FEATURES###- يتمدد مع ضغط الماء وينكمش تلقائيًا.
- خفيف الوزن وسهل الحمل.
- يمنع الالتواءات والتشابك.
- مصنوع من طبقتين لضمان المتانة.
- يأتي مع رأس رش متعدد الاستخدامات.###DETAILS###- الطول: يتمدد حتى 30 متر
- المادة: طبقتان متينتان مقاومة للتآكل`,
  price: 89.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
