import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-138',
  name: 'موقد غاز 5 عين للتخييم',
  slug: '5-burner-camping-gas-stove',
  story: `في الكشتة، الأكل هو أهم شيء. هذا الموقد ذو الخمس شعلات هو مطبخ الشيف المحترف في قلب الصحراء. بقوته الجبارة وتصميمه القابل للطي، يضمن لك وليمة فاخرة تحت النجوم. ليس مجرد موقد، بل هو سر الطبخات اللي عليها الكلام. 👨‍🍳🔥`,
  description: `موقد غاز قوي ومحمول من DLC بخمس شعلات وقدرة 18500 واط. مثالي للرحلات والمطابخ. يتميز بإشعال إلكتروني وتصميم قابل للطي مع حقيبة حمل.###FEATURES###- 5 شعلات للتحكم الدقيق.
- قدرة 18500 واط لتسخين فوري.
- إشعال إلكتروني سريع وآمن.
- تصميم قابل للطي لسهولة التخزين.
- يأتي مع خرطوم غاز وحقيبة حماية.###DETAILS###- الماركة: dlc
- القدرة: 18500 واط
- عدد الشعلات: 5
- الإشعال: إلكتروني`,
  price: 199.00,
  images: [
    'https://i.ibb.co/whwXxL1r/image-1.jpg',
    'https://i.ibb.co/bgHBJmsB/image-2.jpg',
    'https://i.ibb.co/yFB06yPD/image-3.jpg',
    'https://i.ibb.co/mrXKHv1z/image-4.jpg',
    'https://i.ibb.co/Hy3Wyx9/image-5.jpg',
    'https://i.ibb.co/9mX3K22h/image-6.jpg',
    'https://i.ibb.co/kgZPJBFn/image-7.jpg',
    'https://i.ibb.co/QFgCgD6D/image-8.jpg'
  ],
  category: 'home',
  warranty: 'عامين',
};

export default product;
