import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-153',
  name: 'طاولة سرير قابلة للطى',
  slug: 'folding-bed-table',
  story: `العمل أو الأكل في السرير أصبح أكثر راحة وأناقة. هذه الطاولة الذكية تمنحك سطحًا ثابتًا للابتوبك أو طبقك، مع إمكانية تعديل الزاوية. ليست مجرد طاولة، بل هي ترقية لتجربة الاسترخاء في السرير. 🛌`,
  description: `طاولة عملية وقابلة للطي للاستخدام على السرير أو الكنبة. سطحها قابل للتعديل بخمس زوايا مختلفة مع جزء ثابت للماوس. مصنوعة من خشب متين وأرجل ألومنيوم.###FEATURES###- تستخدم كمكتب لابتوب أو طاولة عشاء.
- سطح قابل للتعديل بـ 5 زوايا.
- جزء ثابت للماوس.
- أرجل قابلة للطي لسهولة التخزين.
- خفيفة الوزن ومحموله.###DETAILS###- المقاس: 55 × 32 × 25 سم
- الوزن: 2.36 كجم
- المادة: خشب مُصنّع + أنابيب ألومنيوم`,
  price: 95.00,
  images: [
    'https://i.ibb.co/9k6vYyCy/image-1.jpg',
    'https://i.ibb.co/1GSYyb78/image-2.jpg',
    'https://i.ibb.co/kVB37Z2q/image-3.jpg',
    'https://i.ibb.co/wrSz3zvT/image-4.jpg',
    'https://i.ibb.co/WvbcFdBG/image-5.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
