import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-152',
  name: 'طاولة قابلة للتعديل',
  slug: 'adjustable-table',
  description: `طاولة متعددة الاستخدامات للابتوب أو القراءة أو الأكل. يمكن تعديل ارتفاعها وميلان سطحها، وتأتي مع عجلات لسهولة الحركة وحواجز لمنع انزلاق الأشياء.###FEATURES###- تنفع للابتوب، القراءة، أو الأكل.
- ارتفاع قابل للتعديل (59-89 سم).
- سطح مائل مع حواجز لمنع الانزلاق.
- هيكل حديد متين مع عجلات.
- خفيفة وسهلة التخزين.###DETAILS###- المادة: خشب مع هيكل حديد
- الأبعاد: 60 × 40 × 59-89 سم`,
  price: 110.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
