import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-154',
  name: 'مفرمة اللحوم المتينة 3 لتر',
  slug: 'durable-3l-meat-grinder',
  description: `سرعتين لاختيار المناسب لك تمنحك تحكم دقيق في عملية فرم اللحوم حسب الحاجة. استمتع بفرم اللحوم في المنزل بسهولة. الشفرات مصنوعة من الفولاذ المقاوم للصدأ.###FEATURES###- أجزاءها قابلة للإزالة لتنظيف سريع وسهل بعد كل استخدام.
- مصنوعة من الفولاذ المقاوم للصدأ لتدوم طويلا.
- قوة المحرك 300 واط لطحن اللحوم بفعالية.
- تصميمها أنيق وعصري وتُضفي لمسة جمالية على مطبخك.###DETAILS###- السعة: 3 لتر.
- القوة: 300 واط.
- عدد الشفرات: 4 شفرات.
- الخامة: ستانلس ستيل
- الضمان: 6 شهور`,
  rawDescription: `• المميزات: سعر للبيع:
110
ر.س
• سرعتين لاختيار المناسب لك تمنحك تحكم دقيق في عملية فرم اللحوم حسب الحاجة.
• استمتع بفرم اللحوم في المنزل بسهولة
• الشفرات مصنوعة من الفولاذ المقاوم للصدأ
• أجزاءها قابلة للإزالة لتنظيف سريع وسهل بعد كل استخدام.
• مصنوعة من الفولاذ المقاوم للصدأ لتدوم طويلا.
• كافية للاستخدام المنزلي وتناسب احتياجاتك.
• قوة المحرك 300 واط لطحن اللحوم بفعالية.
• متوافقة مع مختلف أنواع التيار الكهربائي 50/60 هرتز.
• تصميمها أنيق وعصري وتُضفي لمسة جمالية على مطبخك.
• تفاصيل سريعة:
• اسم الماركة:Generic
• مدة الضمان: 6
• وكيل الضمان: دوزن
• السعة:- 3 لتر.
• القوة:- 300 واط.
• التردد:- 50-60hz.
• الجهد الكهربائي:- 220/240V.
• بلد الصنع: الصين.
• عدد الشفرات: 4 شفرات.
• اللون: فضي.
• الوزن:حوالي 1.5 إلى 2 كجم (تقريبًا)
• الابعاد: 25 سم × 20 سم × 20 سم
• الخامة: (ستانلس ستيل)
• خامة الشفرات: شفرات فولاذية مقاومة للصدأ
• نوع الأزرار: زر ضغط
• طريقة التركيب: معدة للتشغيل مباشرة.
• محتويات العبوة:
• 1 x وعاء بسعة 3 لتر.
• 1 x شفرات فولاذية مقاومة للصدأ.
• 1 x وحدة المحرك.
• 1 x غطاء شفاف.
• 1 x كتيب تعليمات`,
  price: 110,
  images: [
    'https://i.ibb.co/Rk05M1dn/image-2.jpg'
  ],
  category: 'home',
  warranty: '6 شهور',
};

export default product;
