import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-22',
  name: 'ساعة سمارت ULTRA',
  slug: 'ultra-smart-watch',
  description: `أناقة وقوة على معصمك! ساعة ULTRA الذكية بتصميمها العصري وشاشتها عالية الدقة تمنحك كل ما تحتاجه لمتابعة لياقتك وصحتك.###FEATURES###- شاشة عالية الدقة وكاملة.
- أزرار من الجهتين مثل ساعة آبل.
- استقبال جميع الإشعارات والمكالمات.
- قياس نبضات القلب، أكسجين الدم، وضغط الدم.
- مقاومة للماء ومصممة بمواد متينة.###DETAILS###- الشاشة: 1.96 inch HD screen
- البلوتوث: BT 3.5 / 5.0
- البطارية: 320 مللي أمبير
- الشحن: لاسلكي`,
  price: 189.99,
  category: 'health',
  story: 'ساعة Ultra ليست مجرد أداة لمعرفة الوقت، بل هي لوحة قيادة لصحتك وحياتك الرقمية، ترتديها على معصمك. بتصميمها الذي يجمع بين القوة والأناقة، ومميزاتها التي تراقب أدق تفاصيل صحتك، هي تذكير دائم بأن وقتك وصحتك هما أثمن ما تملك.',
  faq: [
    {
      question: 'هل تدعم الساعة استقبال إشعارات واتساب؟',
      answer: 'نعم، الساعة تستقبل جميع إشعارات التطبيقات من هاتفك، بما في ذلك واتساب، فيسبوك، سناب شات وغيرها.'
    },
    {
      question: 'هل قياسات ضغط الدم والأكسجين دقيقة؟',
      answer: 'الساعة توفر مؤشرات حيوية للمتابعة الشخصية، ولكنها لا تعتبر جهازًا طبيًا. للحصول على قياسات طبية دقيقة، يجب دائمًا استشارة الطبيب.'
    },
    {
      question: 'هل يمكن تغيير خلفية الساعة؟',
      answer: 'نعم، يمكنك الاختيار من بين العديد من الخلفيات المدمجة، كما يمكنك إضافة أي صورة من معرض صور هاتفك كخلفية للساعة.'
    }
  ]
};

export default product;
