import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-46',
  name: 'إضاءة مكتب',
  slug: 'office-light',
  description: `إضاءة ذكية لمكتبك! تعمل بحساس حركة وتوفر 8 ألوان مختلفة لتناسب مزاجك. لا تعمل إلا في الظلام لتوفير الطاقة. مثالية للقراءة والعمل دون إجهاد للعين.###FEATURES###- إضاءة LED بـ 8 ألوان مختلفة.
- تعمل بحساس حركة (على بعد 2-3 متر).
- تعمل بـ 3 بطاريات AAA (غير مشمولة).
- لا تعمل في وجود ضوء لتوفير الطاقة.
- سهلة التركيب على طرف المكتب.###DETAILS###- نوع الإضاءة: LED
- عدد الألوان: 8 ألوان
- الجهد الكهربائي: 4.5V
- مصدر الطاقة: 3 بطاريات AAA
- الخامة: بلاستيك ABS`,
  price: 39.99,
  category: 'home',
};

export default product;
