import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-127',
  name: 'دفاية و موقد 2 في 1',
  slug: '2-in-1-heater-and-stove',
  story: `في ليالي البرد القارسة، تحتاج إلى الدفء... وربما كوب شاي ساخن. هذا الجهاز يمنحك الاثنين معًا! 🔥🍵 استخدمه كدفاية لتدفئة جلستك، أو كموقد لتحضير وجبتك. ليس مجرد جهاز، بل هو رفيقك الدافئ في كل رحلة.`,
  description: `جهاز تدفئة وموقد محمول 2 في 1, مثالي للتخييم والرحلات. يوفر تدفئة سريعة بقوة 2000 واط ويمكن استخدامه كموقد للطهي.###FEATURES###- وظيفتان: تدفئة وطهي.
- تصميم خفيف ومحمول.
- قوة 2000 واط لتدفئة سريعة.
- آمن وسهل الاستخدام.
- يعمل على دبات الغاز العادية.
- مصنوع من ستيل مقاوم للصدأ.###DETAILS###- المساحة القابلة للاستخدام: 5 متر مربع
- القوة: 2000 واط
- المادة: فولاذ مقاوم للصدأ 430`,
  price: 149.00,
  images: [
    'https://i.ibb.co/pjvfP8Ct/image-1.jpg',
    'https://i.ibb.co/1Y0nJgcR/image-2.jpg',
    'https://i.ibb.co/zTyCwB07/image-3.jpg',
    'https://i.ibb.co/W4G6k362/image-4.jpg',
    'https://i.ibb.co/BhZKmw1/image-5.jpg',
    'https://i.ibb.co/8LjJr18x/image-6.jpg',
    'https://i.ibb.co/pjB4VtdC/image-7.jpg',
    'https://i.ibb.co/Hf8F50Ww/image-8.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
