import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-110',
  name: 'عرض غسالة محمولة و مسحوق منظف',
  slug: 'portable-washer-detergent-bundle',
  description: `عرض متكامل للغسيل السريع والفعال. غسالة ملابس وأحذية محمولة قابلة للطي, مع مسحوق منظف على شكل أوراق للحفاظ على الألوان.###FEATURES###- غسالة محمولة قابلة للطي, مثالية للسفر.
- تعقيم بالضوء الأزرق.
- موفرة للماء والكهرباء.
- أوراق منظفة تمنع بهتان الألوان وتسمح بغسل الأبيض مع الملون.
- تنظيف قوي يزيل البقع.###DETAILS###- الغسالة: سعة 2 كجم, مؤقت 5/10 دقائق
- المنظف: 20 ورقة بالعلبة
- الغسالة: قابلة للطي وخفيفة الوزن`,
  price: 110.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
