import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-17',
  name: 'سماعة أيربودز i12 TWS',
  slug: 'i12-tws-airpods',
  story: `في عالم السماعات باهظة الثمن 💰، تأتي i12 TWS لتقول: "الصوت النقي للجميع". هي ليست مجرد سماعة اقتصادية، بل هي بوابة إلى عالم الموسيقى بجودة عالية وتصميم مريح. إنها تثبت أن التجربة الصوتية الرائعة لا يجب أن تكلف الكثير، وأن الأناقة والبساطة يمكن أن تجتمعا في منتج واحد في متناول الجميع. 🎧✨`,
  description: `صوت ستيريو نقي وواضح. تصميم مريح وخفيف الوزن. تدعم البلوتوث 5.0 لاتصال سريع وثابت. تتوافق مع الآيفون والأندرويد. علبة الشحن توفر شحن إضافي.###DETAILS###- الموديل: i12 TWS
- إصدار البلوتوث: 5.0
- مدة التشغيل: من 2 إلى 3 ساعات
- زمن الشحن: ساعة ونص تقريبًا`,
  price: 100,
  images: [
    "https://i.ibb.co/dJ0j5yK7/image-1.jpg",
    "https://i.ibb.co/vxRF1pXK/image-2.jpg",
    "https://i.ibb.co/tPvnHTSD/image-3.jpg",
    "https://i.ibb.co/b5pL2CSL/image-4.jpg",
    "https://i.ibb.co/3mcHtGqP/image-5.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
