import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-26',
  name: 'ساعة سمارت Ultra T8',
  slug: 'smart-watch-ultra-t8',
  story: `كل يوم هو فرصة لتكون أفضل. ساعة Ultra T8 ليست هنا فقط لتعرض الوقت، بل لتكون شاهدًا على رحلتك نحو الأفضل 📈. تراقب نبضك، تحسب خطواتك، وتذكرك بأهدافك. بتصميمها الأنيق الذي يناسب كل الأوقات، هي رسالة تضعها على معصمك كل يوم: "أنا هنا لأتطور". 💪`,
  description: `كن دائمًا مميزًا مع ساعة سمارت Ultra T8! بتصميمها العصري وشاشتها الكبيرة عالية الدقة، يمكنك التحكم في جوالك، متابعة صحتك، واستقبال إشعاراتك بكل أناقة وسهولة.###FEATURES###- شاشة كبيرة 1.96 بوصة عالية الدقة.
- أزرار من الجهتين بتصميم عصري.
- استقبال جميع الإشعارات والمكالمات.
- قياس نبضات القلب، أكسجين الدم، وضغط الدم.
- تدعم الشحن اللاسلكي.###DETAILS###- الأبعاد: 49*44*12 سم
- الشاشة: 1.96 inch HD screen
- البلوتوث: BT 3.5 / 5.0
- البطارية: 320 مللي أمبير`,
  price: 199.99,
  images: [
    "https://i.ibb.co/Rp68R9Bp/image-1.jpg",
    "https://i.ibb.co/9X8Cw5p/image-2.jpg",
    "https://i.ibb.co/ZpGwFt4j/image-3.jpg",
    "https://i.ibb.co/9H9fP1Mz/image-4.jpg",
    "https://i.ibb.co/3ykrbH80/image-5.jpg"
  ],
  category: 'health',
};

export default product;
