import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-2',
  name: 'كشاف دينكس الأكبر حجما',
  slug: 'denx-large-solar-spotlight',
  story: `تخيل أن تمتلك قطعة من الشمس في حديقتك ☀️. كشاف دينكس ليس مجرد ضوء، بل هو حارس ليلي يستمد قوته من النهار لينير عتمة الليل. ببطاريته العملاقة وحساسه الذكي، يستشعر وجودك ليضيء طريقك 🚶‍♂️، ويحمي منزلك، ويحول مساحتك الخارجية إلى واحة من الأمان والجمال دون أن يكلفك ريالًا واحدًا على فاتورة الكهرباء.`,
  description: `إضاءة قوية بفضل لمبات LED 5730 الموفرة. يشتغل بالطاقة الشمسية بدون كهرباء أو أسلاك. بطارية 25000mAh تدوم حتى 16 ساعة. يدعم التحكم بالريموت عن بعد بكل سهولة. فيه حساس رادار يشتغل أوتوماتيكي مع الحركة. مقاوم للمطر والغبار بمعيار حماية IP67.`,
  rawDescription: `كشاف دينكس الأكبر حجما ضمان عاميين
سعر للبيع:
260
ر.س

المميزات:
إضاءة قوية بفضل لمبات LED 5730 الموفرة
يشتغل بالطاقة الشمسية بدون كهرباء أو أسلاك
بطارية 25000mAh تدوم حتى 16 ساعة
يدعم التحكم بالريموت عن بعد بكل سهولة
فيه حساس رادار يشتغل أوتوماتيكي مع الحركة
مقاوم للمطر والغبار بمعيار حماية IP67
يتحمل أصعب الأجواء مثل المطر والعواصف الرملية
إضاءة ذكية تشتغل تلقائي مع الغروب وتطفي مع الشروق
تقدر تتحكم بقوة الإضاءة حسب حاجتك
تركيبه سهل وسريع، يحتاج أربع مسامير فقط
تفاصيل سريعة:
الماركة: دينيكس
الضمان: عامين 
وكيل الضمان: دينيكس
نوع اللمبات: LED 5730
سعة البطارية: 25000mAh ليثيوم
اللوح الشمسي: سيليكون أحادي عالي الكفاءة
مدة الإضاءة: حتى 16 ساعة بالشحنة الكاملة
معيار الحماية: IP67 ضد الماء والغبار
المواد: ABS متين مقاوم للظروف
طرق التشغيل: حساس حركة + ريموت + تحكم أوتوماتيكي
محتويات المنتج:
1 × لمبة شارع بالطاقة الشمسية
1 × ريموت تحكم
1 × عدة تثبيت (مسامير وأدوات)
1 × كتيب إرشادات
طريقة الاستخدام:
ثبت الكشاف بأربع مسامير بالمكان المطلوب
خلّه يشحن من الشمس طول النهار
شغّله بزر التشغيل أو الريموت المرفق
اختر وضع الإضاءة اللي يناسبك
يشتغل تلقائي مع الغروب ويطفي مع الشروق`,
  price: 260,
  images: [
    "https://i.ibb.co/r2rr2C8W/image-1.jpg",
    "https://i.ibb.co/6c4876VS/image-2.jpg",
    "https://i.ibb.co/tTznjckD/image-3.jpg",
    "https://i.ibb.co/x4D3kGC/image-4.jpg",
    "https://i.ibb.co/JRN3gw3d/image-5.jpg",
    "https://i.ibb.co/VcgWrf49/image-6.jpg"
  ],
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
