import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-90',
  name: 'قطعتين بلف مضيئ للدراجة النارية',
  slug: '2pcs-led-skull-tire-valve-caps',
  story: `أضف لمسة من الجنون والأمان لدراجتك! 💀 هذه الأغطية المضيئة ليست مجرد زينة، بل هي إعلان عن وجودك في ظلام الطريق. مع كل حركة للعجلة، تضيء هذه الجماجم لتجعل منك نجم الطريق. 🌟`,
  description: `أضف لمسة عصرية لسيارتك أو دراجتك مع هذه الأغطية المضيئة للصمامات على شكل جمجمة. تعمل باستشعار الحركة وتزيد من الأمان والإضاءة.###FEATURES###- إضاءة قوية على شكل جمجمة.
- تعمل عن طريق استشعار الحركة.
- تضيف شكلًا عصريًا وجديدًا.
- تزيد الإضاءة الخارجية للتقليل من الحوادث.
- مصنوعة من مواد عالية الجودة.###DETAILS###- الماركة: جينيريك
- الشكل: جمجمة
- الأبعاد: 2.28 × 5.8 × 2.3 سم
- الخامة: ألومنيوم وبلاستيك`,
  price: 39.99,
  images: [
    'https://i.ibb.co/TM9VNrmn/image-1.jpg',
    'https://i.ibb.co/DP31fFrq/image-2.jpg',
    'https://i.ibb.co/ch61bk87/image-3.jpg',
    'https://i.ibb.co/n87PXcxb/image-4.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
