import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-85',
  name: 'لعبة كرة طائرة سحرية',
  slug: 'magic-flying-ball-toy',
  story: `هل حلمت يومًا بالتحكم في كرة طائرة بقوة عقلك؟ 🤔 هذه الكرة السحرية تقترب من ذلك الحلم. ارمها في الهواء وشاهدها تعود إليك كالسحر، مع أضواء مبهرة. ليست مجرد لعبة، بل هي قطعة من الخيال بين يديك. ✨`,
  description: `كرة طائرة سحرية مضيئة بتقنية RGB، تطير وتعود إلى يدك مثل البوميرانغ. لعبة آمنة وممتعة للأطفال تنمي المهارات الحركية.###FEATURES###- تطير بشكل سحري وتعود لليد.
- مضيئة بـ RGB لتأثيرات ليلية.
- آمنة للأطفال بتصميم كروي محمي.
- مصنوعة من بلاستيك ABS متين.
- بطارية قابلة لإعادة الشحن عبر USB.###DETAILS###- الماركة: جينيريك
- الخامة: بلاستيك ABS
- الأبعاد: 10 × 10 × 10 سم
- الوزن: 20 جرام
- البطارية: ليثيوم قابلة للشحن`,
  price: 89.99,
  images: [
    'https://i.ibb.co/7J0ny2Bf/image-1.jpg',
    'https://i.ibb.co/1fS2PVqq/image-2.jpg',
    'https://i.ibb.co/454Cdsh/image-3.jpg',
    'https://i.ibb.co/cKT7W4JJ/image-4.jpg',
    'https://i.ibb.co/sdmKSP9b/image-5.jpg',
    'https://i.ibb.co/ksJKdXwk/image-6.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
