import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-54',
  name: 'طاولة متعددة الاستخدامات لون أبيض',
  slug: 'multi-use-folding-table-white',
  story: `البساطة هي قمة الأناقة. هذه الطاولة البيضاء ليست مجرد قطعة أثاث، بل هي لوحة بيضاء لأفكارك 🎨. استخدمها كمكتب للابتوب، أو طاولة للفطور في السرير، أو حتى مساحة لعب لأطفالك. بتصميمها القابل للطي، يمكنك أن تخلق مساحتك الخاصة في أي وقت وفي أي مكان.`,
  description: `رفيقتك المثالية في الرحلات والمنزل! طاولة خفيفة وقابلة للطي، تتحمل وزن حتى 30 كجم وتوفر مساحة تخزين داخلية. استخدمها للابتوب، للأكل، أو للدراسة.###FEATURES###- خفيفة ومتينة وقابلة للطي.
- تتحمل وزن يصل إلى 30 كجم.
- سطح واسع يناسب لابتوبات حتى 17 إنش.
- مساحة تخزين داخلية مخفية.
- سهلة التنظيف والحمل.###DETAILS###- الأبعاد: 60×40×30 سم
- الخامة: إطار ألمنيوم مع سطح MDF
- الوزن: 1.3 كجم`,
  price: 89.99,
  images: [
    "https://i.ibb.co/Jj87xsdx/image-1.jpg",
    "https://i.ibb.co/XxYPgcL9/image-2.jpg",
    "https://i.ibb.co/Z6srHB9y/image-3.jpg",
    "https://i.ibb.co/JRKFbJF1/image-4.jpg",
    "https://i.ibb.co/hJfkLxh5/image-5.jpg"
  ],
  category: 'home',
};

export default product;
