import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-16',
  name: 'سماعة أيربودز من Noxon',
  slug: 'noxon-airpods',
  description: `انغمس في عالم من الصوت النقي مع سماعات Noxon! بتصميمها المريح وميزة عزل الضوضاء، ستستمتع بمكالماتك وموسيقاك بوضوح تام. تتصل بجوالك تلقائيًا بمجرد فتح العلبة.###FEATURES###- تدعم عزل الضوضاء لسماع واضح.
- تتصل تلقائيًا بالجوال.
- تدعم التحكم باللمس بدون أزرار.
- تتوافق مع كل الأنظمة (أندرويد/آيفون).
- صوت نقي وواضح في المكالمات.###DETAILS###- الماركة: نوكسون
- الضمان: 14 يوم
- وقت التشغيل: 2.5 ساعة مكالمات متواصلة
- مدى الاتصال: 10 أمتار
- إعادة الشحن من العلبة: 2–3 مرات`,
  price: 99.99,
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
