import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-46',
  name: 'إضاءة مكتب',
  slug: 'office-light',
  story: `في الليل، عندما تحتاج إلى التركيز، هذه الإضاءة هي صديقك الصامت 🤫. تستشعر حركتك لتضيء مكتبك، وتغير ألوانها لتناسب مزاجك. هي ليست مجرد لمبة، بل هي شريك ذكي يساعدك على الإبداع والتركيز في هدوء الليل. 🌈`,
  description: `إضاءة ذكية لمكتبك! تعمل بحساس حركة وتوفر 8 ألوان مختلفة لتناسب مزاجك. لا تعمل إلا في الظلام لتوفير الطاقة. مثالية للقراءة والعمل دون إجهاد للعين.###FEATURES###- إضاءة LED بـ 8 ألوان مختلفة.
- تعمل بحساس حركة (على بعد 2-3 متر).
- تعمل بـ 3 بطاريات AAA (غير مشمولة).
- لا تعمل في وجود ضوء لتوفير الطاقة.
- سهلة التركيب على طرف المكتب.###DETAILS###- نوع الإضاءة: LED
- عدد الألوان: 8 ألوان
- الجهد الكهربائي: 4.5V
- مصدر الطاقة: 3 بطاريات AAA`,
  price: 39.99,
  images: [
    "https://i.ibb.co/xqP64TR4/image-1.jpg",
    "https://i.ibb.co/Jj40cHTW/image-2.jpg",
    "https://i.ibb.co/20Nfb8Mw/image-3.jpg",
    "https://i.ibb.co/SDqzVhBk/image-4.jpg"
  ],
  category: 'home',
};

export default product;
