import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-11',
  name: 'محول الجوال الى جهاز كمبيوتر من دينكس',
  slug: 'denx-mobile-to-pc-adapter',
  story: `كان "أحمد" مصمم جرافيك 🎨، لكن إبداعه كان محبوسًا في شاشة هاتفه الصغيرة. حتى حصل على محول دينكس. بلمسة واحدة، تحول هاتفه إلى استوديو إبداعي متكامل على شاشة كبيرة 🖥️، حيث أصبح ينقل ملفاته بسرعة البرق ويتعامل مع كروت الذاكرة كالمحترفين. لم يعد هاتفه مجرد هاتف، بل أصبح نافذة لإمكانيات لا حدود لها.`,
  description: `حوّل جوالك إلى محطة عمل متكاملة! محول دينكس هو الحل السحري لتوصيل كل ملحقاتك بجهاز واحد. اعرض على شاشة كبيرة، انقل ملفاتك بسرعة، واقرأ كروت الذاكرة.###FEATURES###- يعرض لك فيديو بجودة 4K عن طريق HDMI.
- سرعة نقل عالية عبر منافذ USB (تصل إلى 5Gbps).
- فيه قارئ كروت TF/SD للصور والملفات.
- يدعم أحدث تقنية Type-C.
- متوافق مع اللابتوبات، الجوالات، والتابلت.###DETAILS###- الماركة: دينكس
- إخراج الفيديو: 4K عبر HDMI
- المنافذ: USB, Type-C, SD/TF
- سرعة النقل: تصل إلى 5Gbps`,
  price: 149.99,
  images: [
    "https://i.ibb.co/HL5Xw2pb/image-1.jpg",
    "https://i.ibb.co/NMxxjj3/image-2.jpg",
    "https://i.ibb.co/5hb4XwZY/image-3.jpg",
    "https://i.ibb.co/8Dv1spjV/image-4.jpg",
    "https://i.ibb.co/HprZ3RpH/image-5.jpg",
    "https://i.ibb.co/j9FgyFz9/image-6.jpg",
    "https://i.ibb.co/gZ9hMTc2/image-7.jpg",
    "https://i.ibb.co/XZpMB36P/image-8.jpg",
    "https://i.ibb.co/Xx5VsLmc/image-9.jpg"
  ],
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
