import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-8',
  name: 'باور بنك 10000 ملى امبير من دينكس',
  slug: 'denx-10000mah-power-bank',
  story: `تخيل أنك في منتصف يوم حافل، وبطارية هاتفك على وشك النفاد. هنا يأتي دور بطل الجيب الصغير، باور بانك دينكس. بقوته التي تبلغ 30 واط، يعيد الحياة لهاتفك بسرعة البرق، بينما حجمه الصغير يجعله يختفي في جيبك دون أن تشعر به. إنه ليس مجرد شاحن، بل هو الثقة التي تحملها معك طوال اليوم.`,
  description: `القوة والسرعة في جيبك! باور بنك دينكس بقوة 30 واط هو شريان الحياة لأجهزتك. بحجمه الصغير وقدرته على الشحن السريع، لن تقلق أبدًا بشأن نفاد البطارية.###FEATURES###- قوة شحن 30 واط لشحن فائق السرعة.
- سعة 10000 mAh تكفيك لشحن جوالك أكثر من مرة.
- حجم صغير ومناسب للجيب أو الشنطة.
- منافذ متعددة لشحن أكثر من جهاز.
- حماية من الحرارة الزائدة والتماس الكهربائي.###DETAILS###- الماركة: دينيكس
- الموديل: DX432
- القدرة: 30W
- السعة: 10000 mAh`,
  price: 89.99,
  images: [
    "https://i.ibb.co/pSsqFgJ/image-1.jpg",
    "https://i.ibb.co/QjNNTZpk/image-2.jpg",
    "https://i.ibb.co/mFJvkLHW/image-3.jpg"
  ],
  category: 'electronics',
  warranty: 'عامين',
};

export default product;
