import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-133',
  name: 'مصيدة فئران سهلة الاستخدام',
  slug: 'easy-to-use-mouse-trap',
  story: `عندما يظهر ضيف غير مرغوب فيه في منزلك 🐭، هذه المصيدة هي الحل الإنساني والفعال. تصميمها الذكي يمنع الهروب، وهي آمنة للاستخدام حول الأطفال. ليست مجرد مصيدة، بل هي حارس منزلك الصامت.`,
  description: `مصيدة فئران قابلة لإعادة الاستخدام, مصممة لمنع الهروب وسهولة التنظيف. آمنة للاستخدام حول الأطفال والحيوانات الأليفة.###FEATURES###- محكمة الإغلاق لمنع الهروب.
- سهلة الاستخدام والتنظيف.
- آمنة للاستخدام في الأماكن القريبة من الأطفال والحيوانات.
- تصميم قوي ومتين.
- آلية حساسة تقفل الباب فور لمس الطُعم.###DETAILS###- أبعاد المنتج: 26*13*13 سم`,
  price: 35.00,
  images: [
    'https://i.ibb.co/sJt1nxpy/image-1.jpg',
    'https://i.ibb.co/sJppszGJ/image-2.jpg',
    'https://i.ibb.co/hJVBKbzH/image-3.jpg',
    'https://i.ibb.co/d4tL9ygt/image-4.jpg'
  ],
  category: 'home',
  warranty: 'لا يوجد',
};

export default product;
