import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-14',
  name: 'كافر جوال وباوربنك لحماية أيفون 15 pro max',
  slug: 'iphone-15-pro-max-power-bank-case',
  story: `آيفون 15 Pro Max، تحفة تكنولوجية تستحق حماية وأداءً استثنائيين 📱. هذا الكفر ليس مجرد درع، بل هو قلب نابض إضافي لهاتفك. صُمم ليكون امتدادًا طبيعيًا لجهازك، يمنحه القوة لمواصلة العمل طوال اليوم 💪، ويحميه من صدمات الحياة، كل ذلك مع الحفاظ على أناقته ورشاقته. إنه التوازن المثالي بين القوة والجمال.`,
  description: `بطارية مدمجة بسعة 6800mAh. تصميم نحيف وأنيق وخفيف الوزن. يشحن الجهاز لاسلكيًا بلمسة واحدة. يحمي الجوال من الصدمات والخدوش. شاشة LED لعرض مستوى الشحن.###DETAILS###- السعة: 6800mAh
- متوافق مع: iPhone 15 Pro Max (6.7 انش)
- الخامة: ABS + TPU
- نوع البطارية: ليثيوم بوليمر`,
  price: 125,
  images: [
    "https://i.ibb.co/tphvzgXD/image-1.jpg",
    "https://i.ibb.co/WvKyhYkt/image-2.jpg",
    "https://i.ibb.co/dxFQvwM/image-3.jpg",
    "https://i.ibb.co/C53Q8f5M/image-4.jpg",
    "https://i.ibb.co/93sG80Yn/image-5.jpg"
  ],
  category: 'electronics',
};

export default product;
