import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-49',
  name: 'ساعة رياضية ذكية',
  slug: 'smart-sports-watch',
  story: `صحتك هي أغلى ما تملك، وهذه الساعة هي حارسك الشخصي 👨‍⚕️. تتابع نبضات قلبك، تحسب خطواتك، وتراقب نومك. هي ليست مجرد ساعة، بل هي همسة تذكير يومية بأن تهتم بنفسك، وأن كل خطوة صغيرة نحو صحة أفضل هي إنجاز يستحق الاحتفال. 🎉`,
  description: `شريكك في رحلتك الصحية! ساعة رياضية ذكية تقيس نبضات قلبك، خطواتك، السعرات الحرارية، وجودة نومك. توصل لك إشعارات جوالك وتبقى مشحونة لأكثر من 15 يومًا في وضع الاستعداد.###FEATURES###- تقيس نبضات القلب والخطوات والسعرات.
- تراقب جودة النوم.
- تستقبل إشعارات المكالمات والرسائل.
- بطارية تدوم لأكثر من 15 يومًا (استعداد).
- مقاومة لرذاذ الماء.###DETAILS###- الموديل: Shivay M3 Smart Band
- الاتصال: بلوتوث 4.0
- سعة البطارية: 40mAh
- مقاومة للماء: مناسبة للرذاذ`,
  price: 89.99,
  images: [
    "https://i.ibb.co/m5dD3q2V/image-1.jpg",
    "https://i.ibb.co/pv0xkvyb/image-2.jpg",
    "https://i.ibb.co/gbDxwg9r/image-3.jpg",
    "https://i.ibb.co/5XZyHVTc/image-4.jpg",
    "https://i.ibb.co/B2yp7Bqx/image-5.jpg",
    "https://i.ibb.co/0RcwYZZm/image-6.jpg",
    "https://i.ibb.co/BKSmk2nT/image-7.jpg",
    "https://i.ibb.co/hJNrvmTj/image-8.jpg"
  ],
  category: 'health',
  warranty: '14 يوم',
};

export default product;
