import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-92',
  name: 'خيمة مرحاض وتغيير الملابس للسفر',
  slug: 'pop-up-privacy-tent',
  story: `في البر أو على الشاطئ، الخصوصية هي كنز. هذه الخيمة هي مساحتك الخاصة في قلب الطبيعة. استخدمها كمرحاض، أو لتبديل ملابسك، أو حتى كغرفة استحمام. ليست مجرد خيمة، بل هي حصنك الشخصي الذي يمنحك الراحة والخصوصية. 🏕️`,
  description: `خيمة منبثقة محمولة تستخدم كمرحاض، غرفة تغيير ملابس، أو غرفة استحمام أثناء التخييم والرحلات. سهلة التركيب والتخزين.###FEATURES###- غرفة قياس منبثقة مريحة.
- سهلة التركيب وإعادة التعبئة في أقل من 10 ثوانٍ.
- مصنوعة من بوليستر مقاوم للماء وفولاذ مرن.
- مناسبة للشاطئ والتخييم.###DETAILS###- الأبعاد: 100 طول × 100 عرض × 190 ارتفاع سم
- مقاومة للماء.
- القدرة الاستيعابية: 1
- الخامة: بوليستر`,
  price: 149.99,
  images: [
    'https://i.ibb.co/V5F0MwF/image-1.jpg',
    'https://i.ibb.co/CpfC5J2d/image-2.jpg',
    'https://i.ibb.co/MyT2qs27/image-3.jpg',
    'https://i.ibb.co/3YdhZSK6/image-4.jpg',
    'https://i.ibb.co/pBVpfs3y/image-5.jpg',
    'https://i.ibb.co/fVvCXFsB/image-6.jpg',
    'https://i.ibb.co/p6H0C8G5/image-7.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
