import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-86',
  name: 'مطرقة نجاة محمولة باليد ومتعددة الادوات',
  slug: 'multi-tool-survival-hammer',
  story: `عندما تكون في البر، كل أداة تحملها يجب أن تكون لها قيمة. هذه الأداة ليست مجرد مطرقة، بل هي 19 أداة في واحدة. من زرادية إلى سكين، هي صندوق العدة الكامل في جيبك. ليست أداة، بل هي شريكك في البقاء على قيد الحياة. 🏕️`,
  description: `أداة نجاة متعددة 19 في 1، تشمل مطرقة، زرادية، سكين، ومفكات. مثالية للتخييم، الرحلات، والطوارئ.###FEATURES###- مقبض خشبي مريح.
- تصميم قابل للطي وسهل الحمل.
- مصنوعة من فولاذ مقاوم للصدأ.
- تحتوي على 19 أداة متعددة الاستخدامات.
- تأتي مع جراب للحفظ والتنظيم.###DETAILS###- الماركة: جينيريك
- الخامة: خشب + فولاذ مقاوم للصدأ
- عدد الأدوات: 19 أداة
- الأبعاد: 142 × 82 مم`,
  price: 60,
  images: [
    'https://i.ibb.co/Nnp41bGK/image-1.jpg',
    'https://i.ibb.co/sdz9mY5K/image-2.jpg',
    'https://i.ibb.co/WW4SJkMs/image-3.jpg',
    'https://i.ibb.co/7dF8xghL/image-4.jpg',
    'https://i.ibb.co/1jnc8nx/image-5.jpg',
    'https://i.ibb.co/XZrR5v6v/image-6.jpg',
    'https://i.ibb.co/YBgZBPTX/image-7.jpg',
    'https://i.ibb.co/VpP4hCjS/image-8.jpg',
    'https://i.ibb.co/NnfQXCJW/image-9.jpg'
  ],
  category: 'misc',
  warranty: '14 يوم',
};

export default product;