import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-130',
  name: 'مصباح قاتل البعوض بالأشعة فوق البنفسجية',
  slug: 'uv-mosquito-killer-lamp',
  description: `صاعق حشرات كهربائي قوي بقوة 18 واط وجهد يصل إلى 3800 فولت. يستخدم الأشعة البنفسجية لجذب الحشرات ويغطي مساحة تصل إلى 200 متر مربع.###FEATURES###- صاعق بقوة تصل إلى 3800 فولت.
- مصباح 18 واط بالأشعة البنفسجية.
- يغطي مساحة كبيرة (حتى 200 متر مربع).
- بدون صوت مزعج أو رائحة.
- صينية قابلة للفك لسهولة التنظيف.###DETAILS###- الطاقة: 18 واط
- الجهد بالشبكة: 1000 إلى 1200 فولت
- منطقة التغطية: 2100 قدم مربعة`,
  price: 110.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
