import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-115',
  name: 'كرسى الاسترخاء الشبكى قابل للطى',
  slug: 'folding-mesh-relaxing-chair',
  story: `في شرفة منزلك أو في حديقتك، هذا الكرسي هو دعوتك الخاصة للاسترخاء. بتصميمه الشبكي الأنيق وظهره القابل للتعديل، يمنحك جلسة مريحة لا مثيل لها. ليس مجرد كرسي، بل هو تذكرتك للحظات من الهدوء والسكينة. 😌`,
  description: `كرسي استرخاء مصنوع يدويًا بحبال منسوجة أنيقة وإطار بامبو قوي. يوفر جلسة مريحة مع ظهر قابل للتعديل لثلاث مستويات. مثالي للاستخدام الداخلي والخارجي.###FEATURES###- مصنوع يدويًا بحبال بوليستر منسوجة.
- إطار بامبو قوي ومتين.
- مقاوم للشمس والرطوبة.
- ظهر قابل للتعديل (3 مستويات).
- لا يحتاج تركيب, وخفيف الوزن.###DETAILS###- الخامة: بامبو مع حبال بوليستر
- الأبعاد: 77 × 47 × 84 سم
- الوزن: 7.8 كجم
- الاستخدام: داخلي وخارجي`,
  price: 240.00,
  images: [
    'https://i.ibb.co/SXSg9MWT/image-1.jpg',
    'https://i.ibb.co/4ZbCnY0d/image-2.jpg',
    'https://i.ibb.co/8LYm9Dfm/image-3.jpg',
    'https://i.ibb.co/qFJk0Dxk/image-4.jpg',
    'https://i.ibb.co/7t5BwP2h/image-5.jpg',
    'https://i.ibb.co/GvvNFG1v/image-6.jpg',
    'https://i.ibb.co/Vs0yKPF/image-7.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
