import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-94',
  name: 'ماكينة تلميع السيارات',
  slug: 'car-polishing-machine',
  story: `سيارتك هي مرآة شخصيتك. هذه الماكينة هي الملمع السحري الذي يعيد البريق لسيارتك 🚗✨. بسهولة وبدون أسلاك، يمكنك أن تزيل الخدوش السطحية وتعيد الحياة للون سيارتك. ليست مجرد آلة، بل هي أداة استعادة الشباب لسيارتك.`,
  description: `ماكينة تلميع سيارات لاسلكية وخفيفة الوزن، مع 8 سرعات متغيرة ومجموعة ملحقات متكاملة لتلميع السيارات والخشب وإزالة الصدأ.###FEATURES###- خفيفة وسهلة الحمل، تعمل بالبطارية.
- محرك نحاسي 380 واط.
- نظام تلميع اهتزازي يحافظ على الطلاء.
- 8 سرعات قابلة للتعديل.
- نظام تبريد بالهواء.###DETAILS###- الماركة: جينيريك
- عدد القطع: 19 قطعة
- البطارية: 1300mAh
- السرعة: 2800-5500 دورة بالدقيقة`,
  price: 329.99,
  images: [
    'https://i.ibb.co/jvqvZnvW/image-1.jpg',
    'https://i.ibb.co/NgtgGQJp/image-2.jpg',
    'https://i.ibb.co/RTPsxhhQ/image-3.jpg',
    'https://i.ibb.co/rGgQTT3m/image-4.jpg',
    'https://i.ibb.co/ZzLgXywT/image-5.jpg',
    'https://i.ibb.co/BVLxSh99/image-6.jpg',
    'https://i.ibb.co/TByPkB4G/image-7.jpg',
    'https://i.ibb.co/Lzj2Cr4Y/image-8.jpg'
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
