import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-55',
  name: 'جراب متين ضدد المياة بضمان عامين',
  slug: 'durable-waterproof-pouch',
  description: `لا تخف على جوالك في الماء بعد الآن! هذا الجراب المتين يطفو على سطح الماء ويحميه حتى عمق 30 مترًا، مع إمكانية استخدام الشاشة والتصوير بوضوح تام.###FEATURES###- يطفو فوق الماء ويمنع الجوال من الغرق.
- مقاوم للماء حتى عمق 30 مترًا (IP68).
- يمكن استخدام الشاشة والتصوير من خلاله.
- محكمة الإغلاق وتمنع دخول الموية والغبار.
- يناسب أغلب أنواع الجوالات بدون مشاكل.###DETAILS###- الماركة: MOOGMAX
- الضمان: 14 يوم.
- معيار الحماية: IP68
- الخامة: PVC ناعم وقوي
- الوزن: 100 جرام`,
  price: 49.99,
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
