import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-109',
  name: 'عرض الخلاط الألماني مع مكيف صحراوي وبخاخ رذاذ',
  slug: 'blender-cooler-mist-bundle',
  story: 'هذا ليس مجرد عرض، بل هو حزمة النجاة الكاملة للصيف! ☀️ خلاط ألماني قوي لتحضير العصائر المنعشة، مكيف صحراوي لتبريد الأجواء، وبخاخ رذاذ ليضيف لمسة من الانتعاش. إنه الحل المتكامل لجعل صيفك أكثر برودة ومتعة.',
  description: `رذاذ الترطيب يغطي مساحة كبيرة ويبرد الجو بشكل ممتاز. الخلاط الألماني يعطيك قوة طحن عالية مع سعة كبيرة للعصائر والسموذي. المكيف الصحراوي يبرد بشكل فعّال ويشتغل على طاقة قليلة.###FEATURES###- الخلاط فيه مطحنتين لطحن اللحوم والتوابل.
- شفرات الخلاط ستانلس ستيل قوية.
- المكيف فيه ترطيب للجو ممتاز للأجواء الجافة.
- كل الأجهزة سهلة الاستخدام وبتوفر وقت وجهد كبير.###DETAILS###- الخلاط: Silver Crest, 4500 واط
- المكيف: Denx, 4 لتر, 80 واط, 3 سرعات, ضمان عامين
- بخاخ الرذاذ: 10 متر, 10 فتحات`,
  price: 320,
  images: [
    'https://i.ibb.co/tp9gpJLT/image-1.jpg',
    'https://i.ibb.co/QjC8Hpcf/image-2.jpg',
    'https://i.ibb.co/m5HB6YhC/image-3.jpg'
  ],
  category: 'home',
  warranty: 'متعدد',
};

export default product;