import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-77',
  name: 'جهاز البوكسينج يعمل بالموسيقى في المنزل',
  slug: 'music-boxing-machine',
  story: `لماذا يكون التمرين مملاً؟ هذا الجهاز يحول الملاكمة إلى حفلة! 🥊🎶 اضرب مع إيقاع الموسيقى، اتبع الأضواء، وحول تمرينك إلى لعبة ممتعة. ليس مجرد جهاز رياضي، بل هو DJ ومدرب الملاكمة الخاص بك في نفس الوقت.`,
  description: `جهاز تمرين ملاكمة منزلي يتفاعل مع الموسيقى والأضواء لجعل التمرين ممتعًا. يقوي اللياقة ويحسن ردود الفعل.###FEATURES###- تجمع بين الملاكمة والموسيقى.
- الأضواء تتفاعل مع الضربات.
- 3 مستويات للسرعة قابلة للتعديل.
- تتحمل وزن 400 كغم.
- سهلة التثبيت بأكواب شفط قوية.
- تعمل بالبلوتوث لتشغيل الموسيقى.###DETAILS###- الماركة: جينيريك
- المادة: ABS
- الأبعاد: 32 × 27.5 × 3.5 سم
- البطارية: بطارية ليثيوم 500mAh (قابلة للشحن)`,
  price: 150,
  images: [
    'https://i.ibb.co/W41FMnRn/image-1.jpg',
    'https://i.ibb.co/Q7dK4FZZ/image-2.jpg',
    'https://i.ibb.co/B2Mz71jD/image-3.jpg',
    'https://i.ibb.co/G4tCpTTS/image-4.jpg',
    'https://i.ibb.co/cKm25p1d/image-5.jpg',
    'https://i.ibb.co/zhwZ7bs3/image-6.jpg',
    'https://i.ibb.co/jP1SQbHw/image-7.jpg'
  ],
  category: 'health',
  warranty: '14 يوم',
};

export default product;