import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-31',
  name: 'محطة شحن صغيرة',
  slug: 'mini-charging-station',
  description: `استمتع بالطاقة أينما كنت! محطة الشحن الصغيرة هذه تعمل بالطاقة الشمسية وتوفر لك مصدر طاقة محمول وموثوق لشحن أجهزتك وإضاءة مكانك، مثالية للرحلات والطوارئ.###FEATURES###- تعمل بالطاقة الشمسية.
- بطارية قابلة للشحن بسعة 4000mAh.
- 4 مستويات للإضاءة عبر 3 لمبات LED.
- منفذ USB لشحن الجوال.
- حماية من الجهد المنخفض والعالي.###DETAILS###- البطارية: 6 فولت / 4 أمبير
- مدة الشحن: 6-7 ساعات
- مدة التشغيل: 4 ساعات تقريبًا
- مخرج الشحن USB: 5 فولت / 1 أمبير`,
  price: 249.99,
  category: 'home',
  warranty: '14 يوم',
  story: 'عندما تكون بعيدًا عن صخب المدينة، آخر ما تريده هو القلق بشأن الكهرباء. هذه المحطة الصغيرة هي استقلالك عن الشبكة. هي قطعة من الشمس تضعها في حقيبتك، تضيء خيمتك، وتشحن هاتفك، لتبقى على اتصال بالعالم أو لتستمتع بعزلتك بسلام.',
  faq: [
    {
      question: 'كم لمبة تأتي مع المحطة؟',
      answer: 'تأتي المحطة مع 3 لمبات LED، كل لمبة بقوة 3 واط ومزودة بكابل طوله 3 أمتار.'
    },
    {
      question: 'هل يمكن شحن المحطة من كهرباء المنزل؟',
      answer: 'نعم، بالإضافة إلى الشحن بالطاقة الشمسية، تأتي المحطة مع شاحن كهربائي عادي لشحنها من أي مقبس كهرباء قبل الخروج للرحلات.'
    },
    {
      question: 'ما هي مدة عمل اللمبات؟',
      answer: 'عند شحن المحطة بالكامل، يمكن للمبات أن تعمل لمدة 4 ساعات تقريبًا، حسب عدد اللمبات المستخدمة ومستوى السطوع.'
    }
  ]
};

export default product;
