import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-115',
  name: 'كرسى الاسترخاء الشبكى قابل للطى',
  slug: 'folding-mesh-relaxing-chair',
  description: `كرسي استرخاء مصنوع يدويًا بحبال منسوجة أنيقة وإطار بامبو قوي. يوفر جلسة مريحة مع ظهر قابل للتعديل لثلاث مستويات. مثالي للاستخدام الداخلي والخارجي.###FEATURES###- مصنوع يدويًا بحبال بوليستر منسوجة.
- إطار بامبو قوي ومتين.
- مقاوم للشمس والرطوبة.
- ظهر قابل للتعديل (3 مستويات).
- لا يحتاج تركيب, وخفيف الوزن.###DETAILS###- الخامة: بامبو مع حبال بوليستر
- الأبعاد: 77 × 47 × 84 سم
- الوزن: 7.8 كجم
- الاستخدام: داخلي وخارجي`,
  price: 240.00,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
