import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-31',
  name: 'محطة شحن صغيرة',
  slug: 'mini-charging-station',
  description: `استمتع بالطاقة أينما كنت! محطة الشحن الصغيرة هذه تعمل بالطاقة الشمسية وتوفر لك مصدر طاقة محمول وموثوق لشحن أجهزتك وإضاءة مكانك، مثالية للرحلات والطوارئ.###FEATURES###- تعمل بالطاقة الشمسية.
- بطارية قابلة للشحن بسعة 4000mAh.
- 4 مستويات للإضاءة عبر 3 لمبات LED.
- منفذ USB لشحن الجوال.
- حماية من الجهد المنخفض والعالي.###DETAILS###- الماركة: جينريك
- الضمان: 14 يوم
- البطارية: 6 فولت / 4 أمبير
- مدة الشحن: 6-7 ساعات
- مدة التشغيل: 4 ساعات تقريبًا
- مخرج الشحن USB: 5 فولت / 1 أمبير`,
  price: 249.99,
  category: 'home',
  warranty: '14 يوم',
};

export default product;
