import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-53',
  name: 'أبجورة فندقية ذكية',
  slug: 'smart-hotel-style-lamp',
  story: `مكتبك هو مملكتك، وهذه الأباجورة هي جوهرة التاج 👑. تضيء مساحتك، تشحن هاتفك لاسلكيًا، تعرض لك الوقت، وتحمل جوالك. هي ليست مجرد أباجورة، بل هي مركز قيادة صغير لمكتبك، يجمع بين الأناقة الفندقية والتكنولوجيا الذكية. 💡`,
  description: `أضف لمسة من الذكاء والأناقة لمكتبك! هذه الأبجورة الفندقية توفر إضاءة مريحة للعين، شاشة LED لعرض الوقت، شاحن لاسلكي سريع لهاتفك، وحامل مدمج، كل ذلك في تصميم واحد أنيق.###FEATURES###- إضاءة LED بثلاثة ألوان و سطوع متغير.
- شاشة LED تعرض الساعة والمنبه.
- شحن لاسلكي سريع 15 واط.
- حامل جوال مدمج.
- ذراع مرن يتحرك 180 درجة.###DETAILS###- نوع التحكم: لمس
- الشحن اللاسلكي: 15 واط
- مادة التصنيع: ألومنيوم وبلاستيك ABS
- الأبعاد: 6 سم × 10.5 سم × 28 سم`,
  price: 189.99,
  images: [
    "https://i.ibb.co/tMdDhGZ4/image-1.jpg",
    "https://i.ibb.co/Z6dKkspy/image-2.jpg",
    "https://i.ibb.co/N20HWN1p/image-3.jpg",
    "https://i.ibb.co/LzWRwg5T/image-4.jpg",
    "https://i.ibb.co/rfGqrp94/image-5.png"
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
