import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-70',
  name: 'مصباح ليزر أبيض قابل للتكبير بقوة 100000 لومن',
  slug: '100000-lumen-zoomable-laser-flashlight',
  story: `عندما تحتاج إلى قوة الضوء المطلقة، هذا الكشاف هو سلاحك 🔦. بضوئه الذي يخترق الظلام لمسافة 800 متر، ورأسه المصمم لكسر الزجاج، هو ليس مجرد كشاف، بل هو أداة نجاة حقيقية. في البر أو في الطوارئ، هذا الكشاف هو شعاع الأمان الذي لا ينطفئ. 🌟`,
  description: `كشاف ليزر قوي جدًا مصنوع من ألمنيوم الطيران، بمدى يصل إلى 800 متر، 5 أوضاع إضاءة، ويمكن استخدامه كباور بانك.###FEATURES###- مصنوع من ألمنيوم طيران قوي ومتين جدًا.
- رأسه مصمم لكسر الزجاج والحجر.
- نوره يوصل 800 متر.
- 5 أوضاع إضاءة.
- يمكن استخدامه كباور بانك لشحن الجوال.
- يشحن سريعًا بمنفذ Type-C.###DETAILS###- الماركة: جينيريك
- المادة: ألمنيوم طيران مقوّى
- نوع الشريحة: LED بقوة 30 واط
- نوع الشحن: Type-C شحن سريع
- نوع البطارية: يدعم 18650 و26650`,
  price: 189.99,
  images: [
    'https://i.ibb.co/NdpKV5bz/image-1.jpg',
    'https://i.ibb.co/ccC5Dm1k/image-2.jpg',
    'https://i.ibb.co/60xcLZD2/image-3.jpg'
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
