import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-121',
  name: 'اباجورة رمضان',
  slug: 'ramadan-lamp',
  story: 'أضف لمسة من السحر الشرقي إلى ليالي رمضان. هذه الأباجورة ليست مجرد مصدر للضوء، بل هي قطعة فنية تروي حكايات ألف ليلة وليلة. بظلالها وزخارفها، تخلق أجواءً من الهدوء والروحانية، مثالية لجلسات السمر العائلية.',
  description: `تصميم رمضاني فريد بزخارف الهلال والنجوم. إضاءة LED آمنة توفر طاقة وحرارة منخفضة. إضاءة دافئة تخلق جو رمضاني مريح وجميل. حجم مثالي يناسب الطاولات والأرفف بسهولة.###FEATURES###- متينة وعالية الجودة: تدوم طويلاً.
- لمسة ديكور راقية تضيف جمالاً لأي ركن في المنزل.
- سهلة الاستخدام تشغيل بسيط دون تعقيد.
- هدية مثالية رائعة لتقديمها في شهر رمضان.###DETAILS###- اللون: أسود.
- الوزن: 180 جرام.
- خامة المنتج: بلاستيك عالي الجودة.
- الضمان: 14 يوم.`,
  price: 100,
  images: [
    'https://i.ibb.co/3mFP8QWs/image-1.png',
    'https://i.ibb.co/tp535MBQ/image-2.jpg',
    'https://i.ibb.co/jv1qn4md/image-3.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;