import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-10',
  name: 'سماعة بحامل مانع للسقوط',
  slug: 'anti-fall-headset-with-holder',
  story: `في صالة الألعاب الرياضية المزدحمة، حيث الحركة لا تتوقف 🏋️‍♂️، كان الرياضي يقلق دائمًا من سقوط سماعاته. حتى اكتشف هذه السماعة. بتصميمها المغناطيسي الذكي، تحولت السماعة إلى عقد أنيق حول رقبته عند عدم الاستخدام 🧲، وبفضل مقاومتها للعرق، أصبحت جزءًا لا يتجزأ من تمرينه. لم تعد الموسيقى تتوقف، ولم يعد هناك قلق من السقوط. 🎶`,
  description: `سماعة بلوتوث رياضية بتصميم ذكي ومريح، تضمن لك استماعًا متواصلًا أثناء التمارين دون القلق من سقوطها.
###FEATURES###
- بلوتوث 5.0 لاتصال سريع ومستقر.
- بطارية قوية 250 ملي أمبير تدوم تقريبًا 30 ساعة.
- تصميم مغناطيسي يحول السماعات إلى عقد أنيق حول الرقبة.
- مقاومة للماء والعرق، مثالية للرياضة.
- سطح ناعم من السيليكون لراحة فائقة.
###DETAILS###
- الماركة: BASTEC
- إصدار البلوتوث: V5.0
- مسافة التشغيل: 10 أمتار
- سعة البطارية: 250mAh`,
  price: 110,
  images: [
    "https://i.ibb.co/Y7pgXJs0/image-1.jpg",
    "https://i.ibb.co/bMLfJNdv/image-2.jpg",
    "https://i.ibb.co/R4VVDPF4/image-3.jpg",
    "https://i.ibb.co/S4H1XZ0Z/image-4.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;