import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-112',
  name: 'الدولاب البلاستيك المشهور 3 دور',
  slug: '3-tier-plastic-storage-cabinet',
  story: `الفوضى عدو الأناقة. هذا الدولاب هو حليفك في معركة الترتيب. بتصميمه الذكي الذي يستغل الزوايا، وأبوابه المغناطيسية سهلة الفتح، يحول أي فوضى إلى تنظيم أنيق. ليس مجرد دولاب، بل هو مهندس الديكور الصغير في منزلك. 🏠`,
  description: `حل تخزين عملي وأنيق لأي زاوية في منزلك. تركيب سهل وسريع بدون أدوات, مع أبواب مغناطيسية تفتح من جهتين لسهولة الوصول. يحمي أغراضك من الغبار ويوفر مساحة كبيرة.###FEATURES###- تركيب سهل وسريع بدون أدوات.
- حجم مناسب للزوايا والمساحات الصغيرة.
- يحمي الأغراض من الغبار.
- أبواب مغناطيسية تفتح من جهتين.
- تصميم عملي يناسب كل غرف المنزل.
- سعة تخزين كبيرة ومنظمة.###DETAILS###- المادة: بلاستيك ضد الكسر
- الأبعاد: 54x39x36 سم
- الماركة: جينيريك`,
  price: 135.00,
  images: [
    'https://i.ibb.co/Kc76t5L1/image-1.jpg',
    'https://i.ibb.co/LzjBb0r6/image-2.jpg',
    'https://i.ibb.co/rK5f5qNn/image-3.jpg',
    'https://i.ibb.co/VW7Xb9KB/image-4.jpg'
  ],
  category: 'home',
  warranty: '14 يوم',
};

export default product;
