import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-38',
  name: 'حقيبة السفر وطلعات البر',
  slug: 'travel-and-outdoor-backpack',
  story: `كل رحالة يحتاج إلى رفيق يمكن الاعتماد عليه 🧭. هذه الحقيبة ليست مجرد مكان لوضع الأغراض، بل هي منظّم رحلتك. بجيبها المخصص للابتوب 💻، ومكانها المنفصل للأحذية 👟، ومقاومتها للماء، تضمن لك أن تكون مستعدًا لكل شيء، من اجتماع عمل مفاجئ إلى مغامرة في البر. إنها حقيبة من يفهم معنى السفر.`,
  description: `خامة متينة من بوليستر مقاوم للماء والخدوش. سعة كبيرة توصل لـ40 لتر. حافظة مبطنة تحمي اللابتوب حتى 17 إنش. تصميم مريح للظهر. جيب خاص منفصل للأحذية بفتحات تهوية.###DETAILS###- الماركة: Hp hope
- الخامة: بوليستر
- السعة: 36 إلى 59 لتر
- الأبعاد: 32 × 15 × 44 سم`,
  price: 125,
  images: [
    "https://i.ibb.co/35tXsypG/image-1.jpg",
    "https://i.ibb.co/Hp96gYkD/image-2.jpg",
    "https://i.ibb.co/ds2RngB6/image-3.jpg",
    "https://i.ibb.co/CFFPN6D/image-4.jpg",
    "https://i.ibb.co/xtDf43kg/image-5.jpg",
    "https://i.ibb.co/rGD3xrjP/image-6.jpg"
  ],
  category: 'misc',
};

export default product;
