import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-35',
  name: 'شريحة لتقوية شبكة الجوال',
  slug: 'mobile-signal-booster-sticker',
  description: `قل وداعًا لضعف الإشارة! هذه الشريحة الصغيرة والذكية تعمل على تحسين استقبال شبكة جوالك في الأماكن ضعيفة التغطية مثل المصاعد، الأنفاق، والمباني المغلقة. سهلة التركيب وفعالة.###FEATURES###- تحسن استقبال الشبكة في الأماكن المغلقة.
- تقلل التشويش أثناء المكالمات.
- تعمل مع جميع الجوالات الذكية.
- تصميم خفيف وصغير يسهل لصقه.
- مناسبة للسيارات والمصاعد والمباني.###DETAILS###- الماركة: جينريك
- الضمان: 14 يوم
- المادة: PCB عالية الجودة
- الوزن: 10 جرام
- متوافقة مع: جميع الأجهزة الذكية`,
  price: 49.99,
  category: 'misc',
  warranty: '14 يوم',
};

export default product;
