import { type Product } from '@/lib/types';

const product: Omit<Product, 'images'> = {
  id: 'product-21',
  name: 'تابلت A20',
  slug: 'a20-tablet',
  description: `تجربة رقمية متكاملة في جهاز واحد! تابلت A20 بشاشته الكبيرة وأدائه السريع هو رفيقك المثالي للعمل، الدراسة، والترفيه. يأتي مع مجموعة هدايا قيمة.###FEATURES###- شاشة 7 بوصة عالية الدقة.
- مساحة 256 جيجابايت و 6 جيجا رام.
- نظام تشغيل أندرويد 12.
- بطارية 5000 مللي أمبير.
- كاميرا أمامية 8.0MP وخلفية 13.0MP.###DETAILS###- الاتصال: 5G/SIM/WIFI
- الشاشة: 7 بوصة IPS LCD
- الذاكرة: 256GB + 6GB RAM
- نظام التشغيل: اندرويد 12
- البطارية: 5000 مللي أمبير`,
  price: 499.99,
  category: 'electronics',
  warranty: '6 أشهر',
  story: 'في عالم يتطلب منك أن تكون متعدد المهام، تحتاج إلى جهاز يواكب سرعتك. تابلت A20 هو بوابتك للإنتاجية والترفيه. شاشة كبيرة لأفكارك الكبيرة، وذاكرة قوية لتطبيقاتك المتعددة، وبطارية لا تستسلم في منتصف يومك. هو أكثر من مجرد تابلت، هو نافذتك على العالم الرقمي.',
  faq: [
    {
      question: 'هل يأتي التابلت مع ملحقات؟',
      answer: 'نعم، يأتي التابلت مع حزمة هدايا متكاملة تشمل سماعة بلوتوث، جراب شفاف، شاحن، حامي شاشة، وقلم لمس.'
    },
    {
      question: 'هل يمكن استخدام التابلت كهاتف؟',
      answer: 'نعم، التابلت يدعم تركيب شريحة اتصال ويدعم شبكات 5G، لذا يمكنك استخدامه لإجراء المكالمات والاتصال بالإنترنت من أي مكان.'
    },
    {
      question: 'ما هو نظام التشغيل على الجهاز؟',
      answer: 'الجهاز يعمل بنظام تشغيل أندرويد 12، مما يمنحك الوصول إلى ملايين التطبيقات على متجر Google Play.'
    }
  ]
};

export default product;
