import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-21',
  name: 'تابلت A20',
  slug: 'a20-tablet',
  story: `في عالم يطلب منا أن نكون منتجين ومبدعين في نفس الوقت، يأتي تابلت A20 كجسر بين العالمين 🌉. إنه ليس مجرد جهاز، بل هو لوحة فنية فارغة تنتظر إبداعك 🎨، ومكتبة ضخمة تنتظر شغفك 📚، ونافذة على عالم الترفيه. مع مجموعة الهدايا المرفقة، يصبح كل يوم فرصة لاكتشاف شيء جديد.`,
  description: `شاشة 7 بوصة عالية الدقة. مساحة 256 جيجابايت و 6 جيجا رام. نظام تشغيل أندرويد 12. بطارية 5000 مللي أمبير. كاميرا أمامية 8.0MP وخلفية 13.0MP.###DETAILS###- الاتصال: 5G/SIM/WIFI
- الشاشة: 7 بوصة IPS LCD
- الذاكرة: 256GB + 6GB RAM
- نظام التشغيل: اندرويد 12
- البطارية: 5000 مللي أمبير`,
  price: 499.99,
  images: [
    "https://i.ibb.co/Tqpj0BmW/image-1.jpg",
    "https://i.ibb.co/p6WFsp8Y/image-2.jpg",
    "https://i.ibb.co/v4TFHZ6z/image-3.jpg",
    "https://i.ibb.co/2xGZHFH/image-4.jpg"
  ],
  category: 'electronics',
  warranty: '6 أشهر',
};

export default product;
