import { type Product } from '@/lib/types';

const product: Product = {
  id: 'product-19',
  name: 'كاميرا تصوير أحترافي+ عدسة',
  slug: 'professional-camera-with-lens',
  story: `لكل من يحلم بأن يكون مصورًا محترفًا 📸، هذه الكاميرا هي الخطوة الأولى. لا تدع بساطتها تخدعك، ففي داخلها تكمن القدرة على تجميد اللحظات وتحويل المشاهد العادية إلى لوحات فنية. مع زومها الرقمي القوي وشاشتها الواضحة، ستكتشف العالم من منظور جديد، وتطلق العنان للمصور المبدع الذي بداخلك. 🌟`,
  description: `أطلق العنان للمصور الذي بداخلك! هذه الكاميرا بدقة 16 ميجا بيكسل وزوم رقمي 16x تمنحك القدرة على التقاط صور ومقاطع فيديو رائعة.###FEATURES###- زوم رقمي 16x لتقريب الصور.
- دقة 16 ميجا بيكسل لصور واضحة.
- تصوير فيديو بدقة 720p.
- شاشة 2.4 إنش للمعاينة.
- تثبيت إلكتروني لتقليل الاهتزاز.###DETAILS###- الموديل: HD - 05
- الدقة: 16 ميجا بيكسل
- الزوم: 16x رقمي
- الشاشة: 2.4 إنش`,
  price: 299.99,
  images: [
    "https://i.ibb.co/4nfsgykM/image-1.jpg",
    "https://i.ibb.co/v4vcwbRZ/image-2.jpg",
    "https://i.ibb.co/TpMMKC8/image-3.jpg",
    "https://i.ibb.co/FkwrY6ZN/image-4.jpg",
    "https://i.ibb.co/vCzcmT3m/image-5.jpg",
    "https://i.ibb.co/mF8JJTyt/image-6.jpg"
  ],
  category: 'electronics',
  warranty: '14 يوم',
};

export default product;
